{
  "body": "My name is Sarthak, and on all of my official documents—including my passport, driving license, and national identity card—only my first name, \"Sarthak,\" is present. There is no last name mentioned on any of these documents.\nWhile creating my AWS Certification profile, the system required a last name. Since it was mandatory, I entered a \".\" as my last name to proceed.\nHowever, during my scheduled exam today, the proctor did not allow me to take the test, stating that a last name was required. Despite showing all my valid government-issued IDs clearly displaying my first name \"Sarthak,\" I was still denied the opportunity to appear for the exam.\nWhat should I do?\n\nI understand your frustration with this situation. Based on AWS certification policies, you actually took the correct approach by adding a period (\".\") in the last name field when creating your AWS Training and Certification account. This is the recommended solution for candidates who only have a first name or last name on their official identification.\nGiven that the proctor did not allow you to take the exam despite following this policy, here are the steps you should take:\nContact AWS Certification Support immediately. Explain the situation in detail, mentioning that you followed the official policy for single-name individuals but were still denied the opportunity to take the exam.\nProvide them with your AWS Certification account ID, the exam you were scheduled for, and the date and time of the exam.\nClearly state that your official government-issued IDs only show your first name \"Sarthak\" and that you used a period (\".\") as your last name in the AWS Certification account as per their policy.\nRequest their assistance in resolving this issue and ask for guidance on how to proceed with taking the exam.\nIf possible, also reach out to Pearson VUE support, as they often handle the proctoring for AWS exams. Explain the situation to them as well.\nKeep all communication records and any instructions you receive from AWS or Pearson VUE.\nAsk for a rescheduling of your exam without additional charges, given that you were incorrectly prevented from taking it despite following their policy.\nRemember to be patient but persistent in your communication. AWS should be able to resolve this issue for you, as their policy explicitly addresses your situation. If you don't receive a satisfactory response initially, don't hesitate to escalate the issue or request to speak with a supervisor who is familiar with the single-name policy for certification exams.\nSources\nAWS CCP EXAM SCHEDULE LAST NAME ISSUE | AWS re:Post\nAWS Certification account last name update - it's urgent | AWS re:Post"
}