{
  "body": "Hi,\nI’ve noticed an increase in SMS delivery failures over the past 2–3 weeks.\nAfter reviewing our logs, I observed that the affected messages all seem to be targeting numbers with the same phone carrier: Rogers Communications Canada Inc.\nHas anyone else experienced similar issues recently?\nHere’s an example log entry:\nExample of log :\n{\"notification\":{\"messageId\":\"7afbd248-c15d-5dc5-955b-b28024560f8f\",\"timestamp\":\"2025-06-15 15:12:11.095\"},\"delivery\":{\"phoneCarrier\":\"Rogers Communications Canada Inc.\",\"mnc\":720,\"numberOfMessageParts\":2,\"destination\":\"FAKENUMBER\",\"priceInUSD\":0.02696,\"smsType\":\"Transactional\",\"mcc\":302,\"providerResponse\":\"Unknown error attempting to reach phone\",\"dwellTimeMs\":44,\"dwellTimeMsUntilDeviceAck\":2151},\"status\":\"FAILURE\"}\nHave a good day,\nBest,\nFL\n\nBased on your log entry, I can see you're experiencing SMS delivery failures with Rogers Communications Canada Inc. as the carrier, with the error message \"Unknown error attempting to reach phone.\"\nThere are several potential reasons for these SMS delivery failures:\nCarrier filtering: Mobile carriers like Rogers may implement their own filtering mechanisms that could be blocking your messages. This could be due to content filtering, volume limitations, or carrier-specific policies.\nNetwork issues: There might be temporary network issues or outages affecting delivery to Rogers specifically.\nRecipient opt-out status: The recipients may have opted out of receiving messages from your number.\nMessage content: Your message content might be triggering spam filters with this specific carrier.\nTo troubleshoot this issue:\nReview your message content to ensure it complies with carrier guidelines.\nMonitor your CloudWatch logs for more detailed error messages or patterns specific to Rogers.\nTest with different recipient numbers on the Rogers network to determine if the issue is widespread or limited to specific numbers.\nEnable and review detailed SMS delivery logs to get more information about the failures.\nConsider reaching out to AWS Support with specific message IDs and timestamps if the issue persists, as they may have more insight into carrier-specific issues.\nThe \"Unknown error attempting to reach phone\" message suggests there might be an issue between AWS and the Rogers network that's preventing successful delivery. This could be temporary, but since you've noticed it for 2-3 weeks, it might require further investigation.\nSources\nSNS SMS Deliverability Issue (TEXT_BLOCKED) Despite 10DLC Registration | AWS re:Post\nAWS SNS can not send SMS to mobile phone | AWS re:Post\nAmazon SNS SMS delivery monitoring with Amazon CloudWatch metrics and logs - Amazon Simple Notification Service\nAWS SNS is sending weird SMS | AWS re:Post"
}