{
  "body": "As captioned, please share, any link and suggestions are welcome!\n\nAmazon Q Developer now supports Model Context Protocol (MCP) in IDE plugins like VS Code and JetBrains, allowing developers to integrate external tools for more contextual workflows. This opens the door to more customized, AI-assisted development experiences.\nhttps://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-reinforce-2025-aws-waf-aws-control-tower-and-more-june-16-2025/\n\nAWS has introduced several services that support the Model Context Protocol (MCP), which is an open protocol for standardizing how AI models securely access external tools, data sources, and APIs.\nCurrently, AWS offers MCP servers for:\nAWS Serverless (AWS Lambda)\nAmazon Elastic Container Service (Amazon ECS)\nAmazon Elastic Kubernetes Service (Amazon EKS)\nFinch\nThese MCP servers enhance AI-assisted development by providing AI code assistants with real-time, contextual understanding of AWS services. They incorporate AWS operational best practices, Well-Architected principles, and service-specific optimizations.\nAdditionally, Amazon Q Developer CLI now supports MCP, allowing developers to leverage a wider range of tools and prompts for richer contextual development workflows. This integration enables Amazon Q to provide more customized responses by orchestrating tasks across native and MCP server-based tools.\nAWS is also working on integrating MCP with Amazon Bedrock, which would streamline integration between language models and AWS data services. For AWS customers, MCP represents an opportunity to use existing AWS security mechanisms like IAM for consistent access control and to build composable, scalable AI solutions.\nTo get started with MCP on AWS, you can explore the aws-labs GitHub repository, which contains installation guides, example configurations, and additional specialized servers.\nSources\nEnhance AI-assisted development with Amazon ECS, Amazon EKS and AWS Serverless MCP server | AWS News Blog\nAnnouncing new Model Context Protocol (MCP) Servers for AWS Serverless and Containers - AWS\nUnlocking the power of Model Context Protocol (MCP) on AWS | AWS Machine Learning Blog\nAmazon Q Developer CLI now supports Model Context Protocol (MCP) - AWS\n\nDear Yan Shum,\nI wanted to share some helpful resources regarding Model Context Protocol (MCP) server implementation:\nFor a detailed walkthrough on using MCP server (EKS) with Amazon Q and VS Code, please refer to this comprehensive guide:\nhttps://repost.aws/articles/AR8_eCUcF6QHK8BZrzK4zxHw/managing-eks-clusters-with-amazon-q-and-the-eks-mcp-server-in-your-ide\nYou can find all AWS-provided MCP servers in our official repository:\nhttps://awslabs.github.io/mcp/\nThese resources should help you implement MCP servers according to your requirements. The EKS example in the article can serve as a template for implementing other MCP servers as well.\nThank you!\nPlease upvote if you are satisfied with the answer!"
}