{
  "body": "I have an app runner app deployed to ap-southeast-1.\nIt started returning 404 errors at around 9am Asia/Manila time.\nI have tried to re-deploy but it fails .\nHealth check is successful but deploy fails with unable to route traffic.\nMetrics show that my app stopped getting any sort of activity when we started encountering 404's\nHas anybody encountered the same ?\n\nSame issue I experienced today, it seems only apprunner public url not accessible because the private url works fine.\n06-23-2025 10:36:27 AM [AppRunner] Successfully pulled your application image from ECR.\n06-23-2025 10:36:36 AM [AppRunner] Provisioning instances and deploying image for publicly accessible service.\n06-23-2025 10:36:45 AM [AppRunner] Performing health check on protocol\nHTTP\n[Path: '/'], [Port: '3000'].\n06-23-2025 10:38:01 AM [AppRunner] Health check is successful. Routing traffic to application.\n06-23-2025 10:44:23 AM [AppRunner] Failed to route incoming traffic to application.\n06-23-2025 10:51:15 AM [AppRunner] Deployment with ID : cb4ac0216a584e5eb9dd44fa90139d7 failed. Failure reason : Failed to route traffic.\n\nHello.\nI checked the AWS health dashboard and didn't find any reports of any issues with ap-southeast-1.\nAt this point, it is difficult to determine whether AWS is slow to detect the problem or whether the problem is specific to your AWS account.\nhttps://health.aws.amazon.com/health/status\nFor a simple test, try deploying another AppRunner. If you get the same error, I recommend contacting AWS Support via \"Account and billing.\"\nContacting \"Account and billing\" is free of charge.\nhttps://docs.aws.amazon.com/awssupport/latest/user/case-management.html\n\nour production instance is running yesterday without any changes then just today, can't access the public endpoint.\n\nRe- deployment fails.\nI have contacted support and they said that they will forward the concern to their technical team.\nThank you.\n\nHey, I’ve seen this pop up a few times on App Runner, and your logs match the classic scenario. You’re right—the app seems healthy, but App Runner is failing to route traffic and serving 404s on the public endpoint.\nThis often happens due to an incorrect or missing Host header or SNI, not necessarily because the app itself is broken.\n**This is what I am assuming.\nApp Runner uses the Host header (for HTTP) or SNI (for HTTPS) to route requests to your service.\nIf those headers don’t match what App Runner expects (the service’s internal domain, not your custom domain), you’ll get a 404 or “unable to route traffic” error\nhttps://docs.aws.amazon.com/apprunner/latest/dg/request-route-404-troubleshoot.html?utm_source=chatgpt.com\n.\nTo Check\nAre you hitting the public App Runner URL directly?\ncurl -I -H \"Host: your-app-id.apprunner.aws-region.amazonaws.com\"\nhttps://your-app-id.apprunner.aws-region.amazonaws.com/\nIf that works, then it’s routing using the Host header.\nUsing a custom domain or CloudFront in front of App Runner?\na) Make sure the Origin Request Policy is set to AllViewerExceptHostHeader.\n\n  b) That ensures App Runner sees its own domain in Host/SNI, not the custom URL (https://www.reddit.com/r/aws/comments/1ejofm2/404_from_cloudfront_with_apprunner_as_an_origin/?utm_source=chatgpt.com)\nPrivate URL working fine? Good sign!\na) If the private URL works and public URL doesn’t, it's almost always a Host/SNI mismatch.\nNext STeps\nIf hitting directly → set proper Host/SNI header.\nIf using CloudFront or custom domain → switch to AllViewerExceptHostHeader.\nRedeploy after checking that your domain config matches App Runner’s expectations.\n\nThank you for this. I don't think it's any of this as the app has been deployed for over a month with no issues and then all of a sudden at we started experiencing 404 errors.\n\nBased on the symptoms you're describing, there could be several potential causes for your AWS App Runner service returning 404 errors and failing to deploy in the ap-southeast-1 region.\nThis could potentially be an account-specific issue rather than a regional service disruption. In similar cases, users have reported that their App Runner deployments failed repeatedly despite proper configuration, and the solution was an \"account refresh\" performed by AWS Support. According to reports, this happens when certain quotas related to App Runner service become restricted for an AWS account based on usage patterns, preventing App Runner instances from launching properly.\nHere are some troubleshooting steps you can take:\nCheck your application logs in the App Runner console to see if there are any specific error messages that might explain the 404 errors.\nVerify that your health check configuration is correct - while you mentioned health checks are successful, there might be a mismatch between the health check path and your actual application routes.\nTry deploying a simple test application to see if the issue is specific to your application or affects any deployment in your account.\nIf you're using a VPC connector, verify that your network configuration is correct, including security groups and subnet settings.\nTry deploying in a different region to determine if this is region-specific.\nIf all else fails, contact AWS Support. They may need to perform an \"account refresh\" to resolve quota-related restrictions that could be preventing your App Runner service from functioning properly.\nThe fact that metrics show no activity coinciding with the 404 errors suggests that traffic might not be reaching your application at all, which aligns with deployment failures and routing issues.\nSources\nAWS App Runner not passing health check for a simple python application | AWS re:Post\nAWS App Runner Failing to List Services | AWS re:Post\nRebuilding a failed App Runner service - AWS App Runner\n\nIt seems the issue starts at 9 AM same as @hamiltonchua\nhere's mine.\n\nsame as me, why is this happening, no changes to anything, but apprunner not working for few hours then back on. why?"
}