{
  "body": "Hi, Maybe somebody already configured this feature from the AWS Opensearch centralised dashboard.\nI can connect it to my Identity Center. The screenshot shows that all good.\nBut when I try to assign groups or users nothing appears here.\nAlso I see that the role which assigned to this Opensearch Dashboard App never uses this role.\nAnybody maybe had already configured it ?\n\nWhen configuring AWS IAM Identity Center with Amazon OpenSearch Service for dashboard access, there are a few key points to address your issue:\nFor the empty users/groups list: This typically happens when the IAM Identity Center integration is configured but the proper permissions aren't set up correctly. Make sure that:\nYou've properly configured the IAM Identity Center instance ARN in your OpenSearch application settings\nThe IAM role you're using has the necessary permissions to access the IAM Identity Center directory\nThe attribute keys for users and groups are correctly specified (such as UserId/UserName/Email for users and GroupId/GroupName for groups)\nFor the role not being used: When setting up an OpenSearch UI application with IAM Identity Center, you need to:\nEnsure the IAM role specified in the \"iamRoleForIdentityCenterApplicationArn\" parameter has the required permissions\nConfigure dashboard administrators using the \"opensearchDashboards.dashboardAdmin.users\" or \"opensearchDashboards.dashboardAdmin.groups\" parameters\nMake sure the IAM Identity Center instance is properly enabled with \"enabled\": true\nYou can update your application configuration using the AWS CLI with the create-application or update-application commands, specifying the correct IAM Identity Center instance ARN and the appropriate user/group IDs for dashboard administration.\nFor OpenSearch domains, you may also need to update the domain configuration to support IAM Identity Center Trusted Identity Propagation, specifying the appropriate SubjectKey (UserId/UserName/UserEmail) and RolesKey (GroupId/GroupName) values.\nSources\nGetting started with the OpenSearch user interface in Amazon OpenSearch Service - Amazon OpenSearch Service\nIAM Identity Center support for Amazon OpenSearch Serverless - Amazon OpenSearch Service\nIAM Identity Center Trusted Identity Propagation Support for Amazon OpenSearch Service - Amazon OpenSearch Service\n\nThe IAM role you're using has the necessary permissions to access the IAM Identity Center directory\nWhich permissions needed for this role ?\nThe attribute keys for users and groups are correctly specified (such as UserId/UserName/Email for users and GroupId/GroupName for groups)\nWhere to configure it ? I did not see such fields in Opensearch Dashboard UI"
}