{
  "body": "How do I make a single file in my S3 bucket publicly accessible?\nI have a file in my S3 bucket that I want to share with others through a direct URL. I don’t want to make the whole bucket public, just this one file.\nHow can I do that in the AWS Console or using the right settings?\nBeginner here, so simple instructions would be appreciated!\nTags to add:\nAmazon S3\nAWS Identity and Access Management (IAM)\nS3 Bucket Policies\n\nTo make a single file in your S3 bucket publicly accessible, you'll need to follow these steps:\nFirst, you need to modify the Block Public Access settings for your bucket:\nGo to the S3 console and navigate to your bucket\nClick on the \"Permissions\" tab\nFind the \"Block public access\" section and click \"Edit\"\nUncheck \"Block all public access\" (you may need to uncheck all four individual settings)\nSave the changes by typing \"confirm\" when prompted and clicking \"Confirm\"\nMake the specific object (file) public:\nGo to the \"Objects\" tab in your bucket\nSelect the file you want to make public\nClick \"Actions\" and choose \"Make public using ACL\"\nConfirm the action\nAlternatively, if you prefer using bucket policies instead of ACLs (especially if you have \"Bucket owner enforced\" object ownership setting), you can:\nGo to the \"Permissions\" tab of your bucket\nUnder \"Bucket Policy\", click \"Edit\"\nAdd a policy that grants public read access to only your specific file:\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Sid\": \"PublicReadForSingleObject\",\n\"Effect\": \"Allow\",\n\"Principal\": \"*\",\n\"Action\": \"s3:GetObject\",\n\"Resource\": \"arn:aws:s3:::YOUR-BUCKET-NAME/YOUR-FILE-NAME\"\n}\n]\n}\n(Replace YOUR-BUCKET-NAME with your actual bucket name and YOUR-FILE-NAME with the path to your file)\n4. Save the changes\nAfter completing these steps, you should be able to access your file using its S3 object URL. Keep in mind that making objects public has security implications, so only do this for content that you intend to be publicly accessible.\nSources\nHow do I obtain a public access link for my S3 bucket resource? | AWS re:Post\nCan't Open a Link to download a File | AWS re:Post\nModule 5. Test your setup"
}