{
  "body": "Hi!!\nCan one use the same email sending domains and campaigns in more than one SES account?\nAny evidence would be appreciated.\nSome say NO .. yet online it says YES.\nperplexity says YES also\n-You can use the same email sending domain across multiple Amazon SES accounts.\nDomain verification is required in each SES account or region—add all generated DNS records to your domain’s DNS.\nFor DKIM, add separate CNAME records for each SES account to your DNS settings.\nCampaigns (templates, recipient lists) are managed independently in each SES account, but can use the same sending domain.\nDeliverability and reputation are tracked separately for each SES account.\nProper DNS management is essential to avoid conflicts and ensure all SES accounts are authorized to send on behalf of your domain.\n\nYes, it is possible to use the same email sending domains and campaigns across multiple Amazon SES accounts, but there are important considerations and steps to follow.\nWhen using the same domain across multiple SES accounts:\nYou need to verify the domain in each SES account or region where you want to use it. This involves adding the required DNS records (CNAME, TXT, MX) for each account to your domain's DNS settings.\nFor DKIM (DomainKeys Identified Mail), you'll need to add separate CNAME records for each SES account to your DNS settings to ensure proper authentication.\nYou can set up custom MAIL FROM domains for each account, which may require additional DNS configuration.\nCampaigns, including email templates and recipient lists, are managed independently in each SES account. While you can use the same sending domain, you'll need to set up and manage your campaigns separately in each account.\nIt's important to note that deliverability metrics and sender reputation are tracked separately for each SES account, even when using the same domain.\nYou can use sending authorization to allow other AWS accounts to send emails on behalf of your verified domain. This involves creating sending authorization policies for the identities you want to share.\nWhen using multiple regions, you can use the same custom MAIL FROM domain for verified identities across different AWS Regions, but you'll need to manage bounce notifications carefully.\nWhile it is technically possible to use the same domain across multiple SES accounts, it requires careful management of DNS records and configurations to avoid conflicts and ensure all accounts are properly authorized to send on behalf of your domain. It's also important to consider the potential impact on deliverability and reputation management when splitting your sending across multiple accounts.\nSources\nIs it possible to have multiple domains and emails for SES on the same AWS account ? The domains and email accounts work separately / independently. | AWS re:Post\nUsing sending authorization with Amazon SES - Amazon Simple Email Service\nRegions and Amazon SES - Amazon Simple Email Service\nUsing sending authorization with Amazon SES - Amazon Simple Email Service\nAWS SES domain identity verification and MAIL FROM configuration | AWS re:Post\n\nYes, you can use the same email sending domain across multiple Amazon SES accounts.\nBut you have to configure it correctly in each account:\nVerify the domain separately in each SES account (or region). That means adding a unique TXT record per account to your domain’s DNS.\nAdd separate DKIM CNAME records for each account. Your DNS can hold all of them, there’s no conflict.\nCampaigns and templates are managed independently, so you’d need to recreate or sync them across accounts manually.\nDeliverability, bounce/complaint tracking, and reputation are per account, so one account’s issues won’t affect the others.\nReference:\nhttps://repost.aws/questions/QUc0sl2VB6QFSje_SA58wQ9g/is-it-possible-to-have-multiple-domains-and-emails-for-ses-on-the-same-aws-account-the-domains-and-email-accounts-work-separately-independently\nSo yes, it’s 100% doable, and I’ve done it in production. Just manage your DNS carefully, and you’re good to go."
}