{
  "body": "I'm totally new to monitoring, but after reading a bunch of articles and resources on observability in Kubernetes, I tried to put together this EKS monitoring stack that combines different tools like ADOT, Fluent Bit, Amazon Managed Prometheus (AMP), Grafana OSS, and Loki (Grafana Cloud). We're currently running an EKS cluster and expect it to scale over time, so to avoid potentially high costs from CloudWatch Container Insights and log ingestion, we're exploring this more open-source-centric approach that selectively uses AWS managed services. I’d really appreciate feedback—does this architecture look correct and feasible for production use? Also, how do I go about estimating the costs involved with AMP, Loki, S3 (for cold storage), and running Grafana OSS?\n\nYour proposed EKS monitoring architecture using AMP, ADOT, Fluent Bit, Loki, and OSS Grafana is a valid approach for monitoring an EKS cluster. This setup combines AWS managed services with open-source tools, which can provide a flexible and cost-effective solution for monitoring and observability.\nThe architecture you've outlined includes:\nAWS Distro for OpenTelemetry (ADOT) for metrics collection\nAmazon Managed Service for Prometheus (AMP) for metrics storage and querying\nFluent Bit for log collection\nLoki (Grafana Cloud) for log aggregation and querying\nOpen Source Grafana for visualization\nS3 for cold storage of logs\nThis combination allows you to leverage the scalability and managed aspects of AMP while using open-source tools for other components, potentially reducing costs compared to a full CloudWatch-based solution.\nTo estimate costs for this architecture:\nAmazon Managed Service for Prometheus (AMP):\nCosts are based on ingestion rate, storage, and querying.\nYou'll need to estimate your metrics volume and retention period.\nS3 for cold storage:\nCosts depend on the amount of data stored and the storage class used.\nConsider lifecycle policies to move data to cheaper storage tiers over time.\nLoki (Grafana Cloud):\nPricing is typically based on log ingestion rate and retention period.\nCheck Grafana Cloud's pricing page for current rates.\nOpen Source Grafana:\nCosts here will primarily be the compute resources to run Grafana in your EKS cluster.\nEKS cluster resources:\nFactor in the additional CPU and memory required to run ADOT and Fluent Bit on your nodes.\nTo get an accurate cost estimate, you'll need to:\nEstimate your metrics and log volumes\nDetermine your retention requirements\nEstimate query volumes for both metrics and logs\nCalculate the additional cluster resources needed for running the monitoring components\nRemember that while this architecture can be cost-effective, it does require more management overhead compared to fully managed solutions like CloudWatch. Ensure you have the necessary expertise to maintain and troubleshoot this stack in a production environment.\nAs your cluster scales, regularly review and optimize your monitoring setup to ensure it remains cost-effective and meets your observability needs.\nSources\nPrometheus monitoring on Amazon EKS - AWS Prescriptive Guidance\nMonitoring tools for Amazon EKS - AWS Prescriptive Guidance\nMonitoring - Implementing Microservices on AWS\nHow does KRO integrate with monitoring and logging systems? | AWS re:Post"
}