{
  "body": "Hello,\nI am a new AWS user, I failed to create a EMR serverless studio with the message \"Failed to create Studio. Failed to create Serverless application. [object Object]\" for interactive workloads under my IAM admin account.\nRegardless of this, the corresponding S3 and the IAM role were still created for those but the studio wasn't.\nPlease help me out on this every beginning step of others! Thank you!\nRegards,\nDat\n\nI understand you're having trouble creating an EMR Serverless studio as a new AWS user. This error can occur due to a few reasons, primarily related to permissions. Here are some steps you can take to troubleshoot and resolve the issue:\nCheck IAM permissions: Ensure your IAM admin account has the necessary permissions to create an EMR Serverless studio. This includes permissions for EMR Serverless API operations, particularly the 'createApplication' action.\nVerify the service role: Make sure the EMR Studio service role has the required permissions to create and manage EMR Serverless applications. The role should have appropriate access to EMR Serverless, S3, and other related services.\nReview S3 bucket permissions: Confirm that the service role has proper access to the S3 bucket specified for the EMR Studio. This includes permissions to read from and write to the bucket.\nCheck for conflicting policies: Ensure there are no conflicting IAM policies attached to your user or role that might be denying the necessary permissions.\nValidate the trust relationship: Verify that the IAM role's trust policy allows Amazon EMR to assume the role.\nClear browser cache: Sometimes, browser cache issues can cause problems. Try clearing your browser cache or accessing the console from an incognito/private window.\nCheck CloudTrail logs: You can search CloudTrail logs for denied actions related to EMR Serverless and EMR Studio creation. This might provide more detailed information about the specific permission or action that's failing.\nIf you've verified all these points and are still encountering issues, you may need to contact AWS Support for further assistance. They can provide more specific guidance based on your account configuration and the exact error details.\nSources\nTroubleshoot Failed to create Studio errors in Amazon EMR | AWS re:Post\nTroubleshoot IAM issues with the EMR Serverless console | AWS re:Post"
}