{
  "body": "Hi all\nI'd love to configure Organization level backup policies using AWS Backup. I can see there are two options \"Visual editor\" and \"JSON\" as follows. Are they interchangeable? Both are visible to the users regardless of the options users chose? I mean if I created the 1st version of the policy with \"Visual editor\", can I see the corresponding JSON when I want to edit it later, and vice versa?\nVisual editor\nJSON\nIf not, which one provides granular control? And examples?\nThanks.\n\nYes, the Visual editor and JSON options for AWS Backup policies in AWS Organizations are interchangeable. When you create a backup policy using the Visual editor, you can later view and edit the same policy in JSON format, and vice versa. This allows you flexibility in how you manage your backup policies.\nRegarding granular control, the JSON editor typically provides more advanced capabilities, especially for complex resource selection criteria. For example, with JSON, you can implement more sophisticated backup strategies such as:\nSelecting specific resources by resource type\nExcluding resources based on resource type or tags\nUsing combinations of multiple tags within the same resource selection\nCreating more complex conditional logic for resource selection\nThe JSON approach is particularly useful when you need to implement flexible backup strategies across your organization by combining multiple resource types and/or tags. It also allows you to exclude resources you don't want to back up using resource type or tag criteria, which can help optimize costs for non-critical resources.\nTo use these advanced selection features, you would create or modify a resource selection using the JSON editor in either the AWS Organizations or AWS Backup console. This gives you more precise control over which resources are included in your backup policies.\nSources\nEnhance resource selection in AWS Backup Policies in AWS Organizations | AWS Storage Blog\nAWS Backup now supports resource type and multiple tag selections in backup policies  - AWS"
}