{
  "body": "Hi:\nI created a directory bucket in S3 and put some objects in it with the intention of making those objects publicly accessible after I had uploaded them to the bucket.\nTurns out that when I set up the bucket, I chose the \"block all public access\" setting, and set the bucket up so that object ownership is \"Bucket owner enforced\".\nReading the docs to find out how to change these settings has left me totally confused.  I have the vague impression that that given my initial choices is setting up the bucket, it is now impossible for me to change settings in a way that would make the objects in the bucket public, and thus my only option is to destroy the bucket and start over. Is that correct?\nIf not, please tell me how how to make the objects in my bucket public.\n\nhi,\nyou are right looks like directory bucket can't be public  \"Directory buckets have all S3 Block Public Access settings enabled by default\"\nthis is AWS Doc says for Directory Buckets.\n\"Directory buckets have all S3 Block Public Access settings enabled by default at the bucket level. S3 Object Ownership is set to bucket owner enforced and access control lists (ACLs) are disabled. These settings can't be modified.\"\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/directory-buckets-overview.html\nBest,\n\nYou can still make your objects publicly accessible even after initially setting up your bucket with \"Block all public access\" enabled and \"Bucket owner enforced\" object ownership. You don't need to destroy the bucket and start over.\nHere's how to make your objects publicly accessible:\nFirst, you need to modify the Block Public Access settings for your bucket:\nGo to the S3 console and navigate to your bucket\nClick on the \"Permissions\" tab\nFind the \"Block public access\" section and click \"Edit\"\nUncheck \"Block all public access\" (you may need to uncheck all four individual settings)\nSave the changes\nAfter disabling Block Public Access, you can make your objects public by either:\nOption A: Adding a bucket policy that grants public read access:\nIn the \"Permissions\" tab, go to \"Bucket policy\"\nAdd a policy similar to this (replace YOUR_BUCKET_NAME with your actual bucket name):\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Sid\": \"PublicReadGetObject\",\n\"Effect\": \"Allow\",\n\"Principal\": \"*\",\n\"Action\": \"s3:GetObject\",\n\"Resource\": \"arn:aws:s3:::YOUR_BUCKET_NAME/*\"\n}\n]\n}\nNote that even with \"Bucket owner enforced\" object ownership (which disables ACLs), you can still make objects public using bucket policies. The bucket policy approach is actually the recommended way to grant public access rather than using ACLs.\nRemember that making S3 objects public is not recommended for most use cases due to security concerns. Consider if there are alternative approaches that might better suit your needs, such as using pre-signed URLs for temporary access.\nSources\nSetting permissions for website access - Amazon Simple Storage Service\nIs my bucket publicly accessible? | AWS re:Post\nHow to make bucket or objects public? | AWS re:Post\nAccess control in Amazon S3 - Amazon Simple Storage Service\nBlocking public access to your Amazon S3 storage - Amazon Simple Storage Service\n\nUnfortunately, Step 1 in these instructions seems to be based on a false premise.  On the permissions tab for my bucket, the Block public access settings say \"These settings can't be edited\"."
}