{
  "body": "Hi, I created a http v2 apigateway route that integrates with a lambda. But I am getting 500 error code. There is apigateway log but no lambda log in Cloudwatch. The authorization passed. I also checked the role setting and it seems right. There is no error message about lacking permissions. Any suggestions on debugging?\n\nWhen you're experiencing a 500 Internal Server Error with your HTTP API v2 Lambda integration and seeing API Gateway logs but no Lambda logs, this suggests that API Gateway is unable to invoke your Lambda function properly. Here are some troubleshooting steps you can take:\nCheck your logs thoroughly\n:\nAdd\n$context.integrationErrorMessage\nto your API Gateway logging format\nAlso include\n$context.error.message\nand\n$context.error.responseType\nfor more detailed error information\nView the latest log stream in CloudWatch to identify the specific issue\nVerify permissions\n:\nEnsure API Gateway has explicit permission to invoke your Lambda function\nYou may need to add a resource-based policy to your Lambda function that grants API Gateway the necessary permissions\nEven if you think the role settings are correct, this is a common issue that might not show clear error messages\nCheck Lambda authorizer issues\n(if you're using one):\nIf API Gateway can't invoke your Lambda authorizer or if the authorizer returns an invalid response format, clients will receive a 500 error\nSince you mentioned authorization passed, this might not be the issue, but it's worth checking the authorizer response format\nTest the Lambda function directly\n:\nInvoke your Lambda function directly through the Lambda console to verify it works independently of API Gateway\nThis can help determine if the issue is with the function itself or the integration\nVerify deployment\n:\nMake sure you've properly deployed your API after making any changes\nSometimes changes to integrations require redeployment to take effect\nIf you're still experiencing issues after these steps, you might need to examine your Lambda function code for potential errors or check if there are any account-specific configurations affecting your setup.\nSources\nControl access to HTTP APIs with AWS Lambda authorizers - Amazon API Gateway\nTroubleshooting issues with HTTP API Lambda integrations - Amazon API Gateway\nCreating api gateway api from openapi specification with lambda integration does not create triggers | AWS re:Post"
}