{
  "body": "I was trying to create QuickSight. After following the creation, I got\n\"error\": [\"Please (re)authenticate or return to https://console.aws.amazon.com\"]\nat the signup process. Now I neither can add another user nor create a namespace.\naws quicksight describe-account-subscription --aws-account-id xx --profile=xx\n\n{\n    \"Status\": 200,\n    \"AccountInfo\": {\n        \"AccountName\": \"quicksight-admin\",\n        \"Edition\": \"ENTERPRISE\",\n        \"NotificationEmail\": \"myEmail\",\n        \"AuthenticationType\": \"IDENTITY_POOL\",\n        \"AccountSubscriptionStatus\": \"SIGNUP_ATTEMPT_IN_PROGRESS\"\n    },\n    \"RequestId\": \"----\"\n}\naws quicksight list-namespaces --aws-account-id xx --profile=xx\n\n{\n    \"Namespaces\": [\n        {\n            \"Name\": \"default\",\n            \"Arn\": \"arn:aws:quicksight:eu-central-1:xx:namespace/default\",\n            \"CapacityRegion\": \"eu-central-1\",\n            \"CreationStatus\": \"CREATING\",\n            \"IdentityStore\": \"QUICKSIGHT\"\n        }\n    ],\n    \"Status\": 200,\n    \"RequestId\": \"-----\"\n}\n\nIt appears you're experiencing an issue with your QuickSight account creation process being stuck in an incomplete state. Based on the output you've shared, your QuickSight account subscription status is \"SIGNUP_ATTEMPT_IN_PROGRESS\" and your namespace is in a \"CREATING\" state.\nThis situation can occur due to several reasons:\nInsufficient permissions: The IAM role or user you're using might not have all the necessary permissions to complete the QuickSight setup process.\nAuthentication issues: The error message suggests there might be an authentication problem during the signup process.\nQuickSight subscription status: Your account is currently in a \"SIGNUP_ATTEMPT_IN_PROGRESS\" state, which indicates the signup process hasn't completed successfully.\nTo resolve this issue, try the following steps:\nVerify that your IAM user or role has the appropriate permissions to create and manage QuickSight resources.\nTry signing in again to the AWS console and completing the QuickSight setup process.\nIf the issue persists, you may need to contact AWS Support to help reset your QuickSight subscription status, as it appears to be stuck in a transitional state.\nCheck if there are any corporate restrictions that might be preventing the completion of the account creation process, especially if you're using a corporate email address.\nThe \"CREATING\" status for your namespace and \"SIGNUP_ATTEMPT_IN_PROGRESS\" for your account subscription indicates that the process was initiated but didn't complete successfully, which is why you're unable to add users or create additional namespaces.\nSources\nQuickSight data source creation via CloudFormation fails with \"Resource of type 'AWS::QuickSight::DataSource' with identifier 'ds1' was not found.\" | AWS re:Post\nAccount creation | AWS re:Post\n\n1- My account is admin account but the QuickSight creation process was run by another account which has a permission set containing all the QuickSight related policies.\n2-  When I try to access the website; for my account I get a UI asking for an email. But it returns\n{\"action\":null,\"errorCode\":\"DIRECTORY_NOT_READY\",\"message\":null}\nFor the account that set the creation process gets\n\"error\": [\"Please (re)authenticate or return to https://console.aws.amazon.com\"]\nwith no UI at all."
}