{
  "body": "I did try to create a structured knowledge base for Bedrock. Left everything to default settings and let Bedrock to create new IAM role. Things go fine, until I try to sync. Sync starts (IN_PROGRESS) for a short moment and then I get the error as shown below.\nMost of information is for creating unstructured knowledge bases. Anyone have run to similar issue or have ideas what could be causing this? I did populate my Redshift cluster from RDS database using zero-ETL integration. Data synced fine and I can run Redshift queries. I tested syncing both ETL enabled and disabled with no diffirence.\nOr if you have a link to detailed tutorial how to create a structured knowledge base for Bedrock. I've watched the re:Invent session but it didn't to deep enough into details to be helpful.\nhttps://www.youtube.com/watch?v=SdKfdkec7SQ\nUPDATE:\nI seem this might be region specific thing. Everything is working smoothly in eu-west-1 but above failure happens in eu-north-1.\nBedrock model selection is different between regions. Could this be the root cause?\neu-north-1:\neu-west-1:\n\nHi, did you you enabling logging to CloudWatch logs? This was the only way I was able to figure out the metadata file had a 10kb limit.\nhttps://docs.aws.amazon.com/bedrock/latest/userguide/knowledge-bases-logging.html\n\nI don't think there is such option for structured knowledge bases.\n\nBased on your description, it appears you're experiencing an issue with syncing your Bedrock Knowledge Base. There are several common reasons why the sync might fail without providing a clear error message:\nModel access permissions: The most likely cause is that you haven't subscribed to or requested access to the embedding model being used by your Knowledge Base. Even though you've created the Knowledge Base successfully, the sync process requires access to specific Bedrock models (like Amazon Titan Embed) to generate vector embeddings. Check the \"Model access\" section in the Bedrock console and ensure you've subscribed to the necessary models.\nIAM role permissions: While you mentioned letting Bedrock create a new IAM role, the default role might not have all necessary permissions. The Knowledge Base role needs permissions to call the specified Bedrock embedding model, access your Redshift data, and manage the vector store.\nVector store configuration: If you're using Amazon OpenSearch Serverless as your vector store (which is often the default), ensure that the vector index is properly configured with the 'faiss' engine.\nSync process limitations: There might be an ongoing sync process that's not visible in the UI, or there could be issues with the console interface itself.\nTo troubleshoot:\nCheck CloudTrail logs for any \"StartIngestionJob\" API execution details\nVerify you have access to the embedding model being used (typically Amazon Titan Embed)\nRefresh the page and try the sync again\nCheck if there are any size limitations or format issues with your data in Redshift\nMany users have resolved similar issues by subscribing to the required embedding model in the Bedrock Marketplace, particularly the Amazon Titan Embed model.\nSources\nBedrock Data source sync does not work | AWS re:Post\nData sync failed error in Amazon Bedrock Knowledgebase | AWS re:Post\nBedrock knowledge base data source sync is not working | AWS re:Post\n\nTitan is enabled\nDid try even adding Admin policy to IAM role, but no effect.\nThis doesn't apply to structured knowledge bases.\nThis was the initial sync failing."
}