{
  "body": "Hi all,\nI’m hoping someone can help clarify a hybrid identity question!\nHere’s my setup:\nI have AWS FSx for Windows File Server and AWS Managed Active Directory (no on-premises AD).\nMy FSx file shares are joined to AWS Managed AD, and users can authenticate if they exist in AWS Managed AD.\nI also have Microsoft Entra ID (Azure AD).\nI set up Entra Connect/Azure AD Connect to sync users, but the default direction is from AWS Managed AD → Entra ID.\nWhat I want:\nI want my Entra ID (Azure AD) users to be able to authenticate directly to the FSx file server—ideally using their Entra ID credentials, without having to manually recreate or sync every user into AWS Managed AD.\nWhat I’ve tried/learned so far:\nEntra Connect syncs users from AWS Managed AD up to Entra ID, but not the other way around.\nUsers created only in Entra ID do not appear in AWS Managed AD, and cannot authenticate to FSx.\nThere doesn’t seem to be a built-in or supported way to sync Entra ID (cloud-only) users down to AWS Managed AD.\nQuestions:\nIs there any supported way (natively or with a tool/script) to allow Entra ID users to access AWS FSx for Windows File Server?\nAre there any workarounds or third-party solutions for provisioning Entra ID users into AWS Managed AD automatically?\nHas anyone made this scenario work, or is AD → Entra ID sync the only supported flow for AWS FSx?\nAny advice or experience with this would be much appreciated!\nThanks in advance!\n\nBased on the information available, there are a few approaches you could consider for enabling Entra ID users to access AWS FSx for Windows File Server:\nTrust Relationship\n: You can establish a one-way forest trust relationship between your AWS Managed Microsoft AD domain and your Entra ID Domain Services. In this setup, the AWS managed forest would trust the Entra ID domain forest, allowing accounts in your Entra ID domain to authenticate against resources in the AWS managed domain, including your FSx file system. This requires Entra ID Domain Services (not just Entra ID).\nActive Directory Connector\n: You could use AWS Directory Service's Active Directory Connector to connect to your Entra ID Domain Services. This would allow you to take advantage of your existing Active Directory forest for authentication needs. The AD Connector acts as a proxy to redirect directory requests to your Entra ID Domain Services.\nResource Forest Isolation Model\n: Another approach is to use a resource forest isolation model, where you isolate resources (including Amazon FSx file systems) into a separate Active Directory forest. This can be useful if you want to maintain separation between your Entra ID environment and AWS resources.\nIt's important to note that Amazon FSx for Windows File Server requires Active Directory for authentication - it doesn't directly integrate with cloud-only Entra ID. You'll need Entra ID Domain Services (the Azure AD DS offering) to provide the necessary Active Directory infrastructure that FSx can integrate with.\nFor any of these approaches, you'll need to ensure proper network connectivity between your AWS environment and Azure, typically through IPSEC VPN tunnels, and configure the appropriate security groups and network ACLs to allow communication on the required ports.\nAs a best practice for identity management across AWS services, consider using AWS IAM Identity Center for centralized access management, which can connect to external identity providers including Microsoft Entra ID through SAML 2.0 and SCIM protocols.\nSources\nWorking with Microsoft Active Directory - Amazon FSx for Windows File Server\nUsing Amazon FSx with AWS Directory Service for Microsoft Active Directory - Amazon FSx for Windows File Server\nUsing AWS Directory Service for Entra ID Domain Services - AWS Transfer Family\nManage an external identity provider - AWS IAM Identity Center\nIdentity and access management for Amazon FSx for Windows File Server - Amazon FSx for Windows File Server"
}