{
  "body": "I want to set up Instance Metadata Service (IMDS) on my Amazon Elastic Compute Cloud (Amazon EC2) instances.\n\nShort description\nYou can set up default IMDS capabilities for new instances in your AWS account across all AWS Regions. By default, the latest instance types use Instance Metadata Service version 2 (IMDSv2). To use Instance Metadata Service version 1 (IMDSv1) on these instance types, you must manually activate IMDSv1 in the instance. It's a best practice to use IMDSv2 for security unless you must use IMDSv1.\nImportant:\nIf you configure IMDSv2 on your instance, then IMDSv1 no longer works and applications that use IMDSv1 might not function correctly. Before you enforce IMDSv2, upgrade applications that use Amazon EC2 metadata to a version that supports IMDSv2. For more information about the differences between IMDSv1 and IMDSv2, see\nUse the Instance Metadata Service to access instance metadata\n.\nBy default, Amazon EC2 doesn't provide access to instance tags in the instance metadata. You must allow access at instance launch, or after launch on a running or stopped instance.\nResolution\nNote:\nIf you receive errors when you run AWS Command Line Interface (AWS CLI) commands, then see\nTroubleshooting errors for the AWS CLI\n. Also, make sure that\nyou're using the most recent AWS CLI version\n.\nYou can use a combination of the following methods to configure instance metadata. However, you set the\nhierarchical order of precedence for the metadata options\nat instance launch.\nConfigure instance metadata at the AMI level\nYou can configure an existing or new Amazon Machine Image (AMI) to use IMDSv2. When you launch an instance with the configured AMI, Amazon EC2 automatically sets the instance metadata version to IMDSv2 and the hop limit to\n2\n.\nImportant:\nMake sure to verify that your AMI software supports IMDSv2. After you set the\nimds-support\nvalue to\nv2.0\n, you can't revert it. The only way to reset your AMI is to use the underlying snapshot to create a new AMI.\nTo configure a new AMI to use IMDSv2, run the following\nregister-image\nAWS CLI command:\naws ec2 register-image \\\n--name my-image \\\n    --root-device-name /dev/xvda \\\n    --block-device-mappings DeviceName=/dev/xvda,Ebs={SnapshotId=snap-0123456789example} \\\n    --architecture x86_64 \\\n    --imds-support v2.0\nNote:\nReplace\nmy-image\nwith your AMI name,\n/dev/xvda\nwith your\nroot volume device name\n,\nsnap-0123456789example\nwith your snapshot ID, and\nx86_64\nwith your architecture.\nTo configure an existing AMI to use IMDSv2, run the following\nmodify-image-attribute\ncommand:\naws ec2 modify-image-attribute \\\n--image-id ami-0123456789example \\\n    --imds-support v2.0\nNote:\nReplace\nami-0123456789example\nwith your existing AMI ID.\nAllow tags in metadata in your launch template\nYou can't directly configure access to tags for your AMIs. You must\ncreate an Amazon EC2 launch template\n. Under\nAdvanced details\n, set\nAllow tags in metadata\nto\n-\n. Instances that you launch from this launch template allow access to all the instance's tags from the instance metadata.\nConfigure instance metadata at the account level\nSet IMDSv2 for all instances in your account\n. Or, to allow IMDSv1, for\nMetadata version\n, select\nV1 and V2 (token optional)\n. To allow access to tags in instance metadata at the account level, under\nIMDS defaults\n, set\nAccess to tags in metadata\nto\nEnabled.\nImportant:\nYou must configure instance metadata once for each Region in your account.\nConfigure instance metadata at the instance level\nNote:\nAWS Identity and Access Management (IAM) policies or service control policies (SCP) might restrict the changes that you can make to instance settings.\nTo configure access to IMDS and tags in metadata on a new instance, expand\nAdvanced details\nwhen you\nlaunch the instance\n. Then, configure the following settings:\nFor\nMetadata accessible\n, select\nEnabled\n.\nFor\nMetadata version\n, select\nV2 only (token required)\nor\nV1 and V2 (token optional)\n.\nNote:\nIf you use a container environment, such as Amazon Elastic Container Service (Amazon ECS) or Amazon Elastic Kubernetes Service (Amazon EKS), then for\nMetadata response hop limit\n, select\n2\n.\nFor\nAccess to tags in metadata\n, select\nEnabled\n.\nTo modify an existing instance,\nmodify the settings\n. To use IMDSv1 or IMDSv2, select\nOptional\nfor\nIMDSv2\n. To enforce IMDSv2, select\nRequired\n. Then, under\nInstance settings\n, select\nAllow tags in instance metadata\n.\nRelated information\nAmazon EC2 Instance Metadata Service IMDSv2 by default\nGet the full benefits of IMDSv2 and deactivate IMDSv1 across your AWS infrastructure"
}