{
  "body": "Hello, I am developing a Greengrass component responsible for handling remote jobs following this\nguide\n. When the components starts it successfully retrieves a pending job using the\nget\nmqtt topic, however when I update its status to\nSucceded\nI don't receive a notification in the\n$aws/things/MyThing/jobs/notify-next\ntopic even though I am correctly subscribed.\nI tried subscribing using the Messaging test client on the Thing from the LocalDebugConsole component and the problem persists, however when the MQTT test client directly from the AWS dashboard the messages arrive correctly (both on the\nnotify\nand\nnotify-next\ntopics)\n\nFor future reference, looks like the policy should be attached directly to the thing instead of a thing group in order to receive\nnotify-next\nupdates.\n\nWhen working with AWS IoT Jobs, there are specific conditions under which notifications are published to the\njobs/notify\nand\njobs/notify-next\ntopics.\nBased on your description, there are a few potential reasons why you're not receiving a notification on the\n$aws/things/MyThing/jobs/notify-next\ntopic:\nThe\nnotify-next\ntopic only receives a message when the status of the first job execution in the list changes. If you're updating a job to \"Succeeded\" but it wasn't the next job in the queue (or if there are no other jobs in the queue), you won't receive a notification on the\nnotify-next\ntopic.\nWhen a job completes (status changes to \"Succeeded\"), a notification is published to the\njobs/notify\ntopic, but a notification is only published to the\njobs/notify-next\ntopic if the next job in the queue has changed as a result.\nIf the queue is empty after your job completes, a\nNextNotification\nshould be published to the\njobs/notify-next\ntopic with an empty message.\nSince you mentioned that you can see the messages when using the MQTT test client from the AWS dashboard but not from the LocalDebugConsole component, this suggests a potential issue with your Greengrass component's subscription or message handling:\nVerify that your Greengrass component has the correct permissions to subscribe to these topics\nCheck that you're using QoS level 1 for your subscriptions\nEnsure that your component is correctly processing the messages it receives\nAlso, note that response messages from the AWS IoT Jobs service don't pass through the message broker and can't be subscribed to by other clients or rules. To receive job activity-related messages, you need to use the\nnotify\nand\nnotify-next\ntopics and ensure that jobs events are enabled.\nSources\nJobs notifications - AWS IoT Core\nJobs events - AWS IoT Core\nAWS IoT Device Not Starting Remote Job | AWS re:Post"
}