{
  "body": "Hi all\nI created a backup account in my organization. I made the backup account as the delegated admin account for backup. I'm using AWS Identity Center, the user has the AdmistrativeAccess for the Backup account.\nBut when I tried to create a backup policy in the backup account, I encountered the following error:\nFailed to save policy.\nYou don't have permissions to access this resource.\nWhat could be wrong?\nThanks.\n\nHello.\nIf you check the CloudTrail event history, you may be able to find a more detailed error message.\nhttps://docs.aws.amazon.com/awscloudtrail/latest/userguide/tutorial-event-history.html\nPlease check not only the IAM Identity Center user policy but also whether the action is being denied by SCPs, etc.\nhttps://docs.aws.amazon.com/organizations/latest/userguide/orgs_manage_policies_scps.html\n\n@Riku_Kobayashi There are no records in the CloudTrail history, and the only SCPs in place are those created by AWS Control Tower. I came across a blog post that provides an example of using a centralized backup account:\nhttps://aws.amazon.com/blogs/storage/automate-centralized-backup-at-scale-across-aws-services-using-aws-backup/\n. I will review whether any additional configurations are required beyond the delegated administrator.\n\nThis error suggests you're facing a permissions issue when trying to create a backup policy in your AWS Backup delegated admin account. Even though you have AdministrativeAccess for the Backup account through AWS Identity Center, there might be specific permissions missing.\nWhen you back up and restore resources with AWS Backup, you need both permission to use AWS Backup itself and permission to access the resources you want to protect. The easiest way to ensure proper permissions is to choose the \"Default role\" when assigning resources to a backup plan.\nFor your specific issue, there are a few potential causes:\nThe IAM role you're using might not have sufficient permissions to create backup policies. Even with AdministrativeAccess, there could be specific AWS Backup policy-related permissions missing.\nIf you're trying to create an organization-level backup policy, you might need additional permissions in AWS Organizations.\nThere might be a resource-based policy restricting access to the backup vault or other AWS Backup resources.\nTo troubleshoot this issue:\nVerify that your IAM role has the necessary permissions for AWS Backup operations, particularly for creating backup policies.\nCheck if there are any explicit deny statements in any policies attached to your role or user.\nIf you're working with AWS Organizations, ensure you have the proper permissions to manage organization policies.\nYou can use AWS CloudTrail to view detailed error messages or logs that might provide more specific information about the permission issue.\nIf the issue persists, you might need to attach specific AWS Backup service role policies to your IAM role, such as those that grant permissions for backup and restore operations for the specific resource types you're working with.\nSources\nTroubleshooting AWS Backup - AWS Backup\nAn error when attempting a backup | AWS re:Post\nAccess control - AWS Backup"
}