{
  "body": "I'm a little confused as to what the proper way to setup a private rest api with a custom domain as an origin in CloudFront. React would need to point to the custom domain of the api, but how can accomplish this if API is private and it would not resolve dns externally.\n\nYou can do the following\nCreate VPC Endpoints for the private APi gateway.\nUpdate API gateway policy to only allow traffic from VPC Endpoint\nCreate an internal NLB and the VPC endpoint's IP addresses as the target\nCreate a VPC Origin group in CloudFront and use NLB's ARN as target\nCreate CloudFront distribution to target to NLB using VPC origin.\n\nCloudfront can only talk to public endpoints. You’d need an internet facing NLB pointing to the private rest API\n\nThanks Shajam, I will try this. Seems VPC origins is fairly new and there are no examples showing this approach.\n\nWhen setting up CloudFront with a private REST API as an origin, there are a few approaches you can take to ensure secure access while maintaining functionality.\nFor an S3 bucket with CloudFront, the recommended approach is to use a REST API endpoint as the origin with Origin Access Control (OAC). This allows you to keep your S3 bucket private while CloudFront can still access it. With OAC, you would:\nCreate an Origin Access Control in the CloudFront console\nConfigure your CloudFront distribution to use the S3 REST API endpoint (e.g., your-bucket-name.s3.amazonaws.com)\nUpdate your S3 bucket policy to only allow access from your CloudFront distribution\nFor your private REST API with a custom domain, you would need to set it up as a custom origin in CloudFront. Since the API is private, you'll need to establish a secure connection between CloudFront and your API. This typically involves:\nSetting up a VPC endpoint for your API Gateway\nConfiguring CloudFront to use your custom domain as the origin\nImplementing proper authentication between CloudFront and your API (such as using custom headers or Lambda@Edge)\nFor your React application to access this API through CloudFront, you would configure your application to make API calls to the CloudFront distribution domain or your custom domain that points to the CloudFront distribution. CloudFront will then securely forward these requests to your private API.\nRemember that CloudFront can work with private origins, but you need to ensure proper authentication and access control between CloudFront and your origin. This way, your React application can access the API through CloudFront while the actual API remains private and secure.\nSources\nUse a REST API endpoint as an S3 origin, and restrict access with an OAC | AWS re:Post\nCan we use CloudFront with S3 buckets stored in private VPCs? | AWS re:Post\nCloudfront with other provider S3 | AWS re:Post\nCloudFront + S3 Static Hosting .. Use Website Endpoint OR REST API with OAC | AWS re:Post"
}