{
  "body": "Hi,\nI am having an issue (AccessDenied) restricting the access to only the AWS/Bedrock using the condition below. Is this condition valid for GetMetricStatistics, ListDashboards and ListMetrics? or is it only valid for PutMetricData as shown in\nhttps://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/iam-cw-condition-keys-namespace.html\n?\n{\n        \"Sid\": \"BedrockCloudWatchMetrics\",\n        \"Effect\": \"Allow\",\n        \"Action\": [\n            \"cloudwatch:GetMetricStatistics\",\n            \"cloudwatch:ListDashboards\",\n            \"cloudwatch:ListMetrics\"\n        ],\n        \"Resource\": \"*\",\n        \"Condition\": {\n            \"StringEquals\": {\n                \"cloudwatch:namespace\": \"AWS/Bedrock\"\n            }\n        }\n    }\nCould you help me clarify this point?\n\nHello.\nAs stated in the following documentation, \"cloudwatch:namespace\" is not supported as a condition key for \"GetMetricStatistics\", \"ListDashboards\", and \"ListMetrics\".\nIt can only be used for actions that have \"cloudwatch:namespace\" in the Condition keys column in the table in the following documentation.\nhttps://docs.aws.amazon.com/service-authorization/latest/reference/list_amazoncloudwatch.html\nTherefore, as you may know, as of June 2025, only \"PutMetricData\" can use \"cloudwatch:namespace\" as a condition key.\n\nThe\ncloudwatch:namespace\ncondition key is indeed valid for restricting access to CloudWatch namespaces, but it doesn't apply to all CloudWatch actions in the same way.\nBased on the available documentation, the\ncloudwatch:namespace\ncondition key is primarily designed to work with the\ncloudwatch:PutMetricData\naction, which is used for publishing metrics to CloudWatch. The examples in the documentation specifically demonstrate using this condition key to allow or deny publishing metrics in specific namespaces.\nFor the actions in your policy (\nGetMetricStatistics\n,\nListDashboards\n, and\nListMetrics\n), the behavior is different:\nFor\nListMetrics\n- The condition may work to filter metrics by namespace, but it might not behave exactly as expected since this action lists metrics across namespaces.\nFor\nGetMetricStatistics\n- Similar to\nListMetrics\n, the condition may work but might not provide the precise control you're looking for.\nFor\nListDashboards\n- This action is unlikely to be affected by the namespace condition key since dashboards can contain widgets from multiple namespaces.\nThis is likely why you're experiencing an AccessDenied error. To properly restrict access to only AWS/Bedrock metrics, you might need to use a different approach or modify your policy to include the\ncloudwatch:PutMetricData\naction if you need to publish metrics, while potentially removing the condition for the read-only actions if you need those to work broadly.\nSources\nUsing condition keys to limit access to CloudWatch namespaces - Amazon CloudWatch\nActions, resources, and condition keys for Amazon CloudWatch - Service Authorization Reference\nHow Amazon CloudWatch works with IAM - Amazon CloudWatch"
}