{
  "body": "Has anyone encountered the amplify error log on IAM roles? We have verified that my group/users have the correct permission but we are still unable to deploy into our deployment branch due to this error.\n1 - 2025-06-18T04:26:17.664Z [ERROR]: !!! Unable to assume specified IAM Role. Please ensure the selected IAM Role has sufficient permissions and the Trust Relationship is configured correctly.\n2 - 2025-06-18T04:26:17.665Z [INFO]: # Starting environment caching...\n3 - 2025-06-18T04:26:17.665Z [INFO]: # Environment caching completed\n\nThis error occurs when AWS Amplify is unable to assume the IAM role specified for your deployment. To resolve this issue, you need to check several aspects of your IAM configuration:\nVerify the trust relationship policy of the IAM role you're using for Amplify. The trust policy should include both the regional Amplify service and the general Amplify service. Your trust policy should look similar to:\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Effect\": \"Allow\",\n\"Principal\": {\n\"Service\": [\"amplify.YOUR-REGION.amazonaws.com\", \"amplify.amazonaws.com\"]\n},\n\"Action\": \"sts:AssumeRole\"\n}\n]\n}\nEnsure that the IAM role has the necessary permissions attached. Typically, roles used with Amplify should have policies like AdministratorAccess and AdministratorAccess-Amplify.\nCheck for any inline policies that might be restricting access.\nVerify that all AWS resources related to your Amplify app are in the same region.\nReview your CloudTrail logs for any denied API calls related to AssumeRole actions.\nEnsure that the IAM user or role you're using has permission to call\nsts:AssumeRole\nfor the role that Amplify needs to assume.\nThis issue can sometimes occur even if configurations appear correct, especially after recent changes to your application or AWS environment. If the problem persists after checking these items, you might need to invalidate the cache or deploy a fresh version of the app.\nSources\nUnable to Assume IAM Role in AWS Amplify Deployment | AWS re:Post\non amplify react app deploy issue | AWS re:Post\n\"mcurrent credentials could not be used to assume *** role\" error during amolify deployment | AWS re:Post\nTroubleshoot IAM roles - AWS Identity and Access Management\n\nThe error is about why amplify cannot assume the role and it's not referring to your user permissions.\nAgreed with repost's solution around trust policy."
}