{
  "body": "AWS Web url redirecting to wrong IP address intermittently, eventhough route 53 records mapped to single IP as A record with simple routing policy and TTL 300 intermittently redirecting to wrong IP address.\n\nIf route53 is pointing to an AWS Alias such as a NLB/ALB then the IP Address will changing if you have a multi Zone Load Balancer.\n\nThanks for the input, but I'm not using loadbalancer for my application. Also, I have observed that there is a wildcard entry in route 53 so my doubt is that if I already have a sub domain mapped with A record pointing to correct IP address and there is a wild card entry pointing to the IP address(which I mentioned as wrong IP address), so does this causing the issue please do let me know.\n\nThe wildcard is a catch all. It will not override existing Records\n\nIt is possible DNS is cached in your device. You can perform\nipconfig /flushdns\nin windows and then perform\nnslookup 1.1.1.1 yourwebsite.com\n.  Also,  if you are inside VPN or working from office, it is possible the DNS to be cached in your proxy / firewall settings. Maybe, try a mobile device in that case.\n\nThanks for the input, I tried these before posting the question but my bad its still the same issue sometimes pointing to right IP and sometimes pointing to wrong IP, I have observed that there is a wildcard entry in route 53 so my doubt is that if I already have a sub domain mapped with A record pointing to correct IP address and there is a wild card entry pointing to the IP address(which I mentioned as wrong IP address), so does this causing the issue please do let me know.\n\nHello,\nTo help resolve your DNS issue, let's go through a systematic troubleshooting process:\nFirst, let's verify your Name Server configuration:\nRun this command to check your domain's assigned Name Servers:\ndig\n<domain-name>\n.com NS\nCompare these results with the NS records in your Route53 Hosted Zone - they should match exactly.\nIf the Name Servers are correctly configured but you're still experiencing issues, we'll need to dig deeper:\nUse the dig +trace command on your record to get a complete resolution path\nThis will show exactly how your domain name is being resolved and help identify where the incorrect IP assignment is occurring\nThe dig +trace output will reveal the root cause of your issue, showing each step in the DNS resolution process. You can find detailed guides online explaining how to interpret these results.\nLet me know if you need any clarification on these troubleshooting steps.\n\nThanks for the response. The root domain is routing correctly, but the issue lies with the subdomain routing.\nWhen I ran both dig and dig +trace, the Name Server records shown are correct and match the NS records configured in Route 53 for the root domain. However, the subdomain is still not resolving properly, even though there is only a single A record defined for it."
}