{
  "body": "Hello,\nI am a new AWS user, I've added my billing method as well. However, I keep getting issues with IAM policies while creating jobs around Glue Crawler and Glue ETL in connection with item in my own S3 buckets. I have been searching through questions and I found many users having the same problem but no one has a fine solution.\nPlease help me resolve this!\nRegards,\nDat\n\nHi, You're not alone; this is a very common issue for new AWS accounts, especially when working with AWS Glue + IAM + S3. Even if you're the root user, AWS still applies service control boundaries and missing role trust issues that can block you.\nStep 1: Do NOT use the root user for Glue\nAWS strongly recommends creating an Admin IAM user or role instead of using the root user.\nTo fix this properly:\nGo to the AWS Console → IAM → Users → Create user\nGive that user AdministratorAccess policy.\nUse that IAM user for all Glue setup and permissions work.\nStep 2: Create a Glue Service Role\nGlue jobs and crawlers need to assume a service role with access to S3, logs, etc.\nCreate an IAM role with the Glue service principal:\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Effect\": \"Allow\",\n\"Principal\": {\n\"Service\": \"glue.amazonaws.com\"\n},\n\"Action\": \"sts:AssumeRole\"\n}\n]\n}\nThen attach these policies:\nAmazonS3FullAccess (or scoped S3 access)\nAWSGlueServiceRole\nImportant:\nWithout the glue.amazonaws.com trust policy, Glue won’t be able to assume the role, even if you're root.\nStep 3: Check S3 Bucket Permissions\nMake sure your S3 bucket allows Glue access.\nIf your bucket has a restrictive bucket policy, you’ll need to allow access like this:\n{\n\"Effect\": \"Allow\",\n\"Principal\": {\n\"Service\": \"glue.amazonaws.com\"\n},\n\"Action\": \"s3:GetObject\",\n\"Resource\": \"arn:aws:s3:::your-bucket-name/*\"\n}\nOr better: rely on the IAM role's permissions and keep your bucket policy empty if possible. It avoids conflicts.\nStep 4: Create the Crawler or Job\nNow, when creating the Glue Crawler or Job:\nSelect the IAM Role you created (not root or your user)\nPoint it to the S3 bucket path\nFor jobs, choose Spark or Python shell, and the same role\nNOTE: If it still fails:\nCheck IAM → Access Advisor and CloudTrail to see what action is denied.\nMake sure your Glue role is in the same region as your Glue job.\n\nMany thanks for your instructions!\nI tried all of them but the problem persists...\nI created an admin IAM user with my own Account ID.\nI received this after creating AWSGlueServiceRole. I don;t know why it has the Source Account condition which also exists in Trust Relationships, but it still failed after I removed it.\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Effect\": \"Allow\",\n\"Action\": [\n\"s3:GetObject\",\n\"s3:PutObject\"\n],\n\"Resource\": [\n\"arn:aws:s3:::my-s3-bucket/*\"\n],\n\"Condition\": {\n\"StringEquals\": {\n\"aws:ResourceAccount\": \"my-account-id\"\n}\n}\n}\n]\n}\n3-4. I also added the permissions for my S3 bucket and attached it to the Crawler.\nChecking the AccessAdvisor, I saw A limited Access Level of List and Read for IAM and Organizations Services with All Resources.\nOmg, this thing is about to drive me crazy...\n\nI understand you're experiencing access denied issues while trying to create Glue Crawlers and Glue ETL jobs as a root user, despite having set up your billing method. This is a concerning situation that several AWS users have encountered.\nFirst, it's important to note that using the root account for day-to-day operations, including creating Glue jobs and crawlers, is not recommended as a security best practice. Instead, it's advisable to create an IAM user or role with the necessary permissions for these tasks.\nHowever, if you're encountering this issue as a root user, it could indicate a more significant problem with your AWS account. Here are a few steps you can take:\nCheck if your AWS account is managed by AWS Organizations. If it is, there might be Service Control Policies (SCPs) in place that are denying Glue operations, even for the root user.\nVerify that you have the necessary permissions for both Glue operations and S3 access. The IAM role you're using should have policies like AWSGlueServiceRole and AmazonS3FullAccess attached.\nTry creating resources in different AWS regions to see if the issue persists across all regions.\nReview your AWS Glue and CloudTrail logs for any additional error messages or denial reasons that might provide more context.\nIf you've tried these steps and are still encountering issues, it's likely that there might be a problem at the account level. In this case, the best course of action is to open a case with AWS Support under the \"Account and billing\" category. This type of inquiry can be made free of charge, and AWS Support should be able to investigate any account-level restrictions or issues that might be preventing you from using Glue services.\nRemember, if this is indeed an account-level problem, you may face similar issues with other AWS services as well. AWS Support will be best equipped to diagnose and resolve any underlying account issues.\nSources\nI can't use root account to create Glue job or Glue Crawler | AWS re:Post\nAccount ************ is denied access while creating an aws glue crawler. I'm trying as a root account user. | AWS re:Post\nCan't create a Glue Crawler (AccessDenied) | AWS re:Post\nAWS GLUE account id - (14533334444 example id )access denied | AWS re:Post\n\nHonestly, you’re really close. Glue + IAM + S3 can be super picky, especially the first time around.\nJust a couple of things to double-check based on what you shared:\nThat aws:ResourceAccount condition you mentioned, it’s optional. It just ensures the bucket is in the same account. Since you're working within a single account, removing it is fine and shouldn’t break anything.\nThe trust relationship on your Glue role is critical. Even if your policies are perfect, if the trust policy doesn’t allow Glue to assume the role, it’ll silently fail. Just make sure it looks exactly like this:\n{\n\"Effect\": \"Allow\",\n\"Principal\": {\n\"Service\": \"glue.amazonaws.com\"\n},\n\"Action\": \"sts:AssumeRole\"\n}\nWhat exact error are you seeing when you run the crawler? If it's something like AccessDeniedException or a failed role assumption, that points directly to either the trust policy or S3 bucket permissions.\nIf you’ve added a bucket policy, maybe try removing it temporarily — just rely on the IAM role alone. Sometimes bucket policies unintentionally block access, even when everything else is set up correctly.\nYou're clearly doing the right things; its probably one small piece left to fix."
}