{
  "body": "I have a phone number (Long Code) set up in a primary account which is shared to a development account. The phone number has two way sms enabled. If I send a message using code (Java SDK - PinpointSmsVoiceV2Client ver 2.31.50) with the primary account credentials, the sms is successfully delivered to a mobile phone and when the phone replies, the reply comes back with the property \"previousPublishedMessageId\" correctly populated with the original messageId. That's all good.\nHowever, when I try the same from the development account, the SMS is successfully delivered to the phone; when replied, the reply is successfully received via the sns topic. However it is missing the \"previousPublishedMessageId\" property.\nDo you know what I could be missing here? In the resource policy for the phone number in the primary account, I have granted access to the sms actions to the development account root as well as pinpoint service principle. Is there anything else required for the two way sms setup to work?\nThanks in advance,\nKris\n\nI raised this with AWS Support and the response I received is that \"the previousPublishedMessageId is not propagated when you are sending message through cross account and we cannot see in the inbound event.\"\nThis looks like a limitation in sharing phone numbers cross account.\n\nThe issue you're experiencing with the missing \"previousPublishedMessageId\" property when using a shared phone number for two-way SMS from a development account is likely related to how the shared resource is being used and configured. Here are a few points to consider:\nResource Identification: When using shared resources like phone numbers across accounts, it's crucial to use the full Amazon Resource Name (ARN) of the resource. Make sure you're using the complete ARN of the shared phone number when sending SMS messages from the development account.\nTwo-way SMS Configuration: Ensure that the two-way SMS configuration is properly set up for the shared phone number. This includes verifying that the Amazon SNS topic or other destination for incoming messages is correctly configured and accessible from the development account.\nPermissions: While you've granted access to SMS actions to the development account root and the Pinpoint service principal, you may need to review and possibly update the permissions. Specifically, ensure that the development account has the necessary permissions to access and use the two-way SMS features of the shared phone number.\nAPI Version: Confirm that you're using the latest version of the AWS SDK for Java that supports the End User Messaging SMS and Voice v2 API (PinpointSmsVoiceV2Client). The version you mentioned (2.31.50) should be compatible, but it's worth double-checking for any updates.\nConfiguration Sets: If you're using configuration sets, ensure they are properly set up and shared between accounts if necessary. Configuration sets can affect how message metadata is handled.\nMessage Handling: The way messages are processed and correlated between outgoing and incoming SMS might differ when using shared resources across accounts. You may need to implement additional logic in your application to track and correlate messages.\nTo resolve this issue:\nReview and update the resource policy for the phone number in the primary account, ensuring it grants full access to two-way SMS functionality for the development account.\nDouble-check the two-way SMS configuration, including the SNS topic setup and any IAM roles associated with it.\nWhen sending SMS from the development account, use the full ARN of the shared phone number.\nImplement logging or debugging in your application to track the full details of outgoing and incoming messages, which may help identify any discrepancies in message handling between accounts.\nIf the issue persists after these steps, you may need to contact AWS support for further assistance, as there could be account-specific configurations or limitations affecting the two-way SMS functionality with shared resources.\nSources\nEnd User Messaging SMS with a Phone Number shared from another account | AWS re:Post\nSet up two-way SMS messaging for a phone number in AWS End User Messaging SMS - AWS End User Messaging SMS\nMigrating from Amazon Pinpoint SMS v1 API to AWS End User Messaging SMS & Voice v2 API | AWS Messaging & Targeting Blog\n\nCan someone please elaborate \"Review and update the resource policy for the phone number in the primary account, ensuring it grants full access to two-way SMS functionality for the development account\"? What permissions are required to grant full access to two-way sms functionality?"
}