{
  "body": "I have an Amazon Q Pro subscription and have successfully installed the VS Code Extension and signed in to my account on my desktop computer.  I am now trying to sign in to the Amazon Q extension in VS Code on my laptop but am having trouble with my passkey.\nI have a passkey that I have generated in AWS IAM that works when I use it to sign in to my AWS console.  When I go through the process to log in to Amazon Q in the VS Code extension, after I enter my user name and password it asks for a passkey.  When I try to use the same passkey on my phone that allows me to sign in to AWS Console, I receive an error that says my phone does not have any passkeys.  Do I need to somehow generate a special passkey just for Amazon Q? Where in AWS IAM would I be able to do that?\n\nBased on the information provided, it appears you're experiencing an issue with your passkey authentication when trying to sign in to Amazon Q in VS Code on your laptop.\nAWS passkeys are designed to work with specific AWS services, and they are registered per service and device. The passkey you've generated in AWS IAM works for the AWS Console because that's where you registered it. However, Amazon Q might be using a different authentication system or requiring a separate passkey registration.\nTo resolve this issue, you have a few options:\nRegister a new passkey specifically for Amazon Q. You would typically do this during the first-time setup process for Amazon Q.\nIf you're using a synced passkey (through providers like iCloud Keychain, Google Password Manager, 1Password, or Dashlane), ensure that your passkey is properly syncing across your devices.\nIf you're using a security key (like a YubiKey), make sure it's properly connected to your laptop when attempting to authenticate.\nCheck if Amazon Q supports the same authentication methods as the AWS Console. It's possible that Amazon Q might have different MFA requirements or might not yet support the same passkey implementation.\nIf you continue to experience issues, you might need to contact AWS Support specifically about Amazon Q authentication, as this appears to be a service-specific authentication challenge rather than a general AWS IAM passkey issue.\nSources\nCan I Make a Passkey Copy? | AWS re:Post\nAWS adds passkey multi-factor authentication (MFA) for root and IAM users | AWS News Blog\nAWS Multi-factor authentication in IAM - AWS Identity and Access Management\nIAM - Multi-Factor Authentication"
}