{
  "body": "My seller is asking me to track down a POC / Resource from the AWS technical support team, to help with questions around - setting up Seller Central to connect to SQS in our AWS account - to be able to receive notifications on the Order Change event?\n\nAWS Marketplace provides notification mechanisms for sellers to receive updates about customer subscriptions and other events related to their products.\nFor receiving notifications about changes to customer subscriptions (such as order changes), AWS Marketplace provides Amazon SNS topics during the product creation process. You can then configure one or more Amazon SQS queues to subscribe to this SNS topic to receive and process these notifications.\nFor example, if a customer makes changes to their subscription (like adding more storage), the Amazon SNS topic can send a message to your subscribed SQS queue, which can then trigger processes to handle that change automatically.\nWhen you subscribe your SQS queue to the provided SNS topic, permissions are automatically added to allow the topic to publish messages to the queue. However, you'll still need to create an IAM policy to grant the AWS Marketplace Metering and Entitlement Service API user access to the queue. The policy should include permissions for actions like:\nsqs:ReceiveMessage\nsqs:DeleteMessage\nsqs:GetQueueAttributes\nsqs:GetQueueUrl\nFor troubleshooting, you can add a dead letter queue to your SQS setup to capture any messages that couldn't be delivered, along with the associated errors.\nRather than seeking a specific POC from AWS technical support, I'd recommend referring to the AWS Marketplace documentation on seller notifications and SQS permissions, as these resources provide comprehensive guidance on setting up the integration between AWS Marketplace and your SQS queues for event notifications.\nSources\nAmazon SQS permissions - AWS Marketplace\nSeller notifications for AWS Marketplace events - AWS Marketplace\nSetting up real-time notifications for AWS Partner Central and AWS Marketplace events - AWS Partner Central"
}