{
  "body": "Stay up to date with the latest from the Knowledge Center. The AWS re:Post Knowledge Center is your one-stop-shop for authoritative, up-to-date guidance on using AWS services. See all new Knowledge Center articles published in the last month.\n\nNew Knowledge Center articles\nFind all new\nKnowledge Center articles\npublished in May. We publish new articles to resolve the most common issues you might encounter.\nAmazon Bedrock\nHow do I view the list of URLs that the Amazon Bedrock provided Web Crawler adds to the data source?\nHow do I resolve the \"Failed to connect to the URL of your data source\" error when I use SharePoint as a data source in Amazon Bedrock Knowledge Bases?\nHow do I improve search results and retrieval accuracy in Amazon Bedrock Knowledge Bases?\nHow do I check the number of tokens when I invoke a model in Amazon Bedrock?\nHow do I resolve file sync failures with Amazon Bedrock Knowledge Bases?\nAmazon DynamoDB\nHow do I change the capacity mode for multiple Amazon DynamoDB tables at the same time?\nAmazon Elastic Compute Cloud (Amazon EC2)\nHow do I identify the latest RHEL AMI for my EC2 instance?\nHow do I get extended lifecycle support for RHEL 7 and AL2 after their end-of-support date?\nAmazon Elastic Container Service (Amazon ECS)\nHow do I troubleshoot errors when I copy AMIs between different Regions or Accounts?\nAmazon Elastic Kubernetes Service (Amazon EKS)\nHow do I use custom user data with Amazon Linux 2023 EKS nodes?\nHow do I install the Amazon S3 CSI driver on my Amazon EKS clusters?\nHow do I troubleshoot issues with the Amazon VPC CNI add-on for Amazon EKS?\nHow do I upgrade Amazon EKS add-ons?\nHow do I resolve leader election issues with the AWS Load Balancer Controller in Amazon EKS?\nAmazon ElastiCache\nHow do I follow best practices for failover and recovery events for ElastiCache for Valkey or ElastiCache for Redis OSS self-designed clusters?\nHow do I resolve the \"invalid username-password pair or user is disabled\" error when I connect to my ElastiCache cluster with IAM authentication?\nAmazon Managed Workflows for Apache Airflow (Amazon MWAA)\nHow do I troubleshoot tasks that are stuck in the  Queued state in my Amazon MWAA  environment?\nAmazon Redshift\nWhat are the key states to monitor for an Amazon Redshift cluster?\nWhat causes Amazon Redshift node replacements and how do they affect clusters?\nHow do I resolve an \"insufficient free IP addresses in subnets\" error when I create an Amazon Redshift Serverless workgroup?\nAmazon Relational Database Service (Amazon RDS)\nHow do I share an Amazon RDS for Oracle DB snapshot?\nAmazon SageMaker\nHow do I configure KMS encryption in a SageMaker AI Notebook instance?\nHow do I troubleshoot issues that occur with my Sagemaker AI scheduled notebook jobs?\nHow do I troubleshoot an algorithm error in my SageMaker AI processing job?\nAWS IoT SiteWise\nHow do I troubleshoot the \"Too many  properties directly or indirectly depend on a single property\" error in  IoT  SiteWise?\nSign up for updates\nWant to get updates about the latest AWS Knowledge Center content? Choose\nFollow\nto get email updates about new community articles, selections, and questions about the AWS Knowledge Center."
}