{
  "body": "IAM / CLI\nWhy does AWS CLI sometimes ignore my configured profile?\nI’ve noticed that even after setting up multiple profiles in ~/.aws/credentials, some AWS CLI commands still use an older or default profile. Is there a specific order of precedence for how the CLI chooses profiles? Could environment variables override the config?\n\nThe AWS CLI follows a specific order of precedence when determining which credentials to use, which can sometimes lead to your configured profile being ignored.\nEnvironment variables have the highest precedence and will override credentials from both the shared credentials file (\n/.aws/credentials) and the AWS CLI config file (\n/.aws/config). For example, if you have the\nAWS_ACCESS_KEY_ID\nand\nAWS_SECRET_ACCESS_KEY\nenvironment variables set, they will take precedence over any profile settings, even if you've specified a profile using the\nAWS_PROFILE\nenvironment variable.\nThe order of precedence is:\nCommand line options (like --profile)\nEnvironment variables (AWS_ACCESS_KEY_ID, AWS_SECRET_ACCESS_KEY, etc.)\nShared credentials file (~/.aws/credentials)\nAWS CLI config file (~/.aws/config)\nIf you're experiencing issues with the CLI using unexpected credentials, check for:\nEnvironment variables that might be overriding your profile settings\nStale or expired credentials/session tokens\nMultiple credential sources conflicting with each other\nIn some cases, users have resolved persistent credential issues by deleting the\n.aws\nfolder and reconfiguring their profiles. This can help when there might be old session tokens or conflicting configurations causing problems.\nIf you want to explicitly use a specific profile, you can use the\n--profile\nparameter with your AWS CLI commands to ensure the correct profile is used.\nSources\nAWS CLI Configuration Variables — AWS CLI 2.27.33 Command Reference\nWhy doesn't my AWS CLI work? | AWS re:Post\naws sts get-caller-identity lists the root account i am unable to switch to iam user by using AWS CLI | AWS re:Post"
}