{
  "body": "I requested SES production access and was denied twice.  The first time I realized I had not done some key steps to get approved.  I read several documents and did what I believe is necessary and requested it again with a detailed description.  It just came back rejected but t his time saying it is a final rejection.  The lack of any feedback in the process or assistance is very shocking to me and a terrible customer experience.  I understand the sensitivity of the email servers, and there may be some key things I haven't done or they have issues with, but it is a very basic case (OTP emails for Cognito sign up and login, nothing else).\nIs there anyway to get feedback and have it reviewed again?  I can provide any relevant information to assist.\nThank you,\nPeter\n\nHi Peter,\nI’ve managed multiple SES accounts for real businesses, and I know how tough it used to be — domain verifications, use case reviews, waiting days. Now? Auto-approved accounts with 50k limits are popping up everywhere — you can spot them all over forums. A lot of these accounts are clearly being abused. If they get shut down, they just move on. Meanwhile, those of us playing by the rules get hit with rejections, delays, and limits — even for basic, legit use like OTPs.\nIt’s frustrating. The system feels like it punishes real users and rewards the bad actors. You're not alone in this — hang in there.\n\nNow look at how others gain access to production, without any additional information, by literally clicking a few buttons.\nhttps://www.youtube.com/watch?v=RpyrR62hGEw\n\nI understand your frustration with having your Amazon SES Production Access request denied without specific feedback. This is unfortunately a common experience that many AWS users face.\nWhen AWS denies SES production access requests, they typically provide limited details due to their security policies. The denial message often cites concerns about potential impact on their service deliverability or other users without specific explanations.\nFor your specific case involving OTP emails for Cognito sign-up and login, here are some steps you can take:\nWait and build trust\n: Since you're a newer account user, AWS may want to see a positive sending history first. Use the sandbox environment for a while to establish a good sending pattern.\nSubmit a new request with enhanced details\n: In your next application, be extremely detailed about:\nSpecify that you're only sending OTP emails for Cognito authentication\nExplain your expected email volume\nDetail how you'll handle bounces and complaints\nDescribe your compliance with email best practices\nOpen a new support case\n: Create a fresh support case referencing your previous denials and ask specifically for guidance on what you need to address to meet their requirements. Emphasize your commitment to following AWS policies.\nReview potential red flags\n: Consider if there might be anything about your account or implementation that could raise concerns:\nHigh bounce rates in sandbox testing\nAny previous spam complaints\nUnclear explanation of your use case\nConsider alternatives\n: If you continue to face rejections, you might need to explore other email service providers for your authentication emails.\nThe review process can take time, and response times vary. While some users receive quick responses, others may wait several days. If you don't hear back within a reasonable timeframe, you can follow up through AWS Support channels.\nAWS takes email sending privileges seriously to maintain their service reputation, which is why the process can be strict. However, with patience and by providing comprehensive information about your legitimate use case, you may be able to get approval on a subsequent attempt.\nSources\nProduction Access to Amazon SES Denied - what to do? | AWS re:Post\nBeing Rejected for SES without a valid reason. | AWS re:Post\nAWS denied access to SES | AWS re:Post\nSES: Production Access | AWS re:Post\nAWS SES | Production level request | No response even after 72H | AWS re:Post\n\nThanks for the reply Andylg, appreciate your response.  I've moved on and am using a 3rd party service and it seems to be working fine.  Could have saved a lot of time from the beginning if I knew how bad the AWS experience would be.  Trying to get SES production access was probably the worst customer experience I've ever had.  The fact that they refuse to provide feedback in any way is really unacceptable.  But I guess they got what they wanted, me not using their service.\n\nThat is crazy!\nThey should at least have a streamlined path to use it for Cognito emails.  They can even have an option to restrict it to just Cognito generated emails so it can be approved more easily.\n\nI think AWS SES decided to help scammers by introducing auto-approvals. So now no one needs to send requests. Just find information on the forums and buy an account there.\n\nfantastic. I have been working with SES for many years and helping clients grow their business through messaging, and now it is too difficult to do this - because anyone can find an auto-approved account and send unlimited spam!!!\n\nFor several weeks I have been beating against the wall to get production in SES and send messages to customers of my online store.\nBut I see that on this forum there is information about automatic approval of production for everyone.\nAnd basically these accounts are sold for pennies to people who simply send advertising and spam.\nThank you AWS for making it impossible for real users to receive production, but to all scammers - welcome!\nI see the need to look for another service provider for sending messages, since SES does not care about real and adequate users."
}