{
  "body": "How can I delete old versions of files in an S3 bucket?\nI enabled versioning in S3 but now I see multiple versions of the same file. What’s the recommended way to clean up older versions without affecting the latest one?\n\nThere are several ways to delete old versions of files in an S3 bucket without affecting the latest version:\nUsing S3 Lifecycle Rules (Recommended)\n:\nCreate a lifecycle rule that applies to your objects\nEnable \"Permanently delete noncurrent versions of objects\"\nSpecify the number of days after objects become noncurrent\nOptionally, specify the number of newer versions to retain\nThis approach is ideal for large buckets as it scales well and handles all versioning complexities\nUsing the S3 Console\n:\nNavigate to your bucket and enable \"Show versions\"\nSelect the check box next to the Version ID for the older versions you want to delete\nChoose \"Delete\" and confirm by typing \"permanently delete\"\nThis approach works well for selectively deleting specific versions\nUsing AWS CLI/API\n:\nFor specific versions, use the delete-object command with the version ID\nFor bulk deletion of versions under a specific path, you can use a command that combines list-object-versions with delete-objects\nRemember that when you delete an object without specifying a version ID in a versioning-enabled bucket, S3 doesn't actually delete the object - it just adds a delete marker, making the object appear deleted. To permanently remove old versions, you must either specify the version ID or use lifecycle rules.\nThe lifecycle rule approach is generally recommended for ongoing management of versioned objects, especially for buckets with many objects, as it automates the cleanup process according to your retention policies.\nSources\nDeleting object versions from a versioning-enabled bucket - Amazon Simple Storage Service\nTroubleshooting versioning - Amazon Simple Storage Service\nHow to all objects in s3 ( and all its versions) with aws command line? | AWS re:Post\nDeleting Amazon S3 objects - Amazon Simple Storage Service"
}