{
  "body": "How do I create a public URL for one file in S3?\nI’m using S3 and want to make one file (like a PDF or JPG) public without exposing the entire bucket. I’ve seen pre-signed URLs and bucket policies mentioned. What’s the simplest way to do this?\nIs one more secure than the other?\n\nThere are two main approaches to make a single file in an S3 bucket publicly accessible:\nOption 1: Make the specific object public using ACLs\nFirst, ensure bucket settings allow public access:\nGo to your S3 bucket and click on the \"Permissions\" tab\nUnder \"Block public access\", make sure \"Block public access to buckets and objects granted through new public bucket or access point policies\" is OFF\nAlso ensure \"Block public access to buckets and objects granted through any access control lists (ACLs)\" is OFF\nMake the specific object public:\nSelect the file in S3\nClick \"Actions\" dropdown\nSelect \"Make public using ACL\"\nConfirm the action\nYou can then use the \"Object URL\" to access the file\nOption 2: Use a bucket policy for a specific object\nModify the Block Public Access settings for your bucket:\nGo to the \"Permissions\" tab\nFind the \"Block public access\" section and click \"Edit\"\nUncheck the relevant settings to allow public access\nCreate a bucket policy that grants public read access only to the specific object:\nIn the \"Permissions\" tab, go to \"Bucket policy\"\nAdd a policy that specifies the exact object path:\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Sid\": \"PublicReadForSingleObject\",\n\"Effect\": \"Allow\",\n\"Principal\": \"*\",\n\"Action\": \"s3:GetObject\",\n\"Resource\": \"arn:aws:s3:::YOUR-BUCKET-NAME/path/to/your/specific/file.jpg\"\n}\n]\n}\nOption 3: Use pre-signed URLs (more secure)\nInstead of making objects permanently public, you can generate pre-signed URLs that provide temporary access:\nPre-signed URLs expire after a set time (maximum 7 days)\nThey can be generated using AWS SDKs\nThis approach is more secure as it provides temporary, controlled access rather than making the object permanently public\nFrom a security perspective, pre-signed URLs are the most secure option since they provide temporary access rather than making the object permanently public. If you must make an object permanently public, using a specific bucket policy is generally preferred over ACLs as it provides more granular control.\nRemember that any object made public will be accessible to anyone on the internet, so ensure the file doesn't contain sensitive information.\nSources\nHow do I make a single file in an S3 bucket publicly accessible? | AWS re:Post\nSimple S3 Permissions Help | AWS re:Post\nCreating a pre-signed url directly from my website | AWS re:Post\nHow do I obtain a public access link for my S3 bucket resource? | AWS re:Post\nCreate a presigned URL for Amazon S3 using an AWS SDK - Amazon Simple Storage Service"
}