{
  "body": "I have a versioned bucket with folders with thousands of objects in them. I deleted a folder which has given them delete markers. How do I delete the objects with delete markers without having to delete each object individually. When I select a folder the 'delete' option is greyed out.\nThanks\n\nWhen you delete a folder in a versioned S3 bucket, it only adds delete markers to the objects rather than permanently deleting them. Here are several approaches to delete these objects with their delete markers:\nUsing AWS CLI with s3api\n:\nYou can use a command that combines listing object versions and deleting them:\naws s3api delete-objects --bucket your-bucket-name --delete \"$(aws s3api list-object-versions --bucket your-bucket-name --prefix folder-path/ | jq '.Versions + .DeleteMarkers | {Objects: map({Key, VersionId})}')\"\nThis command lists all versions and delete markers under your specified folder prefix, then deletes them in a single operation.\nUsing S3 Lifecycle Rules\n:\nThis is often the most scalable approach for large numbers of objects:\nCreate a lifecycle rule that applies to objects with your folder name as the prefix\nConfigure it to \"Expire current versions of objects\" (e.g., 1 day after creation)\nAlso configure it to \"Permanently delete noncurrent versions of objects\" (e.g., 1 day after becoming noncurrent)\nCreate a second rule to \"Delete expired object delete markers\"\nThe lifecycle rules will execute daily starting at midnight UTC, and will handle the deletion process automatically over a few days.\nUsing a Shell Script\n:\nFor more control, you can create a script that lists all object versions and deletes them:\nbucket=your-bucket-name && aws s3api list-object-versions --bucket $bucket | jq -r '.Versions[] | [.Key, .VersionId] |@tsv' | while read k v; do aws s3api delete-object --bucket $bucket --key $k --version-id $v; done\nNote that for buckets with thousands of objects, the lifecycle rule approach is generally recommended as it handles the complexity of versioning and scales well to any number of objects.\nSources\nHow to all objects in s3 ( and all its versions) with aws command line? | AWS re:Post\nVersioned Bucket Delete All Objects and bucket | AWS re:Post\nTroubleshooting versioning - Amazon Simple Storage Service\n\nHi, according to my understanding you want to delete the folder and all objects stored within it, including the various versions of them. Unfortunately the S3 console doesn't support bulk deletion very well, especially for deleted items with markers. A simple approach would be if you have Python and pip installed is to use s3rm, This is a tool used for recursively deleting s3 versioned objects.\nBash code:\npip install s3rm\ns3rm s3://your-bucket-name/your-folder-name/\nAlternatively using the s3api through the CLI as suggested in the AI gen answer would be your best bet. Consider implementing life cycle rules as well to avoid this issue in the future.\n\nSince you have thousands of files, it's best to use lifecycle policy. The reason is if the script / cli commands take too long, you can get signed out of the account before the script completes. Here's an example of the lifecycle policy.\n{\n  \"Rules\": [\n    {\n      \"ID\": \"ExpireCurrentVersions\",\n      \"Prefix\": \"my-folder/\",\n      \"Status\": \"Enabled\",\n      \"Expiration\": {\n        \"Days\": 1\n      },\n      \"NoncurrentVersionExpiration\": {\n        \"NoncurrentDays\": 1\n      }\n    },\n    {\n      \"ID\": \"DeleteExpiredMarkers\",\n      \"Prefix\": \"\",\n      \"Status\": \"Enabled\",\n      \"ExpiredObjectDeleteMarker\": true\n    }\n  ]\n}"
}