{
  "body": "Hi, my team is considering using the Data Share feature in Redshift. I understand that it is free to use (of course accounting for producer's storage cost and consumer's compute costs when querying) within the same region. Can I check if it is also free to use between AWS accounts in the same region?\nAlso, the official document on 'Considerations for data sharing in Amazon Redshift' at\nhttps://docs.aws.amazon.com/redshift/latest/dg/datashare-considerations.html\nseems to be incomplete. Can anyone share any common considerations before using Data Share? Just want to make sure I have my bases covered.\nThanks!\n\nYes, Amazon Redshift Data Share is free to use between different AWS accounts within the same region. You'll only need to account for the standard costs: storage costs for the producer cluster and compute costs for the consumer cluster when querying the shared data. However, before implementing Data Share, there are several important aspects to consider.\nOn the technical side, be aware that you cannot share certain objects like external tables, tables with SUPER data type columns, identity columns, or views referencing external tables. Consumer queries will count against your producer cluster's concurrency scaling limits, and any schema changes on the producer side will require metadata refresh on the consumer side.\nFrom a security and operational perspective, you'll want to carefully manage permissions since Data Share provides read-only access to potentially sensitive data. It's recommended to set up proper logging and monitoring through CloudWatch and ensure network connectivity between consumer and producer clusters. Performance-wise, be prepared for some limitations as consumer clusters don't have statistics on producer data, which might affect query performance. Additionally, data sharing between clusters in different Availability Zones may introduce some latency.\nFor best results, thoroughly test your data sharing setup in a non-production environment first, maintain clear documentation of shared datasets, and establish clear policies for cross-account data sharing. If you're looking for alternatives, you might want to consider Redshift Serverless for simplified management, though keep in mind that cross-region sharing will incur additional data transfer costs.\n\nHi Amrita, thanks a lot for your response. You mentioned that Data Share provides read-only access to potentially sensitive data. However, I read from the docs (\nhttps://docs.aws.amazon.com/redshift/latest/dg/datashare-considerations.html\n) that writing to objects is a new feature. Can I confirm if this is true and also what exactly you mean by \"potentially sensitive data\"? Who decides what data is sensitive? Thank you!\n\nYou're absolutely correct, and I apologize for any confusion in my previous response. Amazon Redshift Data Share does now support write operations to shared objects, which is a relatively new feature. According to the documentation you referenced, producers can grant write privileges (INSERT, UPDATE) on objects in datashares, and consumers can write back to the producer's tables when properly authorized. This enables collaborative data management scenarios across different Redshift clusters.\nTo enable write access, the producer must explicitly grant write privileges to the datashare. For cross-account sharing, the consumer must set 'allow-writes' to true when associating the datashare.\nRegarding \"potentially sensitive data,\" I was referring to a general data governance consideration rather than a specific Redshift feature. To clarify, your organization determines what data is considered sensitive based on your internal data classification policies, regulatory requirements (like GDPR, HIPAA, PCI-DSS), and business requirements for data protection. It's important to note that Redshift doesn't automatically classify data - Redshift Data Share itself doesn't categorize or label data as sensitive or non-sensitive.\nYou control sensitivity through your own mechanisms, including selective sharing (choosing which schemas/tables/views to share), column-level permissions (excluding sensitive columns), row-level security policies (filtering sensitive rows), and using views with data m\n\nYes, Amazon Redshift data sharing is free to use between AWS accounts within the same region. There are no additional charges for the data sharing functionality itself when sharing across AWS accounts in the same region. You're correct that you'll still need to account for the producer's storage costs and the consumer's compute costs when querying the shared data.\nAs for considerations before using Data Share, here are some important points to keep in mind:\nAccess control: Data sharing provides granular access control, allowing you to specify which tables or views are shared and which users can access the shared data.\nData consistency: Consumers always access the latest state of the shared data, ensuring transactional consistency across producer and consumer clusters.\nSharing scope: You can share at different levels including databases, schemas, tables, views (regular, late-binding, and materialized), and SQL user-defined functions.\nRead vs. write access: While data sharing primarily provides read-only access, there are options for multi-data warehouse write capabilities.\nCross-region sharing: This is supported but incurs data transfer charges, unlike same-region sharing.\nAutomatic updates: New tables created after establishing a datashare can be automatically shared.\nUse case alignment: Consider whether your use case aligns with common data sharing scenarios like workload isolation, cross-functional analysis, or data sharing between development and production environments.\nSecurity requirements: Evaluate your organization's security needs when implementing data sharing.\nMaintenance considerations: Factor in the technical expertise and maintenance capacity required to manage data sharing effectively.\nSources\nAccessing data in other Amazon Redshift databases - Amazon Redshift\nData sharing in Amazon Redshift - Amazon Redshift\nUnleash deeper insights with Amazon Redshift data sharing for data lake tables | AWS Big Data Blog\nUnderstanding Amazon Redshift Data Sharing Solutions: A Comprehensive Comparison | AWS re:Post\ndata-sharing"
}