{
  "body": "I have a problem when logging in to my previous AWS account, I activated my MFA but when I entered it, it was invalid and I tried to delete it from my authenticator application but when I wanted to re-login, I still needed the MFA. How can I do it? I have also tried using this sign with an alternative factor and resync with the AWS server, but I was still asked to ask for the MFA authenticator\n\nIf you're unable to log in to your AWS account because of MFA issues, here are steps you can take:\nTry the \"Sign in using alternative factors of authentication\" option if available. This allows you to verify your identity using other methods.\nIf you're still having trouble, you can attempt to synchronize your MFA device. Virtual MFA devices can sometimes go out of sync, and AWS provides an option to resynchronize during the login process.\nIf the above methods don't work, you'll need to contact AWS Support directly. They can assist with deactivating the MFA device and helping you regain access to your account. You can reach AWS Support for account-related issues like MFA problems even without a support plan.\nWhen contacting AWS Support, be prepared to verify your identity with information such as the email address associated with the account, the account ID, and potentially other details to confirm you're the rightful account owner.\nIf you're using an IAM user account rather than the root account, you should contact your AWS administrator within your organization. They can help deactivate your MFA device and set up a new one.\nFor Cognito user pools with MFA, administrators can reset a user's MFA using specific AWS CLI commands to disable and then re-enable MFA for the user.\nOnce you regain access, consider registering multiple MFA devices or setting up emergency access keys to prevent future lockouts.\nSources\nI am unable to log in to my account. | AWS re:Post\nCognito_MFA_Reset_or_reconfigure_for_user | AWS re:Post\nRecover an MFA protected identity in IAM - AWS Identity and Access Management\nMFA enabled sign-in - AWS Identity and Access Management\nUnable to Access AWS Due to Lost MFA Device & Call Verification Issue | AWS re:Post\n\nYou added MFA to your account, but removed the account from your authenticator without deleting the device from your AWS account? If yes you got two choices, use another account to sign in if you have it, if not AWS support is what you'll need.\nYou can’t use \"Sign in using alternative factors of authentication\" for accounts with MFA enabled unless its the root user you try to recover."
}