{
  "body": "I am at the point of recertification of my cloud architect certificate via\nhttps://cloudquest.skillbuilder.aws/callback\n.  Connecting-vpc/MarketingServer via SessionManager has not been possible.  Each time I clicked connect on SessionManager window, an error message (Network Failure) will popup.  I ha[[\n]()]()ve been on this spot for the last three days.  All efforts to restart/refresh have not yielded any positive result.\n\nTo resolve your issue with connecting to an EC2 instance via Session Manager, I'll provide several troubleshooting steps:\nIAM Role Permissions:\nVerify that the EC2 instance has an IAM role attached with the necessary permissions\nThe role should include the AmazonSSMManagedInstanceCore managed policy or equivalent permissions\nThis policy grants the required permissions for Systems Manager functionality\nInstance Configuration:\nEnsure the SSM agent is installed and running on your EC2 instance\nCheck the SSM agent logs at /var/log/amazon/ssm/amazon-ssm-agent.log for any errors\nNetwork Configuration:\nCheck the security group associated with your EC2 instance\nEnsure it allows inbound and outbound traffic on port 443 (HTTPS) for Session Manager connections\nVerify that the subnet where your EC2 instance resides has proper routing to communicate with Systems Manager endpoints\nIf the instance is in a private subnet, it might require a NAT gateway for outbound internet access\nVPC Endpoints:\nIf you're using VPC endpoints, ensure they're configured correctly to allow traffic to and from Systems Manager endpoints\nInstance Status:\nConfirm your EC2 instance is in the \"running\" state and reachable over the network\nSession Manager Configuration:\nVerify that Session Manager is enabled in your AWS account and configured correctly\nCheck the Session Manager settings in the AWS Systems Manager console\nNetwork ACLs:\nIf you're using network ACLs, ensure they allow the necessary traffic for Session Manager\nIf these steps don't resolve the issue, you might want to try rebooting the instance or using an alternative connection method temporarily while troubleshooting the Session Manager connection.\nSources\nUnable to Connect to EC2 Instance via SSM Session Manager | AWS re:Post\nCan't connect to Linux instance even after the health status checks pass | AWS re:Post\n\nAlso check your local firewall on your Machine incase its blocking traffic to AWS SSM public Endpoint"
}