{
  "body": "Hi all\nI'm trying to configure SAML and SCIM with Microsoft Entra ID and IAM Identity Center, following\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/idp-microsoft-entra.html\n.\nBut it says paste \"SCIM endpoint URL\" in the \"Tenant URL\" as shown below, there is no \"Tenant URL\" in the Microsoft Entra admin center console as mentioned in the AWS User Guide.\nStep 4.3\n\nUnder Admin Credentials, in Tenant URL paste in the SCIM endpoint URL value you copied earlier in Step 4.2. In Secret Token, paste in the Access token value.\nI see the \"Secret Token\" but I don't see \"Tenant URL\". Instead, I see \"clientsecret\". What is it? And what should I use for that?\nThe screenshot from MS Entra admin center is as follows.\nThanks.\n\nHello.\nIn my Azure console, there is a place to enter the tenant URL.\nAre you looking at a different screen than I am?\nThe above screen was displayed in the way described in the AWS documentation, as shown in the image below.\n\nHi @Riku_Kobayashi, I added my screenshot. Seems very weird. Why am I seeing the different menu?\n\nI think the applications you are adding are different.\nThe application you added is \"AWS Single-Account Access\".\nNow you need to add IAM Identity Center.\nThe application selected in Step 1.1 of \"Step 1: Prepare your Microsoft tenant\" in the AWS documentation you are referring to is incorrect.\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/idp-microsoft-entra.html#step1-entra-microsoft-prep\nOn the Browse Microsoft Entra Gallery page, enter AWS IAM Identity Center in the search box.\nSelect IAM Identity Center as shown in the image below.\n\nOops... Seems like I just followed what the console showed. Console shows \"Cloud platforms --> AWS\". If I click AWS, there is only one option which is \"AWS Single-Account Access\". I did not know I can search AWS IAM Identity Center. Thanks!\n\nIt appears there may be a discrepancy between the AWS documentation and the current Microsoft Entra ID interface. The \"Tenant URL\" field mentioned in the AWS guide is likely referring to the same field that is now labeled as \"clientsecret\" in the Microsoft Entra admin center console.\nIn this case, you should use the SCIM endpoint URL that you copied from the IAM Identity Center console as the value for the \"clientsecret\" field in the Microsoft Entra admin center. This SCIM endpoint URL typically follows the format:\nhttps://scim.[region].amazonaws.com/[tenant-id]/scim/v2/\nFor the \"Secret Token\" field, you should use the access token value that you copied from the IAM Identity Center console.\nIt's important to note that interface changes in cloud services are common, and sometimes documentation may not reflect the most recent updates. In situations like this, it's best to match the information based on the context and purpose of the fields, even if the exact labels differ.\nIf you encounter any issues or errors after inputting these values, it may be helpful to double-check all other configuration steps and ensure that you've enabled automatic provisioning in IAM Identity Center before attempting to configure it in Microsoft Entra ID.\nSources\nConfigure SAML and SCIM with Okta and IAM Identity Center - AWS IAM Identity Center\nTroubleshoot IAM Identity Center SCIM provisioning | AWS re:Post\n\nDid not work."
}