{
  "body": "Hi AWS team! I’d like to share my ongoing experience with the SES auto-approval issue, because it seems like the problem still hasn’t been addressed — and legitimate senders are paying the price.\nA while ago, I reported an AWS account I had purchased for testing — it had Production Access auto-enabled in multiple regions without any manual review. Trust & Safety responded and said the case had been reviewed and was acceptable.\nHowever, after that, the account was sandboxed. Meanwhile, the abuse hasn’t stopped. Every day, I still see new accounts being sold on public forums, advertised with pre-approved SES Production Access across multiple regions — sometimes 5, 7, even 11 regions. These are fresh accounts, not leftovers from some old bug.\nThis makes me feel like I was penalized for pointing out a flaw, while the flaw itself remains. SES is an amazing service when used properly, but this loophole continues to hurt those who follow the rules. Please take this seriously — the current system still enables spammers, while restricting real users who try to maintain good practices.\nThanks.\n\nAbout an hour ago I created several such accounts without reviewing the request in the trust and security team and received approval in all many regions of the SES.\nThanks for the tip)))\n\nWhat are you talking about, russian pig? For what tip you thanking? Go to CBO and you will get good payment, useless trash\n\nI understand your frustration with the Amazon SES situation you've described. This appears to reflect a broader issue that legitimate SES users have been reporting.\nWhen AWS denies or revokes SES production access, they typically don't provide specific details due to security policies. This can be particularly frustrating when you're trying to follow the rules while seeing evidence of potential abuse in the system.\nThe SES approval process is designed to be stringent to maintain email sending reputation and prevent abuse. Legitimate businesses are expected to implement proper email authentication (SPF, DKIM, DMARC), maintain clean mailing lists, monitor bounce and complaint rates, and follow email deliverability best practices.\nHowever, as you've noted, there seems to be an inconsistency where some accounts may be getting production access without the same level of scrutiny, while legitimate users face restrictions. AWS actively monitors SES usage for factors like high bounce rates, complaint rates, hitting spamtraps, and content violations - which can trigger account reviews or temporary blocks.\nIf you're experiencing specific issues with your SES account such as being placed back in the sandbox, I'd recommend contacting AWS Support directly. They can provide guidance specific to your account situation and help address concerns about your sending practices or account status.\nThe frustration you're expressing about feeling penalized for reporting an issue while seeing continued abuse is understandable. AWS takes email sending privileges seriously to maintain service reputation, but the implementation appears to have some gaps based on your experience.\nSources\nAuto-Approval — A Gateway for Spammers | AWS re:Post\nSES Production request denied | AWS re:Post\nProduction Access to Amazon SES Denied - what to do? | AWS re:Post"
}