{
  "body": "In my lambda code I'm getting Calling the invoke API action failed with this message lambda was unable to decrypt the environment variables because KMS access was denied.Please check the functions KMS key settings.\nNote that my lambda function was destroyed and recreated via terraform after that I'm facing this issue\n\nWould suggest take a look at the following:\nVerify KMS Key Policy – Ensure that the Lambda function's IAM role has the necessary permissions (kms:Decrypt, kms:DescribeKey) for the KMS key.\nCheck IAM Role Association – If the Lambda function was destroyed and recreated, its IAM role may have changed. Confirm that the correct role is assigned.\nUse AWS Managed Key – If you're using a customer-managed KMS key, try switching to the default AWS-managed key (aws/lambda).\nReapply Terraform Configuration – Sometimes, re-running terraform apply can resolve inconsistencies.\nManually Reassign KMS Key – In the AWS console, navigate to Lambda > Configuration > Environment Variables, and reassign the KMS key.\nhttps://github.com/hashicorp/terraform-provider-aws/issues/6352\nhttps://stackoverflow.com/questions/69473114/why-is-aws-lambda-getting-accessdeniedexceptionkms-error-message\n\n❌ Error:\n\"Lambda was unable to decrypt the environment variables because KMS access was denied. Please check the function's KMS key settings.\"\n✅ Cause\nThis error usually happens when:\nYour Lambda's IAM execution role does not have permission to access the KMS key used to encrypt environment variables.\nAfter you destroyed and recreated the Lambda using Terraform, the IAM role or KMS key association changed.\nIf you’re using a Customer Managed Key (CMK) in KMS, you must explicitly grant access to the Lambda function's role.\nhttps://docs.aws.amazon.com/lambda/latest/dg/configuration-envvars.html#configuration-envvars-encryption\nhttps://docs.aws.amazon.com/kms/latest/developerguide/key-policies.html\nhttps://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/lambda_function\nhttps://docs.aws.amazon.com/kms/latest/developerguide/iam-policies.html"
}