{
  "body": "I'm getting the following error on the CloudQuest task for \"Compliance Enforcement\" . I've tried following every step exactly and even recreating my environment to no avail.\n“RemediationConfiguration(s) for AWS Config Rule(s) required-tags are missing required document parameters. Specify all required document parameters and try again.”\nI have specified\ninstanceId\n>\nRESOURCE_ID\nand I still get this error.\nThis is the code for the Systems Manager doc:\ndescription: |-\n  *Use this SSM automation document to remediate ec2 instance that have not been properly tagged.*  \n\n  ---\n  # How does it work?\n  This SSM automation doc will invoke the lambda function labFunction that will add tags to instances.\n  The lambda function will tag any non-compliant EC2 resources with the Environment:Prod key value pair\n  ## Pre-requisites\n  1. Make sure to replace <account-id> with the actual account id of your provisioned lab account.\n \n\n  You can create a [link to another webpage](https://aws.amazon.com/).\nschemaVersion: '0.3'\nparameters:\n  instanceId:\n    type: 'AWS::EC2::Instance::Id'\nmainSteps:\n  - name: updatetags\n    action: 'aws:invokeLambdaFunction'\n    inputs:\n      InvocationType: Event\n      Payload: '\"{{instanceId}}\"'\n      FunctionName: 'arn:aws:lambda:us-east-1:<account-id>:function:labFunction'\nObviously I changed out the account id.\nThanks in advance,\nTheron\n\nThe error you're encountering with the CloudQuest \"Compliance Enforcement\" task is related to missing required document parameters in your AWS Config remediation configuration.\nThe issue is likely in how you've mapped the parameters between AWS Config and your SSM document. When setting up the remediation configuration for the AWS Config rule \"required-tags\", you need to ensure that all required parameters for the SSM document are properly specified.\nIn your case, you've mapped\ninstanceId\nto\nRESOURCE_ID\n, which is correct, but there might be additional requirements:\nMake sure you've replaced\n<account-id>\nin the Lambda function ARN with your actual AWS account ID in the SSM document.\nVerify that the parameter mapping in the remediation configuration is exactly as required. The parameter name should be\ninstanceId\n(case-sensitive) and the value should be\nRESOURCE_ID\n.\nCheck if there are any other required parameters that you might have missed. Sometimes AWS Config remediation requires additional parameters beyond what's explicitly defined in your document.\nEnsure that the IAM role associated with the remediation action has the necessary permissions to invoke the SSM document and the Lambda function.\nVerify that the Lambda function \"labFunction\" exists and has the correct permissions to tag EC2 instances.\nIf you've already checked all these points and are still encountering the error, try recreating the remediation configuration from scratch, ensuring that all parameter mappings are correctly specified.\nSources\nWhy is EventBridge getting Invalid input for target message from Systems Manager Document | AWS re:Post\nUse DescribeDocument with a CLI - AWS SDK Code Examples"
}