{
  "body": "Hello,\nI'm trying to Set up notifications (Amazon EventBridge workflow),\nhttps://developer-docs.amazon.com/sp-api/docs/notifications-api-v1-use-case-guide#tutorial-set-up-notifications-amazon-eventbridge-workflow\nNotification: LISTINGS_ITEM_MFN_QUANTITY_CHANGE\nDo everything by provided manual ( link above ), however on the step 4. Create a subscription (\nhttps://developer-docs.amazon.com/sp-api/docs/notifications-api-v1-use-case-guide#step-4-create-a-subscription\n), I received a reply:\nForbidden (403) Response: { \"errors\": [ { \"code\": \"Unauthorized\", \"message\": \"Access to requested resource is denied.\", \"details\": \"\" } ] }\nChecked multiple times all the steps and Access Policy in SQL settings, everything is meet.\nProbably I need any additional permissions for IAM user Role to work with\nEventBridge Bus / Rule ? ( To be allowed to accept notifications )\nor Any additional policies to be allowed to send messages from EventsBridge to SQS ?\nIn SQS I have set Access Policy according to manual.\nAlso, I have a try to check the messages in SQS queue, via \"Poll for messages\" button and changed the qty by item in Seller Central, and didn't received any message.\nCould you please help me to resolve the issue or drive me to correct manual ?\nThank you.\n\nThe 403 Forbidden error you're encountering when trying to create a subscription for notifications suggests there's an issue with permissions. Based on your description, there are a few potential causes and solutions:\nSQS Queue Policy Configuration:\nMake sure your SQS queue policy properly allows the EventBridge service to send messages to your queue. The policy should include:\n\"Service\": \"events.amazonaws.com\" as the Principal\n\"Action\": \"sqs:SendMessage\" permission\nThe correct Resource ARN for your SQS queue\nIAM Permissions:\nThe IAM role or user you're using to create the subscription might need additional permissions. Ensure it has the necessary permissions to:\nCreate notification subscriptions\nWork with EventBridge rules and targets\nAccess the SQS queue\nProtocol Configuration:\nWhen creating a notification subscription, ensure you're using the correct protocol. For SQS, you should be using either \"HTTPS\" or \"SQS\" as the protocol value, depending on the specific API requirements.\nEventBridge Rule Validation:\nIf you've already created an EventBridge rule, verify that it's correctly configured to target your SQS queue.\nFor the issue of not receiving messages in your SQS queue after changing quantities in Seller Central, this could indicate that either:\nThe subscription wasn't successfully created\nThe EventBridge rule isn't properly configured\nThere might be a delay in processing the notifications\nI recommend checking CloudTrail logs for any denied actions related to your SQS queue or EventBridge rules, which can provide more specific information about permission issues.\nSources\nCreateNotificationSubscription - Amazon WorkDocs\nResolve EventBridge notification failures in Amazon SQS  | AWS re:Post\nAMS Subscription Error (eu-west-1): Unable to validate destination SQS queue despite correct policy | AWS re:Post"
}