{
  "body": "Hi there,\nI have a Glue Crawler that is failing with an\nInternal Service Exception\nand no other error logs.\nSome details:\nCrawler source: JDBC connection to a SQL Server Database with the wildcard path (\n%\n). (I've tried specific schemas and tables too)\nThe Glue Connection has been tested in 2 other settings in Glue and works:\ntest connection\nfrom the Glue Connections console using the same IAM role used to run the crawler\nA Glue Job: from a glue job using the same IAM role as used with the crawler, I'm able to connect, query a table, and log a count of records.\nThe crawler succeeds and populates the Glue Catalog when configured with dummy source to a CSV file on S3 (instead of the JDBC source).\nI think this rules out Lake Formation blocking writes to the catalog? Regardless I've granted broad permissions to my crawler IAM role in Lake Formation as well. The Glue Database I'm writing to is otherwise empty.\nThe crawler itself runs for about 5 mins before failing. (maybe suggests that it is actually crawling some tables but failing at a later step?)\nWhen I run the crawler with a Glue Connection that I know to be misconfigured/broken, the crawl exits with an error indicating that testing the connection failed (so I don't think its an issue with the connection?)\nCloud Watch logs reveal no information (other than the\nInternal Service Exception\n). I've also combed through all Cloud Trail Events between the times of the failed crawler run (+ a bit of buffer on either side), and see nothing concering/obvious. I've reviewed these recommendations as well\nhttps://repost.aws/knowledge-center/glue-crawler-internal-service-exception\n.\n3 questions (and grateful for any other advice):\nIs there anywhere else I can/should be looking for error messages or is there a way to increase the log level for crawler runs?\nIs it documented anywhere, what db permissions a SQL Server db user must have on the database for a crawl? e.g. READ access on\nsys.*\ntables? Access to the\nINFORMATION_SCHEMA\nmaybe? Wondering if the user used for our db connection is lacking permissions on the DB (although nothing obvious about my current db user stands out).\nAnything else not mentioned here I should be trying?\nMany thanks in advance.\n\nBased on your description, there are several potential causes for the \"Internal Service Exception\" in your Glue Crawler when connecting to SQL Server via JDBC.\nSince your connection tests successfully and works in a Glue job, but fails during crawling, this suggests the issue might be related to specific permissions or configurations needed for crawling operations rather than basic connectivity.\nHere are some troubleshooting steps and considerations:\nFor error logs and increased verbosity:\nUnfortunately, Glue Crawlers don't provide extensive logging options beyond what you're seeing in CloudWatch.\nYou might want to check if there are any throttling-related errors in CloudTrail that could indicate resource constraints.\nRegarding SQL Server permissions for crawling:\nThe database user needs SELECT permissions on the tables you want to crawl\nThe user should have permissions to query system tables and metadata views including:\nINFORMATION_SCHEMA views\nsys.tables, sys.columns, sys.types, and other system catalog views\nPermissions to execute sp_tables and sp_columns stored procedures\nConsider creating a dedicated database user with appropriate read-only permissions specifically for the crawler\nAdditional troubleshooting steps:\nTry limiting the crawler scope to a single table or schema instead of using the wildcard path\nCheck if there are any special characters or unsupported data types in your SQL Server tables\nVerify network configuration, ensuring the security groups, subnets, and VPC settings allow proper connectivity\nEnsure the IAM role has all necessary permissions for both the connection and writing to the Glue Data Catalog\nConsider using a custom JDBC driver if you're encountering compatibility issues with the default driver\nCheck if your SQL Server requires specific authentication methods or encryption settings that might be causing issues during the crawling process\nSince the crawler runs for about 5 minutes before failing, it's possible that it encounters a specific table or schema element that causes the exception. Try crawling smaller subsets of your database to isolate the problematic area.\nSources\nAWS Glue Connection to RDS SQL Server Fails – \"Failed status due to failed connection\" | AWS re:Post\nTroublehsoot AWS Glue connection to a JDBC data source | AWS re:Post\nResolve connection error in AWS Glue | AWS re:Post\n\nother system catalog views\nwhich views? are these views and all other required schemas/tables/views/stored procedures fully documented anywhere?\nCheck if there are any special characters or unsupported data types in your SQL Server tables\nWhich data types are unsupported, are these documented anywhere?"
}