{
  "body": "S3 / AWS CLI\nWhy do S3 CLI uploads sometimes hang mid-transfer with no error?\nUsing aws s3 cp to upload large files, I occasionally get stuck with no error or timeout — the upload just hangs. Is this related to multipart thresholds or SSL verification?\n\nWhen AWS CLI uploads to S3 hang mid-transfer without errors, several factors could be causing this issue:\nMultipart upload interruptions\n: For large files (over 100MB), the AWS CLI automatically uses multipart uploads. If a part fails to upload but doesn't generate an error, the process might appear to hang. The CLI is designed to be synchronous, meaning commands like\naws s3 cp\nshould only complete after all files are transferred.\nNetwork connectivity issues\n: Intermittent network problems can cause uploads to stall without generating errors.\nResource constraints\n: The AWS CLI S3 transfer commands are multithreaded by default, with 10 concurrent requests. If your system is resource-constrained, this could cause timeouts or stalled transfers.\nIncomplete multipart uploads\n: If a multipart upload gets interrupted, it might leave incomplete upload parts in S3 without properly failing.\nYou could try these solutions:\nAdjust the\nmax_concurrent_requests\nconfiguration value (decrease it if your system is overwhelmed, or increase it if you want faster transfers with more bandwidth)\nUse the\n--debug\nflag to get more detailed information about what's happening\nFor very large files (over 5GB), ensure you're using multipart uploads correctly\nIf an upload appears stuck, you might need to manually abort the multipart upload using the\nabort-multipart-upload\ncommand\nThe AWS CLI performs checksum calculations for uploads to ensure data integrity, which is another process that could potentially cause issues if there are problems with the file being uploaded.\nSources\nUpload large files to S3 via CLI | AWS re:Post\nIs AWS CLI really synchronious? | AWS re:Post\nAWS CLI S3 FAQ — AWS CLI 2.27.32 Command Reference\nAmazon S3 examples using AWS CLI - AWS SDK Code Examples\nAWS CLI S3 Configuration — AWS CLI 2.27.32 Command Reference"
}