{
  "body": "I want you to cancel my account please.  I have tried and it doens't work\n\nHi,\nApologize for the continued concern. We're unable to cancel an account on your behalf via re:Post request.\nIf you're experiencing difficulty with the steps outlined in the provided resource, please reach out to our Account & Billing team via our\nSupport Center\nfor assistance.\n- Sage A.\n\nCan you please cancel my account\n\nIt will not close.\n\nIt comes up with a message that says it cannot cancel the account= \"We have found at least one active member account in your organization. Visit AWS Organizations console  to verify that all member accounts are labeled as SUSPENDED. Review Closing a management account guide  for more details.\"  I have no idea... I'm not technical.  Please delete the account. We don't wish to use it.\n\nI understand you want to cancel your AWS account and have had trouble doing so. To cancel your AWS account, you need to follow these steps:\nSign in to the AWS Management Console as the root user of the account you want to close. You cannot close an account while signed in as an IAM user or role.\nIn the upper-right corner of the navigation bar, click on your account name or number, then select \"Account\".\nOn the Account page, locate and click the \"Close account\" button.\nYou'll be asked to confirm by typing your account ID (which will be displayed in the closure dialog box).\nClick the \"Close account\" button again to initiate the closure process.\nYou should receive an email confirmation within a few minutes that your account has been closed.\nIf you're having trouble accessing your account as the root user, you may need to recover access first. If you can't recover access on your own, contact AWS Support directly. They can assist you with regaining access and guide you through settling any outstanding balances.\nRemember, closing your AWS account is permanent. After closure, you won't be able to use the account or access any of its resources. AWS typically retains account information for 90 days after closure, after which it's permanently deleted.\nAlso, note that you remain responsible for any outstanding fees and charges for services consumed before account closure. You may receive a final bill the following month for any usage up to the closure date. If you have any AWS Marketplace subscriptions, be sure to cancel these separately before closing your account.\nIf you're still experiencing issues, it's best to contact AWS Support directly for assistance with your specific account situation.\nSources\nHow do I delete my account? | AWS re:Post\nCannot log into Admin account to cancel service | AWS re:Post\naccount deletion to stop charges | AWS re:Post\n\nHi,\nI'm sorry to hear that. Did you follow the steps described on the\nfollowing AWS documentation page\n? What was the result?\n\nIt didn't work.  Please cancel my account.\n\nThis is still not closing. Please cancel my account.\n\nThis still won't close. Please cancel"
}