{
  "body": "Hi\nI configured an embedded linux device as a greengrass core device with Nucleus(2.14.3) installed.\nI need to test local IPC Pub/Sub between components. From the source\nhttps://docs.aws.amazon.com/greengrass/v2/developerguide/interprocess-communication.html\nfollowed the steps and when I deploy and run the component I keep getting the error\nFailed to establish connection with error EVENT_STREAM_RPC_NULL_PARAMETER\nor\nFailed to establish connection with error EVENT_STREAM_RPC_CONNECTION_ACCESS_DENIED\n. I have enabled the iot and greengrass policy for the core-device and thing-group. Any help would be appreciated.\nThe json file is:\n{\n\"RecipeFormatVersion\": \"2020-01-25\",\n\"ComponentName\": \"com.example.PubSubPublisherCpp\",\n\"ComponentVersion\": \"1.0.0\",\n\"ComponentDescription\": \"A component that publishes messages.\",\n\"ComponentPublisher\": \"Amazon\",\n\"ComponentConfiguration\": {\n\"DefaultConfiguration\": {\n\"accessControl\": {\n\"aws.greengrass.ipc.pubsub\": {\n\"com.example.PubSubPublisherCpp:pubsub:1\": {\n\"policyDescription\": \"Allows access to publish to all topics.\",\n\"operations\": [\n\"aws.greengrass#PublishToTopic\"\n],\n\"resources\": [\n\"*\"\n]\n}\n}\n}\n}\n},\n\"Manifests\": [\n{\n\"Lifecycle\": {\n\"RequiresPrivilege\": true,\n\"Run\": \"{artifacts:path}/greengrassv2_pubsub_publisher\"\n}\n}\n]\n}\n\nIt seems you're encountering issues with local MQTT Pub/Sub communication between components in AWS IoT Greengrass. The errors you're seeing suggest there might be some configuration or permission issues. Let's go through a few points to help troubleshoot:\nFirst, ensure that you're using the correct IPC mechanism for component-to-component communication in Greengrass. The local publish/subscribe interface is separate from MQTT and uses a different API.\nCheck your component's recipe file. Make sure you've properly configured the access control policy for IPC communication. Your component needs explicit permission to use the publish/subscribe API. The recipe should include something like this:\nComponentConfiguration:\nDefaultConfiguration:\naccessControl:\naws.greengrass.ipc.pubsub:\n'YourComponentName:pubsub:1':\npolicyDescription: Allows access to publish/subscribe to all topics\noperations:\n- aws.greengrass#PublishToTopic\n- aws.greengrass#SubscribeToTopic\nresources:\n- '*'\nVerify that you're using the correct API calls in your code. For local publish/subscribe, you should be using methods like\nPublishToTopic\nand\nSubscribeToTopic\n, not MQTT-specific methods.\nThe error \"EVENT_STREAM_RPC_CONNECTION_ACCESS_DENIED\" specifically points to a permissions issue. Double-check that your component has the necessary permissions in its recipe.\nMake sure you're using the appropriate SDK and methods for Greengrass V2 IPC communication. The AWS SDK for C++ v2 should work, but ensure you're using the Greengrass-specific IPC client.\nIf you're trying to communicate between components and client devices, note that this requires additional configuration. You would need to deploy and configure the MQTT bridge component to relay messages between the local publish/subscribe interface and client devices.\nIf you've verified all these points and are still encountering issues, you may want to review the Greengrass logs for more detailed error information. Also, ensure that your Greengrass core device has the latest updates and that all necessary components are properly deployed and running.\nSources\nInteract with client devices in components - AWS IoT Greengrass\nGreengrass local MQTT retained flag | AWS re:Post\nUnauthorizedError when trying to publish data to local MQTT topic using AWS IoT Greengrass V2 IPC | AWS re:Post\n\nThe error \"EVENT_STREAM_RPC_CONNECTION_ACCESS_DENIED\" specifically points to a permissions issue. Double-check that your component has the necessary permissions in its recipe.\nWhether the certificates or Access key that we are providing causes this issue"
}