{
  "body": "PROBLEM SUMMARY:\nAll AWS Batch compute environments in eu-west-2 are automatically reverting desiredvCpus to 0 within minutes, making it impossible to run any jobs. This affects both GPU and CPU instance types.\nREGION:\neu-west-2\nBUSINESS IMPACT:\nProduction pipeline completely blocked\nREPRODUCE STEPS:\nCreate any compute environment (tested: g5.xlarge, m5.large)\nUpdateComputeEnvironment with desiredvCpus=4\nWait 2-5 minutes\nDesiredvCpus automatically reverts to 0\nAuto Scaling Groups created with Max=0 (abnormal)\nTROUBLESHOOTING COMPLETED:\nTested 3 different compute environments: all same behavior\nMultiple instance types affected\nService quotas verified OK\nIAM/networking validated\nAMI functionality confirmed\nNo automation/Lambda interference found\nQUESTION FOR AWS:\nIs there a known service issue with AWS Batch in eu-west-2? This appears to be systematic failure affecting all compute environments regardless of configuration.\nSIMILAR ISSUES?\nHas anyone else experienced this behavior? All jobs remain RUNNABLE indefinitely because no instances can launch.\nWORKAROUND NEEDED:\nThis is blocking production workload. Are there any known workarounds or alternative regions recommended?\n\nHow about this as workaround:\nManually Set vCPUs – Try setting Min vCPUs to a non-zero value to prevent automatic scaling to zero.\nTest in Another Region – If possible, deploy a test environment in eu-west-1 or us-east-1 to see if the issue persists.\n\nHi, thank you for using Batch.\nAll jobs remain RUNNABLE indefinitely because no instances can launch.\nI recommend configuring notifications on blocked job queues (\nhttps://aws.amazon.com/blogs/hpc/introducing-new-alerts-to-help-users-detect-and-react-to-blocked-job-queues-in-aws-batch/\n). You will find out exactly the reason instances cannot launch.\nUpdateComputeEnvironment with desiredvCpus=4\nIf your goal is to persist compute, you should use min vCpu instead of the desired vCpu (\nhttps://docs.aws.amazon.com/batch/latest/userguide/updating-compute-environments.html\n). Batch will scale down compute if it is incompatible for incoming jobs to save customer costs. Desired vCpu dropping to 0 is expected in your case.\nIs there a known service issue with AWS Batch in eu-west-2\nNo."
}