{
  "body": "Hi all,\nmy t2.micro, after about 1 minute after a reboot, fails to access outgoing traffic on port 80 (ping, FTP, ssh are all OK). There are no rules about outgoing traffic.\nThe strange thing is that this problem occurs only about a minute after the EC2 is booted.\nAny suggestions?\nThanks.\nCiao.\nL.\n\nBased on your description, it sounds like you're experiencing an issue with outbound HTTP traffic (port 80) from your EC2 instance, while other types of traffic like ping, FTP, and SSH continue to work. The timing aspect - where it fails about a minute after boot - is particularly interesting.\nHere are some potential causes and troubleshooting steps:\nSecurity Group Configuration: Even though you mentioned there are no rules about outgoing traffic, double-check your security group's outbound rules. By default, security groups allow all outbound traffic, but if there have been modifications, you might need to explicitly allow outbound traffic on port 80.\nNetwork ACLs (NACLs): Check if there are any Network ACLs applied to your subnet that might be blocking outbound traffic on port 80. Unlike security groups, NACLs are stateless and require explicit allow rules for both inbound and outbound traffic. Ensure there's no deny rule for port 80 in the outbound rules of your NACL.\nOS-level Firewall or Configuration: Since the issue occurs a minute after boot, it could be related to a service or script that runs during startup. Check if there are any firewall rules (like iptables) being applied or any services starting that might be blocking outbound HTTP traffic.\nSystem Logs: Examine the system logs for any errors or warnings that appear around the time the outbound connectivity fails. This might provide clues about what's happening.\nResource Constraints: Check if your t2.micro is experiencing any resource constraints. Although you mentioned CPU credits aren't depleted, there might be other resource issues affecting network connectivity.\nApplication or Service Interference: If you have any applications or services that start shortly after boot, they might be interfering with outbound HTTP traffic.\nTry a Full Reboot: Sometimes, a complete instance reboot can resolve connectivity issues, especially if they're related to transient network problems.\nThe fact that the issue consistently occurs about a minute after boot suggests there's likely a specific process or configuration change happening at that time. Identifying what changes during that period would be key to resolving the issue.\nSources\nHow to block HTTP/HTTPS access from inside AWS Linux instance? | AWS re:Post\nEC2 Instances in the us-east-1 and us-east-2 region  can ping outside but not able to curl/wget/telnet | AWS re:Post\noutbound connections from ec2 instance stop working after around a day | AWS re:Post\n\nYou mentioned that outbound port 80 does not work after 1 minute, I'm assuming that it worked initially but stops working after 1 minute. If this is the case, maybe check if you have user data script or a custom solution that's modifying your firewalls. Some OS images like Amazon Linux may run cloud agents or config management that modify iptables after boot. Example: firewalld, ufw, cloud-init. Check rules in iptables -\n/etc/sysconfig/iptables\n- to see if outbound port 80 is being blocked.\n\nHi Shajam, no firewalld, ufw, cloud-init used, iptables shows this:\nChain INPUT (policy ACCEPT)\ntarget     prot opt source               destination\nChain FORWARD (policy ACCEPT)\ntarget     prot opt source               destination\nChain OUTPUT (policy ACCEPT)\ntarget     prot opt source               destination\nThanks for your help.\nCiao.\nL."
}