{
  "body": "Simple S3 Permissions Help\nWhat’s the easiest way to make just one file in my S3 bucket publicly viewable?\nI’m still learning AWS and want to make just one image or file in my S3 bucket viewable by the public. I don’t want the whole bucket to be public — just that one file. What’s the best and safest way to do this?\nAny help for a beginner is appreciated!\n\nTo make just one file in your S3 bucket publicly viewable, you'll need to follow these steps:\nFirst, you need to modify the Block Public Access settings for your bucket:\nGo to the S3 console and navigate to your bucket\nClick on the \"Permissions\" tab\nFind the \"Block public access\" section and click \"Edit\"\nUncheck \"Block all public access\" (you may need to uncheck all four individual settings)\nSave the changes\nThen, create a bucket policy that grants public read access only to the specific object:\nIn the \"Permissions\" tab, go to \"Bucket policy\"\nAdd a policy similar to this (replace the bucket and object path):\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Sid\": \"PublicReadForSingleObject\",\n\"Effect\": \"Allow\",\n\"Principal\": \"*\",\n\"Action\": \"s3:GetObject\",\n\"Resource\": \"arn:aws:s3:::YOUR-BUCKET-NAME/path/to/your/specific/file.jpg\"\n}\n]\n}\nThis approach is more secure than making the entire bucket public because it limits access to just the one file you specify. The bucket policy approach is also the recommended way rather than using ACLs, especially since many buckets now have ACLs disabled with the \"Bucket owner enforced\" setting.\nRemember that any object made public will be accessible to anyone on the internet, so ensure the file doesn't contain sensitive information.\nSources\nS3: is public access possible when Block all public access is on and object ownership is bucket owner enforced | AWS re:Post\nAccess control in Amazon S3 - Amazon Simple Storage Service\nModule 5. Test your setup\nUse Amazon S3 website hosting to host without a single web server - Hosting Static Websites on AWS"
}