{
  "body": "Hello,\nI am trying to set up a static website redirect using S3 for my root domain (\nowenhamlin.com\n). My goal is to redirect all traffic from\nowenhamlin.com\nto\nwww.owenhamlin.com\n, which is hosted in a separate S3 bucket.\nHere are the details of my setup:\nI have two S3 buckets in the same region (\nus-west-1\n):\nowenhamlin.com\n(configured for static website hosting, set to “Redirect requests for an object” with host name\nwww.owenhamlin.com\nand protocol\nhttp\n)\nwww.owenhamlin.com\n(configured for static website hosting, serves my actual website)\nBlock all public access is OFF for both buckets.\nNo bucket policy is set on the redirect bucket.\nThe bucket website endpoint for the redirect bucket is:\nhttp://owenhamlin.com.s3-website-us-west-1.amazonaws.com\nWhen I visit this endpoint, the page loads forever and never redirects.\nThe www bucket endpoint works as expected.\nI have tried:\nRecreating the redirect bucket\nToggling static website hosting settings\nChanging the protocol between\nhttp\nand\nnone\nTesting from different browsers and networks\nQuestion:\nIs there anything else I should check, or is there a known issue with S3 static website redirects in\nus-west-1\n? Why does my redirect bucket endpoint not redirect as expected?\nThank you for your help!\n\nAfter going through the links you provided, I think the redirection is working fine but the page is not loading. I think it's redirecting to the https version of the website, however, note that https is not supported for S3 static website, which is probably it's not loading. For S3 website, you need to use http. If https is a must, and ideally should be for external websites, consider using cloudfront.\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/how-to-page-redirect.html\nhttps://docs.aws.amazon.com/Route53/latest/DeveloperGuide/getting-started-cloudfront-overview.html\n\nthank you for your review, where would I make this adjustment?\n\nI'm assuming you have configured the redirect in S3 website setting. There, instead of pointing to https://... change that to point http://... URL. Or did you use other method for redirect like just having an index.html and javascript redirect?\n\nSounds like you're trying to do what I do with my site.\nI have two buckets called\nmysite.net\nand\nwww.mysite.net\n, both with\nStatic website hosting\nenabled, with the\nbucket website endpoint\nof each bucket being\nhttp://mysite.net.s3-website-ap-southeast-2.amazonaws.com\nand\nhttp://www.mysite.net.s3-website-ap-southeast-2.amazonaws.com\nrespectively.\nRoute 53 hosted zone is setup like this:\nThis works for me. Can you try similar (obviously using Northern California region instead of Sydney)?\n\nThe issue you're experiencing with your S3 bucket redirect not working properly could be due to several factors:\nBucket Configuration\n: When setting up a redirect bucket, make sure you've selected \"Redirect requests\" as the hosting type (not \"Host a static website\") in the static website hosting configuration. This is a common mistake that prevents redirects from working properly.\nProtocol Setting\n: For the redirect configuration, ensure you've correctly specified the protocol. If your www site uses HTTPS, make sure to select \"https\" in the protocol dropdown rather than \"http\" or \"none\".\nFormatting of the Host Name\n: Double-check that the host name is correctly formatted. It should be exactly \"\nwww.owenhamlin.com\n\"\nwithout any extra characters, slashes, or protocol prefixes.\nPermissions\n: While you mentioned that Block Public Access is turned off, you might still need a bucket policy that explicitly allows public read access. For a redirect bucket, you should have a policy that includes the s3:GetObject permission for public access.\nPropagation Time\n: Changes to S3 website configurations can sometimes take time to propagate fully. Wait a few minutes after making changes before testing again.\nBrowser Cache\n: Your browser might be caching previous responses. Try clearing your browser cache or testing in an incognito/private browsing window.\nTesting Method\n: Make sure you're testing using the S3 website endpoint URL (\nhttp://owenhamlin.com.s3-website-us-west-1.amazonaws.com\n) and not the S3 API endpoint. Redirects only work when accessing through the website endpoint.\nIf you've verified all these settings and the redirect still isn't working, there could be an issue with how the redirect is being processed. In that case, you might want to consider creating a support case with AWS for more specific assistance with your configuration.\nSources\nS3 website-redirect-location not redirecting | AWS re:Post\nDomain Redirect on S3 missing colon https// | AWS re:Post\nCloudFront cache and S3 bucket redirect issue | AWS re:Post"
}