{
  "body": "I’ve linked my WhatsApp Business Account (WABA) with AWS End User Messaging – Social Messaging, and the number has remained in a pending review state for over two weeks. The dashboard still shows “We’ll review your business to ensure it complies with WhatsApp’s Commerce Policy,” but no updates or emails have been received. Has anyone experienced this delay, and is there a way to expedite the review or check the status more directly?\n\nThe delay you're experiencing with your WhatsApp Business Account verification is not uncommon. WhatsApp has an automated business verification process that typically takes up to 2 weeks to complete, but in some cases, it can take longer.\nSince you've already waited over two weeks without any updates, I recommend taking the following steps:\nCheck the current status of your registration in the AWS End User Messaging Social console under the Configurations tab and Registrations section. Your registration could be in various states such as REVIEWING, REQUIRES_AUTHENTICATION, or REQUIRES_UPDATES.\nIf the status is REQUIRES_UPDATES, look for warning icons that indicate issues needing correction, then resubmit your registration.\nFor prolonged review periods like yours, reaching out to AWS Support directly is recommended. They can engage with downstream reviewers to better understand any potential issues with your registration.\nWhen contacting AWS Support, include your registration ID and relevant details about your use case.\nIt's important to note that WhatsApp can disable WhatsApp Business Accounts if their business policy is violated or if the business identity can't be verified. Therefore, ensure that all your business information is accurate and complies with WhatsApp's Commerce Policy.\nWhile waiting for verification, I recommend reviewing the best practices for AWS End User Messaging Social and WhatsApp to ensure your account setup aligns with their requirements.\nSources\nNo response on SMS registration request for 2+ months | AWS re:Post\nSet up WhatsApp Business messaging - Amazon Connect"
}