{
  "body": "I’m looking for insights or suggestions with a hybrid identity setup, specifically around access administration for EC2 instances.\nFor newly launched Linux EC2 instances in AWS, we’re exploring ways to leverage existing on-prem LDAP setup, which is populated by Oracle Identity Manager (OIM) based on on-prem AD. The use case is administrative access (not application integration).\nSome options I’m evaluating:\nUse the on-prem LDAP directly over Direct Connect to authenticate EC2 instance access.\nExtend the LDAP directory to AWS (e.g., host a read-replica on EC2) to reduce latency and dependency on the on-prem network. Any other ways to extend this particular LDAP to AWS other than hosting on EC2?\nExplore whether this OIM-populated LDAP can integrate with AWS Identity Center?\nOptions on using AWS SSM with the OIM-populated LDAP?\nIf anyone has dealt with similar setups or has recommendations on best practices, I’d appreciate any guidance.\nThanks in advance!\n\nAre all users that need EC2 access already in Entra ID, or only in the LDAP/OIM setup?\n\nThe users that need EC2 access is in the OIM - LDAP.\n\nFor your hybrid identity setup for EC2 instance administrative access, I can provide insights on your options:\nUsing on-prem LDAP directly over Direct Connect is viable but introduces latency and a dependency on your network connection. If your Direct Connect fails, you might lose access to your EC2 instances.\nExtending your LDAP directory to AWS is a good approach to reduce latency and network dependencies. Beyond hosting a read-replica on EC2, you could consider AWS Managed Microsoft AD if your LDAP is AD-compatible. This would provide a fully managed directory service in AWS that could establish trust relationships with your on-premises directory.\nFor integrating your OIM-populated LDAP with AWS Identity Center, you have a few options:\nIf your LDAP is based on Microsoft AD, you can connect AWS Identity Center to it using AWS Directory Service\nIf your LDAP supports SAML 2.0 and SCIM protocols, you could potentially connect it as an external identity provider to AWS Identity Center\nFor AWS Systems Manager (SSM) integration with your LDAP, you could:\nConfigure your EC2 instances to authenticate against your LDAP directory\nUse AWS Identity Center for SSM access, which would then leverage your identity source\nGiven that you already have Entra ID integrated with AWS Identity Center, you might want to consider whether you can consolidate your identity management approach. If your OIM-populated LDAP is syncing with or connected to your AD (which is then connected to Entra ID), you might be able to leverage that existing chain for EC2 access rather than creating a separate integration path.\nThe most resilient approach would likely be option 2 - extending your directory to AWS, either through a read-replica on EC2 or by establishing trust relationships with AWS Managed Microsoft AD if compatible with your environment.\nSources\nUse Case 5: Extend your on-premises Active Directory to the AWS Cloud - AWS Directory Service\nAWS integrate with AD\\AAD | AWS re:Post\nConnect to a Microsoft AD directory - AWS IAM Identity Center\nWorkforce identity management - AWS Prescriptive Guidance\nManage an external identity provider - AWS IAM Identity Center\n\nHi Kavz,\nThis is a great hybrid identity use case — thanks for sharing the detailed context.\nSince you're exploring access administration for EC2 instances via an OIM-populated LDAP setup, here are a few tailored thoughts for each option:\nUsing on-prem LDAP directly (over Direct Connect):\nYes, it can work, but be cautious — this introduces network dependency. If your Direct Connect link goes down, administrative access to your EC2 instances may break. This may be fine for dev/test, but it could pose reliability risks in production.\nExtending LDAP to AWS:\nHosting a read-replica on EC2 is one route. Another option — if your LDAP is AD-compatible — is to use AWS Managed Microsoft AD and establish trust. This reduces latency and removes the single point of failure from your on-premises.\nIntegration with AWS Identity Center:\nDirect integration with OIM-populated LDAP isn’t natively supported, but if your LDAP syncs to AD (which then syncs to Entra ID), you already have an indirect path into Identity Center.\nAlso worth exploring:\nIf your LDAP supports SAML 2.0 or SCIM, you could explore custom IdP integration.\nAWS Identity Center works well with Entra ID, so consolidating access through it might be cleaner long-term.\nSSM + LDAP Access:\nYou can configure EC2 instances (especially Linux) to authenticate via LDAP using tools like sssd and PAM. Combine that with SSM Session Manager and careful role control via AWS Identity Center — and you have secure, auditable, admin access that still aligns with your enterprise directory structure.\nRecommendation:\nIf your goal is resilience + manageable latency, extending LDAP to AWS (via replica or trust with Managed AD) is likely the sweet spot — especially if your LDAP content flows through AD/Entra anyway.\nLet me know if you want to deep-dive into the configuration steps for any of these paths — happy to help!\n\nThanks for the inputs TheQuietBuilder,\nIntegrating the LDAP with Identity Center and extending the LDAP by deploying on EC2 are the 2 options I was considering and researching about.\n\nHey Kavz — thanks for circling back, and I’m really glad the info was helpful!\nBetween the two options you’re looking into (extending LDAP on EC2 or integrating with Identity Center), both can work depending on how much control and resilience you’re looking for. If you do decide to spin up the LDAP replica on EC2, I’m happy to help you think through the setup details — or if you want to explore the Identity Center angle more, we can talk through how that might connect depending on what your LDAP supports.\nFeel free to drop more details here if you’d like to explore next steps. Happy to help however I can!\n\nHey Kavz — thanks again for the update!\nSince you're considering both paths — extending LDAP and integrating with Identity Center — here's a quick comparison and next-step suggestions, based on how much control and resilience you need:\nOption A: LDAP Replica on EC2\nPros:\nKeeps full on‑prem LDAP functionality\nCan authenticate Linux sssd/PAM users directly using LDAP over TLS\nReduces latency and eliminates dependence on Direct Connect\nCons:\nYou’re responsible for EC2, backup, patching, and security\nStill requires careful IAM and network setup via SSM\nResources:\nConfigure sssd.conf with LDAP ID mapping and TLS for secure authentication\ndocs.aws.amazon.com\n+1\nlearn.microsoft.com\n+1\ndocs.aws.amazon.com\n+4\nlearn.microsoft.com\n+4\nlearn.microsoft.com\n+4\ndocs.cloudera.com\n+4\ndocs.redhat.com\n+4\naws.nz\n+4\nOption B: AWS Managed Microsoft AD with Trust\nPros:\nFully managed by AWS (no EC2 for AD infra)\nSupports two-way trust with on‑prem AD — enabling seamless authentication\nlearn.microsoft.com\ndocs.aws.amazon.com\n+8\ndocs.aws.amazon.com\n+8\nrepost.aws\n+8\nIntegrates natively with AWS Identity Center and EC2 domain-join\nSupports both Windows and Linux clients\nCons:\nRequires AD compatibility and trust configuration\nMay involve schema considerations depending on OIM setup\nNext-Step Suggestions:\nDecide your priority:\nWant full LDAP control? Go EC2 + sssd/PAM\nPrefer manageability and integration? Use Managed AD + AD trust"
}