{
  "body": "Hi everyone,\nWe’re exploring a potential architecture to streamline how multiple organizations access a shared knowledge base (KB) for GenAI-based applications—particularly in regulated or collaborative industry environments.\nToday, we’re seeing several organizations independently build GenAI solutions based on Retrieval-Augmented Generation (RAG), each uploading and maintaining very similar document sets. This results in duplicated effort, inconsistent knowledge curation, and fragmented governance.\nWe're considering a more efficient and scalable alternative:\nCentralize shared documents into a single Amazon Bedrock Knowledge Base in one AWS account, and expose access to that KB via a REST API using the Amazon Bedrock Knowledge Base Retrieval MCP Server.\nIn this model:\nEach organization can maintain its GenAI application in its own cloud environment (AWS or otherwise).\nApplications would query the centralized KB via REST through the MCP Server, eliminating the need for cross-account IAM roles, STS configurations, and tight coupling to AWS infrastructure.\nEach application could still use local tools or a complementary private KB when needed, combining them through agents that dynamically choose the appropriate tool for each query.\nThis approach allows for:\nSimplified integration for multi-cloud and multi-org environments\nStandardized, secured, and auditable access to shared knowledge\nLower operational overhead compared to cross-account architectures\nFrom your experience, do you believe this architecture using the MCP Server would be feasible by leveraging MCP’s own resource discovery and retrieval capabilities to expose, navigate, and query the centralized knowledge base?\n\nBased on the information available, I don't see any references to an \"MCP Server\" or \"Amazon Bedrock Knowledge Base Retrieval MCP Server\" in the context of Amazon Bedrock Knowledge Bases. \n\nHowever, I can address the core concept of your proposed architecture - centralizing a shared knowledge base with Amazon Bedrock.\n\nAmazon Bedrock Knowledge Bases do provide a fully managed capability that supports the entire RAG workflow, from data ingestion to retrieval and prompt augmentation. The service allows you to connect to various data sources, process documents, create embeddings, and store them in vector databases like Amazon OpenSearch Serverless, Pinecone, or Redis Enterprise Cloud.\n\nFor your proposed centralized architecture, Amazon Bedrock Knowledge Bases offer several relevant features:\n\n1. API-based access to the knowledge base, which could potentially be exposed through API Gateway to create the REST API interface you're envisioning\n2. Enterprise-grade security features including encryption and access controls to protect sensitive data\n3. Seamless integration with other Amazon Bedrock services like models and agents\n4. Session context management for multi-turn conversations\n5. Citation tracking for transparency and credibility\n\nYour approach of centralizing shared documents into a single Amazon Bedrock Knowledge Base and exposing it via a REST API could indeed provide the benefits you mentioned - standardized access to shared knowledge, reduced duplication of effort, and consistent governance. Organizations could maintain their GenAI applications in their own environments while accessing the centralized knowledge base.\n\nHowever, you would need to design the API access layer yourself, as there isn't a specific \"MCP Server\" component mentioned in the Amazon Bedrock documentation. You might consider using Amazon API Gateway with AWS Lambda to implement the fully managed backend API endpoint, which is a pattern mentioned in AWS Bedrock Generative AI application architectures.\nSources\nCommunity | Unleashing the Power of AWS Bedrock-Knowledge Base for Generative AI - Claude2 Model\nKnowledge bases for Amazon Bedrock - AWS Prescriptive Guidance\nCommunity | Choose the right RAG Architecture for your AWS GenAI App\nCommunity | AWS Bedrock Generative AI Application Architecture\nHow Amazon Bedrock knowledge bases work - Amazon Bedrock"
}