{
  "body": "I'm currently facing issues deploying my AWS Lambda functions. Suddenly, none of them are deployable, and I'm seeing this error:\nError deploying code: UnknownError\nAdditionally, I'm getting the following error from the Bedrock side when trying to invoke a model:\nAn error occurred (ValidationException) when calling the InvokeModel operation: Operation not allowed\nThese errors started appearing without any changes to the deployment pipeline or permissions (to my knowledge). Has anyone else encountered this issue recently, or does anyone have suggestions on how to resolve it?\nAny help would be appreciated. Thanks in advance!\n\nIt seems you're experiencing multiple issues with your AWS services, specifically with Lambda function deployment and Bedrock model invocation. Let's address these issues one by one:\nFor the Lambda function deployment issue:\nThe \"UnknownError\" you're encountering when trying to deploy Lambda functions can have several causes. First, ensure you're in the correct AWS region where your Lambda functions were originally created, as they are region-specific. It's also possible that there might be a temporary block on your account due to a suspected malicious access attempt, which can cause functions to become temporarily inaccessible.\nEven though you mentioned no changes to permissions, it's worth double-checking that your account has the necessary IAM permissions to access and deploy Lambda functions. Insufficient permissions can lead to \"UnknownError\" messages. You should also check the AWS Service Health Dashboard to see if there are any ongoing issues or outages with Lambda in your region.\nIf the issue persists, try accessing your Lambda functions from a different browser or device to rule out any local issues. If you still can't resolve the problem, it's recommended to contact AWS Support. You can open a case under \"Account and billing\" which can be done free of charge. They can investigate any account-specific issues that might be causing this problem.\nRegarding the Bedrock error:\nThe \"ValidationException\" error you're receiving when trying to invoke a Bedrock model suggests there might be an issue with permissions or configuration. To resolve this, you need to ensure that your Bedrock agent has the necessary permissions to invoke Lambda functions.\nTo fix this, you should add a resource-based policy statement on the Lambda function:\nGo to your Lambda function in the AWS console\nSelect the \"Configuration\" tab\nChoose \"Permissions\" from the menu\nScroll down to \"Resource-based Policy Statements\" and click \"Add Permissions\"\nSelect \"AWS Service\" and choose \"Other\" from the Service dropdown\nEnter a Statement ID (can be anything)\nSet the Principal to \"bedrock.amazonaws.com\"\nEnter your Bedrock Agent's ARN as the Source ARN\nSelect \"lambda:InvokeFunction\" as the Action\nSave the changes\nThis should grant the necessary permissions for Bedrock to invoke your Lambda function.\nIf you continue to experience issues after trying these solutions, it would be advisable to contact AWS Support for further assistance, as there might be account-specific factors at play.\nSources\nNot able to see my lambda functions | AWS re:Post\nError when Bedrock agent invoke lambda | AWS re:Post\n\nHello.\nDoes Bedrock run normally when run from somewhere other than Lambda?\nI think you need to determine whether the problem is with Lambda or Bedrock.\nBy the way, since the Lambda Unknown error may be an issue on the AWS side, I recommend opening a case with AWS Support under \"Account and billing\" and asking for assistance.\nInquiries under \"Account and billing\" can be made free of charge.\nhttps://docs.aws.amazon.com/awssupport/latest/user/case-management.html"
}