{
  "body": "This article shows you how to implement IP-based access controls for the Amazon SageMaker Unified Studio portal. This solution helps organizations that need robust access controls to enhance security and meet compliance requirements.\n\nIntroduction\nIn the rapidly evolving healthcare sector, secure data sharing between providers remains a critical challenge. It’s important for healthcare customers to address unique risks that are associated with data protection and Health Insurance Portability and Accountability Act (HIPAA) compliance. Therefore, AWS Enterprise Support frequently partners with these customers to help them protect their sensitive data and maintain regulatory compliance. One method that healthcare organizations can use to implement solutions for cross-provider data sharing is Amazon SageMaker Unified Studio. This service is a unified data and AI development environment that provides access to organizational data.\nDuring rigorous security assessments that often include penetration testing, organizations might uncover potential vulnerabilities in their configurations. These findings show how sophisticated attackers might try to bypass existing controls through techniques, such as URL extraction. In such cases, security teams typically request additional mechanisms to implement strict permissions boundaries and protect against identified vulnerabilities. AWS Enterprise Support engages with AWS service teams to investigate issues and develop robust solutions.\nThis case study demonstrates how AWS Enterprise Support collaborates with healthcare customers to architect and implement enhanced security measures, such as IP-based access control solutions. AWS Enterprise Support works closely with customers and helps create multiple layers of protection. Customers use AWS services for their sensitive data and AI/ML initiatives and significantly improve their overall security posture.\nSolution overview\nTo enhance security and apply permissions boundaries, AWS Enterprise Support reviewed and tested a solution with AWS Identity and Access Management (IAM) policies. The solution provides granular control capabilities that support precise restrictions by limiting access to only approved organizational IP ranges. This network-level control makes sure that access attempts from unauthorized IP addresses that are outside your organization's approved ranges are denied, even if your credentials are compromised. The implementation seamlessly integrates with Amazon SageMaker Unified Studio's existing security framework through IAM and doesn’t need any architectural changes to your current setup. As your organization's security requirements evolve, you can easily modify and expand the IP-based access controls to accommodate new requirements.\nPrerequisites\nTo implement the solution, you need the following prerequisites:\nAmazon SageMaker Unified Studio environment with a pre-configured\nAmazonSageMakerDomainExecution\nrole\nAdministrator access to IAM\nList of allowed IP ranges within your organization\nSolution implementation\nThe\nAmazonSageMakerDomainExecution\nrolehas the AWS managed policy\nSageMakerStudioDomainExecutionRolePolicy\nattached to it. Amazon SageMaker Unified Studio creates this role for you on your behalf. For certain actions in the portal, Amazon SageMaker Unified Studio assumes this role in the account where you created the role. It checks that this role is authorized to perform the action.\nFor more information, see\nCreate a Amazon SageMaker Unified Studio domain - manual setup\n.\nStep 1: Create a custom managed policy\nCreate an identity-based policy that denies access to all AWS actions in the account when the request comes from principals outside the specified IP range. For more information, see\nCreate the policy\n. Copy and paste the following policy document into the\nJSON\ntext box:\n{\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n        {\n            \"Effect\": \"Deny\",\n            \"Action\": \"\",\n            \"Resource\": \"\",\n            \"Condition\": {\n                \"NotIpAddress\": {\n                    \"aws:SourceIp\": [\n                        \"172.16.128.0/20\",\n                        \"192.168.64.0/18\"\n                    ]\n                }\n            }\n        }\n    ]\n}\nNote:\nReplace the\naws:SourceIp\ncondition key values with your IP range.\nFor more information, see\nAWS: Denies access to AWS based on the source IP\n.\nStep 2: Attach the custom policy to the IAM role\nTo attach the custom policy to the\nAmazonSageMakerDomainExecution\nrole, follow these steps:\nOpen the\nIAM console\n.\nIn the navigation pane, choose\nRoles\n.\nIn the list, choose\nAmazonSageMakerDomainExecution\n.\nChoose the\nPermissions\ntab.\nChoose\nAdd permissions\n, and then choose\nAttach policies\n.\nAt the top of the policy list, in the search box, start typing the name of the policy that you previously created.\nSelect the policy, and then choose\nAdd permissions\n.\nStep 3: Test and validate the denial of access\nTest access to Amazon SageMaker Unified Studio portal from allowed IP ranges.\nVerify denial of access to Amazon SageMaker Unified Studio from unauthorized IP ranges.\nThe following example screenshot shows the denial of access to a SageMaker Unified Studio portal when an IP-based denial policy is in effect.\nNote:\nYou can use the same mechanism and steps to restrict access to the Amazon DataZone data portal. Use the\nAmazonDataZoneDomainExecution\nrole.\nCleanup\nYou don't need to terminate any resource, because you didn't have to provision any for this solution.\nTo remove the IP range permissions boundaries, follow these steps:\nDetach the custom policy\nthat you created in step 1 of the previous section.\nDelete the custom policy\nif you no longer need it.\nConclusion\nThrough IP-based access restrictions for the Amazon SageMaker Unified Studio portal, you can use existing AWS services to address complex security challenges. This solution, developed through collaboration between AWS Enterprise Support and healthcare customers, showcases the flexibility and effectiveness of IAM policies to create tailored security measures.\nOrganizations can use this approach to achieve a balance between security and operational efficiency. For industries that deal with sensitive data, maintaining compliance while fostering innovation is crucial. This article’s solution proves valuable to these industries through its non-intrusive nature. It promotes enhanced protection without the need to disrupt existing workflows or require significant architectural changes.\nAs security landscapes evolve and organizational needs change, you can easily modify the IP-based access controls to accommodate new requirements. This flexibility makes sure that your security measures can grow and adapt alongside the organization to provide long-term benefits.\nAWS Enterprise Support can help organizations that must implement similar security enhancements on how to use AWS services for complex use cases. Our team of Cloud Support Engineers (CSEs) and Technical Account Managers (TAMs) can provide tailored guidance, share industry best practices, and offer hands-on support to help you optimize your AWS environment. To learn more about our plans and offerings, see\nAWS Support\n.\nAbout the authors\nRashmiman Ray\nRashmiman is a TAM at AWS in New Jersey. He works with Enterprise customers to provide technical insights and cloud optimization strategies that drive their success in the cloud. Outside of work, Rashmiman enjoys hiking, playing cricket, and cooking Indian delicacies.\nRamesh Narayanaswamy\nRamesh is a Sr. TAM at AWS in Boston, Massachusetts. He partners with AWS Enterprise customers to deliver proactive technical guidance and best-practice recommendations for cloud optimization. Outside of work, Ramesh likes to stay active through tennis, volleyball, and nature activities."
}