{
  "body": "I have setup aws sso identity center\nand im using mumbai in all accounts\nBut when i try to login to a particular account it always take me to NV by default.\nHow to fix\n\nYou can modify the\nrelay state\nfor the\nPermission Set\nassociated with your login.\nTo specify AWS Console in Mumbai region, set value to\nhttps://ap-south-1.console.aws.amazon.com/console/home\n\nIt's a good idea but can the same permission set be used for multiple accounts / different regions?\n\nPermission set is at IDC mgmt acct level, so should work with different accts. Different permission set can have different relay state values. Can you configure relay state value in your IDC to verify?\n\nWhen you log in to AWS, the console will default to the last region you visited if you haven't explicitly set a default region. This behavior could explain why you're being directed to North Virginia (us-east-1) instead of Mumbai.\nTo fix this issue and set Mumbai as your default region:\nNavigate to the Unified Settings page in the AWS Management Console by clicking the gear icon in the navigation bar\nSelect \"See all user settings\"\nClick \"Edit\" next to \"Localization and default Region\"\nChoose Mumbai (ap-south-1) in the \"Default Region\" field\nSave your settings\nOptionally, click \"Go to new default Region\" to immediately switch to Mumbai\nIf you're specifically having issues with IAM Identity Center and regions, it's worth noting that IAM Identity Center is region-specific. If you've set up IAM Identity Center in one region (like Mumbai) but are trying to access it from another region (like North Virginia), you'll get an error message saying \"You have already registered another region.\"\nFor IAM Identity Center configuration with the AWS CLI, ensure you're specifying the correct region (ap-south-1 for Mumbai) when running commands like 'aws configure sso'.\nSources\nSetting the default Region in the AWS Management Console - AWS Management Console\nConfigure AWS CLI with SSO raise error regarding \"primary email address is assigned in AWS Identity Center\" | AWS re:Post\nCannot open IAM Identity Center / Region issue | AWS re:Post"
}