{
  "body": "I want to add a SQL Server data source to Amazon Q Business, but the SQL Server on-premise option is no longer available. The same applies to RDS.\nIs there another way to do this?\n\nIt appears that the process for connecting database sources like SQL Server (on-premises) and RDS to Amazon Q Business has changed. Instead of having direct access to connect these data sources, you now need to request access first.\nWhen you try to add SQL Server or RDS as a data source in the Amazon Q Business console, you'll see a \"Request Access\" button instead of a \"Connect\" button. This indicates that either your AWS account doesn't currently have the necessary permissions to use these data source connectors, or the connectors might be in a preview or limited availability phase.\nTo proceed with adding SQL Server or RDS as a data source to Amazon Q Business, you should:\nClick on the \"Request Access\" button when you see it in the Amazon Q Business console.\nThis will direct you to an AWS contact form.\nFill out the form to request access to the SQL Server or RDS connector for Amazon Q Business.\nWait for a response from AWS support with further instructions.\nIn the meantime, ensure you've completed the prerequisites for connecting Amazon Q Business to Microsoft SQL Server:\nCreate an Amazon Q Business application\nCreate a retriever and add an index\nCreate an IAM role for your data source\nStore your SQL Server authentication credentials in AWS Secrets Manager\nOnce you receive approval and instructions from AWS support, you should be able to proceed with connecting your SQL Server or RDS database to Amazon Q Business.\nSources\nAmazon Q Business Data Sources How to Request Access | AWS re:Post\nConnecting RDS to Amazon Q Business | AWS re:Post\nPrerequisites for connecting Amazon Q Business to Microsoft SQL Server - Amazon Q Business\n\nThe SQL Server (on-premises) and RDS SQL connectors are deprecated. Below is the alternative approach to access your SQL data:\nCreate a backup of your SQL tables\nStore the backup in Amazon S3\nUtilize the Amazon S3 connector to access your data in Amazon Q Business"
}