{
  "body": "I want to sync my Amazon Bedrock knowledge base, but I receive a file sync error.\n\nResolution\nFile format and size limitations\nVerify that your data source files comply with the supported\nformats and size restrictions\nfor knowledge bases.\nIf your data source exceeds the size limit for a parsing strategy, then split your data into multiple data sources. Or, you can request a limit increase from AWS Support.\nPermissions and access issues\nVerify that the AWS Identity and Access Management (IAM) role for your Amazon Bedrock knowledge base has the permissions to access the data store and generate queries. To configure the required permissions, see\nCreate a service role for Amazon Bedrock Knowledge Bases\n.\nIf you use embedding models with your knowledge base, make sure that you have access to the embedding models. Missing subscriptions might result in authentication errors. To request access to the required models, follow the instructions in\nAccess Amazon Bedrock foundation models\n.\nInternal server errors\nPrerequisite:\nCreate a destination to deliver your logs to. You can\nuse Amazon Simple Storage Service (Amazon S3) to set up an S3 bucket\n, or\nuse Amazon CloudWatch Logs to set up a log group\n. If you use an S3 bucket, then\nadd a bucket policy\nto the bucket that includes the policy statement from step 2 in\nSet up an Amazon S3 destination\n. If you use a log group, then\ncreate an IAM role\nthat includes the trust relationship and policy statement from step 2 in\nSet up a CloudWatch Logs destination\n.\nIf you received the \"The server encountered an internal error while processing the request\" error during the sync process, check the logs. Complete the following steps:\nUse the\nCloudWatch console\nor\nAPI\nto activate logging for the knowledge base.\nReview the\nAWS CloudTrail\nlogs and\nmodel invocation logging\nfor the\nThrottlingException\nerror.\nThird-party application integration issues\nIf you sync data from third-party applications, then make sure that you correctly set up the credentials and configurations. To set up the integration, use the following documentation for your third-party application:\nConnect to Salesforce for your knowledge base\nConnect to Confluence for your knowledge base\nConnect to Microsoft SharePoint for your knowledge base\nIf you experience sync failures after following the preceding resolutions, then\ncreate a HAR file and Console logs for an AWS Support case\n.\nRelated information\nSync your data with your Amazon Bedrock knowledge base\nHow do I troubleshoot permission errors that I get when I create a knowledge base in Amazon Bedrock?"
}