{
  "body": "I have a very weid issue with eu-central-1 region across all accounts in the Organization. Did anyone experienced something similar? I am not using SCPs nor RCPs on Organization, which would block such API calls.\nFor example EC2 Global View prints bunch of errors for all read API calls for this particular region:\nRegion: eu-central-1 - Vpc | UnauthorizedOperation: You are not authorized to perform this operation. User: ABC is not authorized to perform: ec2:DescribeVpcs because no VPC endpoint policy allows the ec2:DescribeVpcs action\nRegion: eu-central-1 - Subnet | UnauthorizedOperation: You are not authorized to perform this operation. User: ABC is not authorized to perform: ec2:DescribeVpcs because no VPC endpoint policy allows the ec2:DescribeVpcs action\nRegion: eu-central-1 - SecurityGroup | UnauthorizedOperation: You are not authorized to perform this operation. User: ABC is not authorized to perform: ec2:DescribeVpcs because no VPC endpoint policy allows the ec2:DescribeVpcs action\nAWS support case already opened: #174885656900826\n\nHello.\nThe error message says that it is denied by the VPC endpoint policy, but are you connecting from your PC using a VPC endpoint to access the management console or execute the VPC API?\nIn that case, you need to check the settings of the VPC endpoint to which you are connecting.\nhttps://docs.aws.amazon.com/vpc/latest/privatelink/vpc-endpoints-access.html\n\nHi Riku, thanks for your input. I've double checked that and it seems it's related to restrictions on my corporate network then. Must be some VPC EP policy blocking this particular region, as I can access other regions.\n\nIf only eu-central-1 is affected, the VPC endpoint policy in eu-central-1 is likely the problem, so I recommend that you have the member who manages the VPC endpoint check the settings.\n\nCan you try running this AWS CLI command from one of the affected accounts:\naws ec2 describe-vpc-endpoints --region eu-central-1\nThis will help identify any VPC endpoints that might be affecting the traffic.\nAlso, please check:\nThe IAM permissions of the user/role you're using\nAny default VPC settings in eu-central-1\nNetwork ACLs and Security Groups in the region\nWould you be able to share:\nThe output of the describe-vpc-endpoints command?\nWhether this issue started recently or has been ongoing?\nIf other AWS regions are working normally?"
}