{
  "body": "This article demonstrates how you can deploy Amazon Q Business to streamline internal data collection processes for sustainability reporting.\n\nIntroduction\nAround\n50,000 EU companies\nface mandatory disclosures under the Corporate Sustainability Reporting Directive (CSRD). Many other companies worldwide are navigating similar requirements, such as the Securities and Exchange Commission's (SEC) climate disclosure rules in the US, California's Senate Bill 253 and Senate Bill 261, the UK's Streamlined Energy and Carbon Reporting (SECR), and Australia's National Greenhouse and Energy Reporting (NGER) Act. As the regulatory landscape continues to evolve rapidly, organizations look for efficient ways to manage increasingly complex sustainability reporting.\nThe following are some key features that are required for sustainability reporting:\nDocument analysis\n: Processes and extracts relevant information from sustainability reports, regulatory documents, and internal policies.\nQuery resolution\n: Answers specific questions to extract data on specific reporting requirements, standards, and compliance procedures.\nContent generation\n: Creates draft responses for sustainability reporting sections based on organizational data.\nData validation\n: Cross-references information across multiple sources to verify accuracy in reporting.\nCitation tracking\n: Maintains clear links to source documents for all generated content.\nYou can use\nAmazon Q Business\nto build a generative AI-powered solution to transform these challenges into manageable processes. Amazon Q Business uses custom connector capabilities to integrate with data source connectors that index content from established enterprise platforms such as Salesforce, Jira, and SharePoint. These custom connectors create a unified information index that serves as the foundation for query responses.\nThis article helps teams that work on Environmental, Social, and Governance (ESG) reporting streamline their internal data collection processes. Your teams can use Amazon Q Business to efficiently access and summarize sustainability reporting standards on the same interface. The purpose of this article is to show you how to deploy Amazon Q Business for sustainability reporting in four straightforward steps. These steps include setting up your environment, connecting critical sustainability data sources, building effective queries, and optimizing your implementation. You will also discover practical examples of how to extract CSRD requirements, generate ESG disclosures, and validate sustainability metrics, all while you manage your costs effectively. Whether you're preparing for your first sustainability report, or streamlining an existing process, this article gives you actionable steps to simplify the complexity of regulatory compliance.\nTechnical Account Managers (TAMs) can help you work backwards from your organizational sustainability goals to solutions in the cloud. They can review your architecture against sustainability best practices, help enhance your deployments, and conduct deep-dive sessions on the\nCustomer Carbon Footprint Tool\n. Also, they can guide you through the deployment and utilization of the\nSustainability Proxy Metrics dashboard\n.\nTo learn more about our plans and offerings, see\nAWS Support\n.\nSet up Amazon Q Business\nCreate an application environment\nCreate an Amazon Q Business application environment that you can access anonymously with the Amazon Q Business console, API, AWS SDK, and AWS Command Line Interface (AWS CLI).  For more information, see\nCreating an Amazon Q Business application environment for anonymous access\n.\nCreate an index\nBefore you add data in your Amazon Q application, you must connect it to an index. An index stores and retrieves content from any data sources that you connect to your application. After you create an index, you can add data sources for your application and configure features.\nTo create an index for your application, follow these steps:\nSign in to the Amazon Q Business console.\nIn\nApplications\n, choose the name of your application.\nFrom the left navigation menu, select\nData sources\n.\nChoose\nAdd an index\n.\nOn the\nAdd an index\npage, for\nIndex name\n, enter a name for the index.\nIn\nIndex provisioning\n, select between\nEnterprise\nand\nStarter\nindex types based on your use case.\nEnterprise\nindex is ideal for production workloads that require maximum uptime.\nStarter\nindex is well suited for non-production workloads, such as proof of concepts, development, and testing. For this example, use the\nEnterprise\nindex for high availability and scalability. For\nNumber of units\n, choose the number of index units that you need. For this example, set this value to\n1\n.\nChoose\nAdd an index\n.\nFor more information, see\nCreate an Amazon Q Business index\n.\nConfigure a data source\nAfter you create the index, add a data source to your application. Complete the following steps:\nFrom the left navigation menu, select\nData sources\n.\nOn the\nData sources\npage, choose\nAdd data source\n.\nSelect the data source according to your use case. For this example, select\nWeb crawler\nto use the CSRD public documentation.\nFor\nData source name\n, enter a unique name for the data source.\nFor\nDescription\n, enter a description for the data source.\nFor\nSource\n, choose\nSource URLs\n.\nUnder\nSource URLs\n, enter the URLs that you want Amazon Q Business to crawl. For this example, enter the European Financial Reporting Advisory Group (EFRAG) website\nhttps://www.efrag.org/\n.\nFor\nAuthentication\n, select\nNo authentication\nfor this example. This option is suitable for a data source that's public documentation. If you use your organization's documentation, then select one of the listed authentication methods to allow Amazon Q Business to access your data source instance.\nFor\nIAM role\n, select the AWS Identity and Access Management (IAM) role or create a role to access repository credentials and application content.\nFor\nSync domain range\n, select whether to sync website domains with subdomains only, or also crawl other domains that the webpages link to. For this example, select\nSync everything\nto sync the website domains with subdomains and other domains that the webpages link to.\nFor\nSync mode\n, select how you want to update your index when the content of your data source changes.\nIn\nSync run schedule\n, for\nFrequency\n, selecthow often Amazon Q will sync with your data source.\nChoose\nAdd data source\n.\nTo effectively use your Amazon Q Business application for CSRD compliance, consider including the following additional data sources:\nCSRD official documentation\nIndustry-specific sustainability reporting guidelines\nYour company's existing sustainability reports and relevant internal documentation\nRelevant environmental and social standards\nFor more information, see\nConnecting Amazon Q Business to Web Crawler using the console\n.\nVerify deployment\n1. In\nData source details\n, choose\nSync now\nto allow Amazon Q to begin syncing data from your data source. When the sync completes, your data source is ready to use.\n2. After the sync completes, choose\nApplications\nfrom the left navigation menu.\n3. In\nApplications\n, under the\nAccess URL\ncolumn, choose the URL for your application. Then, sign in with your user credentials to see the preview interface..\n4. After you successfully log in, you can start to use the Amazon Q AI assistant for your application.\n5. In the AI assistant, run test queries, such as the following:\n\"What are the CSRD reporting requirements for greenhouse gas emissions?\"\n\"How do I calculate Scope 3 emissions according to CSRD standards?\"\n\"What social indicators does CSRD require for reporting?\"\n\"What is the 2024 WuE value?\"\n\"What was COMPANY A scope 2 carbon footprint in 2024?\"\n6. Verify source citations and response accuracy.\nAs shown in the screenshot, the configured application provides responses with direct references to source documents. This allows traceable and accurate information retrieval for CSRD compliance tasks.\nBest practices to optimize cost and performance\nUse the following best practices to manage costs and optimize performance for your Amazon Q Business application:\nStart small\n: Begin with 1 or 2 index units that can support up to 40,000 documents.\nScale gradually\n: Increase capacity based on actual usage patterns. When sync fails because of missing capacity, try to increase the index units and sync again.\nConduct regular auditing\n: Implement processes to identify and remove outdated documents to maintain index efficiency.\nMaintain synchronization intervals based on frequency of updates\n: Set longer synchronization intervals for regulatory frameworks and standards that evolve on a slower rate. Implement daily or weekly synchronization for frequently updated internal reports.\nUse a focused approach\n: Connect only to repositories that contain CSRD-relevant content. Start with three to five key data sources, such as regulatory documents, internal policies, and sustainability reports.\nCleanup\nWhen you decommission your Amazon Q application, follow these steps to make sure that you clean up the resources. This helps you manage your costs.\nRemove your data sources\nDelete all indexes for your data sources\n.\nDelete your data source connectors\n.\nDelete your application\nDelete your Amazon Q Business application environment\n.\nClean up the IAM role that you created for Amazon Q Business\nDelete the IAM role\nthat you created for Amazon Q Business.\nDelete any policies that are attached to this IAM role\n.\nCheck your bills\nReview your bills in the\nAWS Billing console\nto make sure that you don't incur ongoing charges for your Amazon Q Business application.\nConclusion\nThis article outlines how to create an Amazon Q Business application for sustainability reporting that demonstrates the CSRD standard. You can apply this process for your other regulatory compliance needs. Amazon Q provides an easy way to discover and organize data in multiple sources and offers easy summary access with links to the source data. This makes access to internal and regulation standard information more efficient.\nIf you're an AWS customer in a highly regulated industry, or have reporting requirements, then\nAWS Enterprise Support\nteams can help support your needs. These teams provide additional guidance on available data sources from AWS. Also, they support your efforts to reduce carbon footprint on AWS through technical architectural reviews, sustainability dashboards, and regular collaborations.\nAbout the authors\nImane ZEROUAL\nImane ZEROUAL is a Senior Cloud Operations Architect at AWS. She has years of industry experience, including roles in networking, Telco, cloud operations, and systems engineering. In her current role, she helps AWS customers run resilient, secure, sustainable, and cost-efficient workloads on AWS with a focus on Media and Sustainability.\nHamza MIMI\nHamza MIMI is a Middle East, North Africa, and Turkey (MENAT) Solutions Architect for Partners and strategic deals at AWS, where he bridges cutting-edge technology with impactful business outcomes. With expertise in AI and a passion for sustainability, Hamza helps organizations architect innovative solutions. These solutions drive both digital transformation and environmental responsibility, and turn complex challenges into opportunities for growth and positive change."
}