{
  "body": "We had a bucket in S3 Called template.crystalgraphics.com\nI emptied the bucket, and deleted the bucket on 6/3/2025.\nThen I found someone in Indonesia was using the bucket for a file on their website.\nHere is the URL:\nhttps://s3.amazonaws.com/template.crystalgraphics.com/index.html\nNote that in the S3 Console, the 'template.crystalgraphics.com' bucket does not show up. (Probably because I deleted it).\nDo you know how come the URL above still works?  And How could someone put the index.html file into that bucket?\nWe upload files using the API.  Perhaps they found our Access Key.   (I will change our keys)\nI'll appreciate your help.\nGeorge\n\nHello.\nDid you already delete the S3 bucket in your AWS account?\nIn this case, it will be possible to create an S3 bucket in another AWS account, so it is possible that someone other than you has created an S3 bucket with the same name in another AWS account.\nhttps://docs.aws.amazon.com/prescriptive-guidance/latest/defining-bucket-names-data-lakes/faq.html\nIf you delete an Amazon S3 bucket and want to create a new bucket with the same name, you must wait for the name to become available again. It can take 48–72 hours for the changes to take effect. It's a best practice to wait at least 48 hours before creating a new bucket that reuses a previous name. Amazon S3 bucket names are globally unique, and all AWS accounts share the same namespace.\nAs described in the document below, why not try contacting us using the abuse form?\nhttps://repost.aws/knowledge-center/report-aws-abuse\nUse the\nReport Amazon AWS abuse form\nto report suspected abuse of AWS resources.\nThe AWS Trust & Safety team can assist you when AWS resources are implicated in the following abuse types:\nWeb content/non-copyright intellectual property that's objectionable content hosted on an AWS resource. The content might be a webpage, image, video, or some other form of internet content. Be sure to provide the URL of the content and a brief comment indicating why you believe the content to be abusive. If the content is a video, then also provide the timestamp in the video where the objectionable content can be located.\nEmail abuse that's an abusive email sent from an AWS resource or spam content hosted on, or sent from an AWS resource. Be sure to provide the full email header and HTML body for investigation.\nNetwork activity that's originating from an AWS resource that causes problematic network traffic. This can be an intrusion attempt, denial-of-service (DoS) attack, port scanning, or any other abusive network activity. Be sure to provide the network logs showing the activity and the source and target IP addresses, ports, and timestamps.\nCopyright that's subject to content removal requests regarding the Digital Millennium Copyright Act.\n\nThank you for your answer.  I was wondering how they could upload a file to a bucket that I had deleted, and one that no longer appears in our bucket list, and now I understand how.\nI submitted an abuse report.    Thanks so much for your help!"
}