{
  "body": "Hi there,\nAt launch, CloudFront VPC Origins didn't support the origin being in a different AWS Account, and that the feature would be supported soon.\nHas this been released, and if not, does anybody know when this may be available?\nThanks,\nNathan\n\nAs of the latest available information, CloudFront VPC Origins still do not support origins in different AWS accounts. When the feature was initially launched, it was announced that the VPC origin resource had to be in the same AWS Account as the CloudFront distribution. At that time, it was mentioned that support for resources across all accounts would be coming soon.\nHowever, there has not been an official announcement or update regarding the release of cross-account support for CloudFront VPC Origins. AWS continually evolves its services based on customer feedback and technological advancements, but specific timelines for feature releases are not typically disclosed publicly.\nIn the meantime, if you need to set up a CloudFront distribution with an origin in a different account, you might consider alternative approaches:\nUse a custom origin setup instead of a VPC origin, which allows for cross-account configurations.\nImplement cross-account access using IAM roles and policies to grant the necessary permissions between accounts.\nUse an Application Load Balancer or API Gateway as an intermediary in the account where the CloudFront distribution is located, which can then route requests to resources in other accounts.\nIt's recommended to keep an eye on AWS announcements and documentation for any updates on this feature. If this capability is critical for your use case, you may want to reach out to AWS support or your account representative for the most up-to-date information on the feature's availability.\nSources\nIntroducing Amazon CloudFront VPC origins: Enhanced security and streamlined operations for your applications | AWS News Blog\nLambda@Edge Compatibility with VPC Origins in CloudFront | AWS re:Post"
}