{
  "body": "I am trying to capture GetDataAccess events from cloudtrail to eventbridge to cloudwatch. But these events, are not being sent to CLoudWatch, I have tried, providing broader pattern, and even tried will all events pattern as well.\nAlthoguh, I can capture LakeFormation PutDataLakeSettings event, but not this one\n\nTo capture AWS Lake Formation GetDataAccess events in EventBridge, there are a few important points to understand about how these events flow through AWS services.\nLake Formation events are sent to EventBridge through AWS CloudTrail. However, this requires that you have CloudTrail trails configured to capture these events. Without properly configured trails, the API calls won't be delivered to EventBridge.\nFor capturing Lake Formation events specifically, you should create an EventBridge rule with an event pattern that includes:\nsource\n: aws.lakeformation\neventSource\n: lakeformation.amazonaws.com\neventName\n: [\"GetDataAccess\"] (to specifically target this API call)\nIf you're able to capture PutDataLakeSettings events but not GetDataAccess events, there are a few possible explanations:\nThe GetDataAccess events might not be included in your CloudTrail configuration. Verify that your trails are configured to capture all management events.\nCloudTrail delivers events to EventBridge on a \"best effort\" basis, so there could be delivery inconsistencies.\nYou can verify if these events are being captured by CloudTrail by querying CloudTrail Lake with a query like:\nSELECT eventTime, userIdentity.onBehalfOf.userid, requestParameters, serviceEventDetails\nFROM your_event_data_store_id\nWHERE eventName='GetDataAccess'\nORDER BY eventTime DESC\nIf the events appear in CloudTrail but not in EventBridge, double-check your event pattern configuration and ensure your CloudTrail is properly set up to deliver events to EventBridge.\nSources\nWhat EventBridge gets from CloudTrail? | AWS re:Post\nAWS Lake Formation events - Amazon EventBridge\nSimplify data lake access control for your enterprise users with trusted identity propagation in AWS IAM Identity Center, AWS Lake Formation, and Amazon S3 Access Grants | AWS Big Data Blog\n\nwe need to set state as ENABLED_WITH_ALL_CLOUDTRAIL_MANAGEMENT_EVENTS for it to work"
}