{
  "body": "Hi all\nI plan to utilize AWS Backup for protecting my AWS resources, including RDS Multi-AZ clusters, EBS volumes, EFS file systems, and S3 buckets. According to the AWS Backup documentation, incremental backups are supported for these resources -\nhttps://docs.aws.amazon.com/aws-backup/latest/devguide/creating-a-backup.html\n. I'd like to configure a backup strategy that includes daily full backups and hourly incremental backups. Is this configuration possible with AWS Backup? Can I configure daily full and hourly incremental backup?\nThanks.\n\nAWS Backup does support incremental backups for many resources including RDS, EBS volumes, EFS file systems, and S3 buckets. However, you cannot explicitly configure AWS Backup to take \"full\" backups on a daily schedule and \"incremental\" backups on an hourly schedule.\nInstead, AWS Backup automatically handles the incremental nature of backups. The first backup of a resource is always a full backup, and subsequent backups are automatically incremental (capturing only changes since the previous backup). This happens regardless of the frequency you set.\nYou can configure backup frequency in AWS Backup as frequently as hourly using the console or CLI. Using the console, you can choose frequencies like hourly, 12 hours, daily, weekly, or monthly. You can also create custom schedules using cron expressions.\nFor your use case, you could set up a backup plan with an hourly frequency. The first backup would be full, and all subsequent hourly backups would automatically be incremental. Each backup, despite being incremental, retains all necessary reference data to allow a full restore. This is true even if the original full backup has been deleted due to lifecycle policies.\nIt's worth noting that AWS Backup maintains the necessary reference data from previous backups to ensure you can always perform a full restore, even if earlier backups have been deleted due to retention policies.\nSources\nBackup plan options and configuration - AWS Backup\nBackup creation by resource type - AWS Backup\n\nI believe AWS supports incremental backups for various resources, including RDS, EBS volumes, EFS file systems, and S3 buckets:\nhttps://docs.aws.amazon.com/efs/latest/ug/awsbackup.html\n\nCan you configure daily full + hourly incremental backups in AWS Backup?\nNot exactly, you can’t explicitly configure \"full vs incremental\" backups in the backup plan, but AWS Backup automatically handles this under the hood, depending on the resource type.\nHere’s how it works:\nAWS Backup always appears to create full backups, but most services (EBS, RDS, EFS, DynamoDB) actually perform incremental backups behind the scenes for efficiency.\nThis means you pay only for the incremental storage changes, even if the plan triggers a \"full\" backup every time.\nThe backup schedule you configure (hourly, daily, etc.) just determines how often backups run, not whether it’s full or incremental.\n**So yes, you can configure:\nA daily backup rule (e.g., retention of 30 days)\nAn hourly backup rule (e.g., retention of 24–48 hours)\nBoth can run in parallel in the same backup plan or as separate plans, depending on your RPO/RTO needs.\nBehind the scenes, AWS Backup will reuse unchanged blocks from previous backups (deduplication), so you're not billed for full snapshot storage every hour."
}