{
  "body": "I'm trying to export a DynamoDB table (in account A) to an S3 bucket (in account B).\nI have changed the S3 policy (in account A) to accept uploads from my account B IAM role. When I try and run an export via cli using\naws dynamodb export-table-to-point-in-time \\\n  --profile \"ACCOUNT_B_PROFILE\" \\\n  --region \"$REGION\" \\\n  --table-arn \"$TABLE_ARN\" \\\n  --s3-bucket \"$S3_BUCKET\" \\\n  --export-format DYNAMODB_JSON \\\nit appears to work as I get the following status message\n{\n    \"ExportDescription\": {\n        \"ExportArn\": \"<export-arn>\",\n        \"ExportStatus\": \"IN_PROGRESS\",\n        \"StartTime\": \"2025-06-17T16:08:53.713000+00:00\",\n        \"TableArn\": \"$TABLE_ARN\",\n        \"TableId\": \"<table-id>\",\n        \"ExportTime\": \"2025-06-17T16:08:53.713000+00:00\",\n        \"ClientToken\": \"14a3d25e-1cc2-44f4-9884-024bf580e1af\",\n        \"S3Bucket\": \"$S3_BUCKET\",\n        \"S3SseAlgorithm\": \"AES256\",\n        \"ExportFormat\": \"DYNAMODB_JSON\"\n    }\n}\nbut when I look on the console the export failed with the following status message\nExport failed\nAccess Denied (Service: Amazon S3; Status Code: 403; Error Code: AccessDenied; Request ID: Q4Q6RAFKG4359BF2; S3 Extended Request ID: RiIBMPfDjcXJfNsl+YusE8WrVwq80ZCcYPuDu8A/gVk9k7ZCEVg7R2G+6aP0AeiYblsESPpfATU=; Proxy: null)\nHowever, if I then perform this manually via the console it works and the export gets uploaded!\nWhy the difference between these two methods?\n\nThe key difference between your CLI and console export attempts is that when exporting DynamoDB data to an S3 bucket in a different account, you need to specify the S3 bucket owner's account ID using the\n--s3-bucket-owner\nparameter in the CLI command.\nWhen you export via the console, AWS automatically handles this cross-account information, but in the CLI you must explicitly provide it. This is why your console export succeeds while the CLI export fails with an \"Access Denied\" error.\nTo fix your CLI command, add the S3 bucket owner's account ID parameter:\naws dynamodb export-table-to-point-in-time \\\n--profile \"ACCOUNT_B_PROFILE\" \\\n--region \"$REGION\" \\\n--table-arn \"$TABLE_ARN\" \\\n--s3-bucket \"$S3_BUCKET\" \\\n--s3-bucket-owner \"ACCOUNT_A_ID\" \\\n--export-format DYNAMODB_JSON \\\n--s3-sse-algorithm AES256\nThe\ns3-bucket-owner\nparameter is required when exporting to an S3 bucket in another account. Additionally, specifying the encryption algorithm (\n--s3-sse-algorithm AES256\n) is a good practice for cross-account exports.\nSources\nResolve access issues when you export from DynamoDB to Amazon S3 | AWS re:Post\nexport-table-to-point-in-time — AWS CLI 2.27.36 Command Reference\nRequesting a table export in DynamoDB - Amazon DynamoDB\n\nAdding the s3-bucket-owner parameter as the account ID worked, thank you.\n\nApart from repost' answer,\nAre you using the same permissions while using from AWS console and CLI? Make sure these have same permissions. Also, what about bucket policy - does it allow writing from both the console user and you CLI profile?\n\nHi, thanks for your help but the above worked solution seemed to work for me. I just needed to add the s3-bucket-owner parameter"
}