{
  "body": "My production access request is denied. Also, ETA was 24 hours, i've got reply in 4 days. I'm new customer in AWS i understand, that this is security, but how i can use SES if AWS dont want to give me a chance?\n\nthis is not a big problem. there a big numbers of auto approval accounts at market.\n\nMaybe raise a Support ticket and ask them for reasons for denial. Most likely they will ask you for more details. Maybe, it is flagged as insufficient or unclear use case.\n\nI described every process, bounces, complaints, volume, what messages i plan to send and etc. But i dont understand, what i can do more.\n\nNow the approval policy in SES is such that it is easier to find an account somewhere on the forums and use it.\nWhile you are trying to gain access to production in an honest way, scammers make automatic approvals in two clicks and sell them\nhttps://www.youtube.com/watch?v=RpyrR62hGEw&t=38s\n\nThere is no description how they do it.\n\nI understand your frustration with having your Amazon SES Production Access request denied, especially after waiting longer than the expected timeframe.\nWhen AWS denies SES production access, they typically don't provide specific details due to security policies. However, there are several steps you can take to address this situation:\nReview your use case thoroughly to ensure it complies with AWS's Acceptable Use Policy and Service Terms.\nSince you mentioned being a new AWS customer, this could be a factor. AWS often requires users to build trust by using the sandbox environment for a while before granting production access.\nConsider reapplying with more detailed information about:\nThe specific types of emails you plan to send (transactional, etc.)\nYour estimated email volume\nHow you'll handle bounces and complaints\nYour methods for ensuring compliance with email best practices\nImplement proper email authentication (SPF, DKIM, DMARC) and describe your plans for handling bounces and complaints.\nOpen a new support case explaining your situation, referencing the previous case ID, and asking for guidance on how to proceed.\nAWS takes email sending privileges seriously to maintain the service's reputation and prevent abuse. While waiting for production access, you can continue using the sandbox environment with its limitations to build a positive sending history that demonstrates responsible use of the service.\nSources\nProduction Access to Amazon SES Denied - what to do? | AWS re:Post\nBeing Rejected for SES without a valid reason. | AWS re:Post\nSES: Production Access | AWS re:Post"
}