{
  "body": "Hi there. I'm writing as someone who manages multiple accounts for a legitimate business and knows how hard it used to be to get Amazon SES production access. I went through everything — reviews, use case justifications, domain verifications — every account was a real effort.\nNow? Auto-approvals are everywhere. Forums are flooded with ultra-cheap SES production accounts being sold for next to nothing. These shady \"competitors\" blast spam with zero care. If they get blocked — who cares? They just grab another throwaway account.\nMeanwhile, those of us who follow the rules are facing delays, sending limits, constant reviews, and even account restrictions. Our deliverability is dropping because the system treats all senders as potential spammers now.\nPlanning legitimate campaigns has become a challenge. Reliability is going down. And it’s frustrating — we’ve invested time, money, and effort building a clean reputation, only to be punished because of others abusing the system.\nPlease take a closer look — auto-approval isn’t helping real businesses. It’s empowering spammers.\n\nFully agree with everything said here.\nI’ve also seen these auto-approved SES accounts being sold on public forums — I even tested a few just to confirm. Some had Production Access in up to 11 regions granted instantly. No justification, no domain, no anything. Meanwhile, my legitimate accounts — with warmup histories, verified domains, and good metrics — are being restricted or delayed. I even got sandboxed after reporting this behavior.\nHow is it fair that bad actors get instant access while people trying to follow AWS policy get punished? This loophole is being exploited\nat scale\n. SES needs to close this gap or they risk undermining all the trust they’ve built with honest senders.\n\nAbsolutely agree with everything you've said. The auto-approval system is turning into a disaster for legitimate senders. It's making it way too easy for bad actors to flood inboxes with spam, and in the process, it's destroying the reputation of the entire SES ecosystem.\nWe're seeing the fallout firsthand — increased bounce rates, more emails hitting spam folders, and legitimate businesses getting flagged or throttled through no fault of their own. When spammers abuse the system and burn through throwaway accounts, we all pay the price. It drags down IP reputation and trust, and it makes it harder for real companies to get emails delivered — even after doing everything by the book.\nThe long-term damage could be huge. If SES keeps getting associated with spam, inbox providers will start treating all SES mail more harshly. That means more scrutiny, more deliverability issues, and fewer tools for honest businesses.\nAuto-approvals might save time in the short term, but the cost to the entire platform is too high. Amazon really needs to take this seriously — or they risk alienating the very customers they should be protecting.\n\nI recently contacted support regarding this issue, look what they replied to me.\nHello,\nThank you for your abuse report. We were unable to identify the customer responsible for the reported activity. Due to the frequency with which AWS public IP addresses can change ownership, we will need additional information in order to identify the responsible customer(s).\nFor security reasons, we do not open or accept attachments. When replying, please provide plain-text logs of the abusive activity, including the following information, in the body of your email:\n* Full e-mail header and HTML content of the spam message\nFor a faster response, please resubmit your report using the form at\nhttps://aws.amazon.com/forms/report-abuse\nWe look forward to hearing from you shortly.\nRegards,\nAWS Trust & Safety\n\nThat is, they directly indicate that one IP address is used for multiple users, and they do not see a problem here that this IP address is shared between a bona fide user and a spammer.\n\nWhat stupidity...\nHow many times have I tried to gain access to production for my legitimate business, nothing has worked, and here someone clicked the mouse a few times and has access to production. CIRCUS\nhttps://www.youtube.com/watch?v=RpyrR62hGEw\n\nYes, this problem still available.\nScamers make hundreds of such accounts and sell them.\nI could not send messages at my old accounts - because system paused account with low bounce and complaint rate.\nMaybe AWS SES could stop this?\n\nFew days ago I got denied my request for SES production.\nBut I found guy who made autoapproval and I take SES production account from him.\nIt is a paradise system for spammers.\n\nI also wrote to them directly, this is what they replied to me and attention - THEY BLOCKED MY ACCOUNT\nThank you for reporting potential abuse originating from AWS Simple Email Service (SES). We take this kind of activity very seriously. We will investigate this matter and take any appropriate action against the account in question.\nFor future reports related to SES endpoints, please utilize the AWS SES Abuse reporting email alias email-abuse(email)amazon.com. Also ensure that you include the full header and HTML body of the email in question.\nFor all other AWS services related to abuse, please send reports to either trustandsafety(email)support.aws.com, or report by utilizing the Abuse report form located here:\nhttps://repost.aws/knowledge-center/report-aws-abuse\nUnfortunately, we are unable to discuss actions taken on an AWS account with anyone other than the AWS account owner. We appreciate your understanding.\n\nI'm amazed at how low AWS has fallen, they have no respect for their customers at all\n\nI wrote to the support service asking where I can complain about the work of the trust and safety team. They haven't responded for 4 days...\n\nAnd here I am — running a company that’s been in business for 15+ years, sending clean newsletters with minimal bounces and near-zero complaints, fully verified domain, personal credit card, detailed use case, privacy policy, opt-in lists… writing essays just to prove we’re legit.\nStill not \"good enough,\" apparently. Meanwhile, accounts with zero history and shady intent fly through the system like VIPs.\nHow is this sustainable?\n\nIt's great that you brought this issue to the attention of the SES team.\nI hope AWS can resolve this issue soon.\n\nHow long will this problem last?\nwhen will I be able to use SES and not get paused due to spammers and auto-approvals?"
}