{
  "body": "The Instance Scheduler on AWS doesn’t record my Amazon Elastic Compute Cloud (Amazon EC2) instance start and stop times as expected.\n\nResolution\nIf your Amazon EC2 instance doesn't start and stop as expected, then check the following configurations on the\nInstance Scheduler on AWS\n.\nSchedule and period settings\nMake sure that you correctly configured the\n--weekdays, --begintime, --endtime, --region\n, and\n--stack\noptions for\ncreate-period\n. Example command:\nscheduler-cli create-period --name \"your-period-name\" --region example-region --weekdays mon-fri --begintime hh:mm --endtime hh:mm --stack your-stack-name\nNote:\nReplace\nyour-period-name\nwith your period name,\nexample-region\nwith your AWS Region, and\nmon-fri\nwith the weekdays for the period. Also, replace the begin time\nhh:mm\nwith the hour and minutes to start, the end time\nhh:mm\nwith the hour and minutes to end, and\nyour-stack-name\nwith your scheduler stack.\nAlso, make sure that you correctly configured the\n--periods\n,\n--timezone\n, and\n--name\noptions for\ncreate-schedule\n. Example command:\nscheduler-cli create-schedule --name your-schedule-name --stack your-stack-name --timezone Asia/Tokyo --periods your-period-name\nNote:\nReplace\nyour-schedule-name\nwith the name of the scheduling tag,\nyour-stack-name\nwith your scheduler stack, and\nAsia/Tokyo\nwith your timezone. Also, replace\nyour-period-name\nwith the period name that you configured when you ran the\ncreate-period\ncommand.\nIAM role settings and access permission\nConfirm that you correctly configured the\nAWS Identity and Access Management (IAM) role for Instance Scheduler on AWS\n.\nYou can use an encrypted Amazon Elastic Block Storage (Amazon EBS) volume for your instance. If you do, then you must\ngrant Instance Scheduler on AWS permission to use the associated AWS Key Management Service (AWS KMS key)\n.\nInstance Tag setting\nWhen you\ncreate the AWS CloudFormation scheduler stack\n, choose\nSpecify stack details\n. For\nSchedule tag key\n, enter the schedule name that you specified when you ran the\ncreate-schedule\ncommand.\nCloudFormation stack settings\nMake sure that you created the CloudFormation stack in the same Region as the instance. Otherwise, create a new stack in the correct Region."
}