{
  "body": "So I am trying to allow all users to change passwords.   I have my test account with a basic user group and really no other permissions.  When that user tries to change via console, the message is;\nYou don't have permission to iam:ChangePassword. To request access, copy the following text and send it to your AWS administrator.\nAmazonQ says to look for an explicit deny but there is none anywhere.    The security console had a lot of not allowed, I want them to be able to create their own keys, and as I built this policy those errors are gone and just trying to see how I can diagnose more.  The policy I have for that is;\n{\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n        {\n            \"Sid\": \"AllowViewAccountInfo\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"iam:GetAccountPasswordPolicy\",\n                \"iam:GetAccountSummary\"\n            ],\n            \"Resource\": \"*\"\n        },\n        {\n            \"Sid\": \"AllowManageOwnPasswords\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"iam:ChangePassword\",\n                \"iam:GetUser\",\n                \"iam:UpdateLoginProfile\",\n                \"iam:GetLoginProfile\"\n            ],\n            \"Resource\": \"arn:aws:iam::*:user/${aws:username}\"\n        },\n        {\n            \"Sid\": \"AllowManageOwnAccessKeys\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"iam:DeleteAccessKey\",\n                \"iam:ListAccessKeys\",\n                \"iam:GetAccessKeyLastUsed\"\n            ],\n            \"Resource\": \"arn:aws:iam::*:user/${aws:username}\"\n        },\n        {\n            \"Sid\": \"AllowManageOwnSigningCertificates\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"iam:DeleteSigningCertificate\",\n                \"iam:ListSigningCertificates\",\n                \"iam:UpdateSigningCertificate\",\n                \"iam:UploadSigningCertificate\"\n            ],\n            \"Resource\": \"arn:aws:iam::*:user/${aws:username}\"\n        },\n        {\n            \"Sid\": \"AllowManageOwnSSHPublicKeys\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"iam:GetSSHPublicKey\",\n                \"iam:ListSSHPublicKeys\"\n            ],\n            \"Resource\": \"arn:aws:iam::*:user/${aws:username}\"\n        },\n        {\n            \"Sid\": \"AllowManageOwnGitCredentials\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"iam:CreateServiceSpecificCredential\",\n                \"iam:DeleteServiceSpecificCredential\",\n                \"iam:ListServiceSpecificCredentials\",\n                \"iam:ResetServiceSpecificCredential\",\n                \"iam:UpdateServiceSpecificCredential\"\n            ],\n            \"Resource\": \"arn:aws:iam::*:user/${aws:username}\"\n        }\n    ]\n}\nAny help on this is appreciated.\n\nThe issue you're experiencing is likely related to permissions, but not necessarily due to an explicit deny. For IAM users to change their own passwords, they need specific permissions, and there might be a few things to check:\nFirst, ensure that the policy you've created is actually attached to the user or group in question. Even with a well-crafted policy, if it's not attached to the user or their group, they won't have the necessary permissions.\nYour policy looks mostly correct for allowing users to change their passwords. The \"AllowManageOwnPasswords\" section includes the necessary\niam:ChangePassword\npermission.\nYou might also need to enable the account password policy to allow users to change their own passwords. This is a separate setting at the account level. You can update this using the AWS Management Console or by running the AWS CLI command:\naws iam update-account-password-policy\nIf you're using the AWS CLI to change passwords, especially with special characters, make sure you're using the\nchange-password\ncommand correctly.\nCheck if there are any other policies attached to the user or their groups that might be conflicting with your permissions policy.\nFor users to change their passwords through the console, they may also need the\niam:ListUsers\npermission to access their own user page. Consider adding this permission to your \"AllowViewAccountInfo\" statement.\nIf you want users to be able to change their password from their own user page (rather than just the Security Credentials page), ensure they have both\niam:GetLoginProfile\nand\niam:UpdateLoginProfile\npermissions, which you've already included.\nIf you've verified all these points and users still can't change their passwords, you might want to check if there are any Service Control Policies (SCPs) in AWS Organizations that could be restricting these actions.\nSources\nPermit IAM users to change their own passwords - AWS Identity and Access Management\nHow do I change my password on the AWS Management Console | AWS re:Post\nResolve the IAM user password error \"user is not authorized or password does not comply\" | AWS re:Post\nIAM: Allows IAM users to update their own credentials programmatically and in the console - AWS Identity and Access Management\n\nHello.\nTo change the password of an IAM user, use the ChangePassword API.\nTherefore, at a minimum, your IAM policy must allow \"iam:ChangePassword\".\nAs described in the following document, to allow IAM users to change only their own passwords, you can set the following IAM policy to allow them to change their passwords.\nhttps://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_passwords_enable-user-change.html#proc_letselectuserschangepassword\n{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Effect\": \"Allow\",\n      \"Action\": \"iam:GetAccountPasswordPolicy\",\n      \"Resource\": \"*\"\n    },\n    {\n      \"Effect\": \"Allow\",\n      \"Action\": \"iam:ChangePassword\",\n      \"Resource\": \"arn:aws:iam::*:user/${aws:username}\"\n    }\n  ]\n}\n\nThe policy that you have listed\nshould\nallow users to reset their own passwords, since you already have\n\"iam:GetAccountPasswordPolicy\"\nand\n\"iam:ChangePassword\"\nlisted.\nThings to check next:\nEnsure the policy is actually attached to the users!\nCheck CloudTrail logs (\nhttps://us-east-1.console.aws.amazon.com/cloudtrailv2/home?region=us-east-1#/events?ReadOnly=false\n) for\nChangePassword\nevents or other similar actions taken by the user. You can view the events to see what was allowed and what was denied, along with any error messages. It may be that some other action is getting denied, or the error message may tell you that there is an explicit deny somewhere. For example:\nIf all still looks OK, check for explicit denies in the following places:\nOther policies attached to the user/group\nOrganization SCPs\nA Permissions Boundary attached to the user\n\nOk, so there is no Deny's and the only thing I did was run\naws iam update-account-password-policy\nAfter that, the user was able to reset their password.  The only question I have is when I visit the password policy page no longer shows what was there (15 characters, the checkbox's are all no longer there) BUT I am able to change!"
}