{
  "body": "EC2 / Elastic Beanstalk\nWhy does Elastic Beanstalk still use Auto Scaling launch configurations after switching to an EC2 launch template?\nI configured my environment to use an EC2 launch template with IMDSv2 and gp3 volumes, but Elastic Beanstalk continues to use Auto Scaling launch configurations instead. Has anyone resolved this or is it a limitation with the Beanstalk service?\n\nAWS is phasing out launch configurations in favor of launch templates, but there might be some confusion in your environment setup.\nTo ensure Elastic Beanstalk uses launch templates instead of launch configurations, you need to set at least one of these specific options in your environment configuration:\nSet RootVolumeType to gp3\nInclude gp3 in BlockDeviceMappings\nSet DisableIMDSv1 to true\nSet EnableSpot to true\nIf you've already set these options but Elastic Beanstalk is still using launch configurations, you might need to check how you're applying these settings. You can use an .ebextensions configuration file to ensure these settings persist, especially after managed updates.\nFor example, create a file in the .ebextensions folder of your application source bundle with content like:\noption_settings:\naws:autoscaling:launchconfiguration:\nDisableIMDSv1: True\nRootVolumeType: gp3\nThis should signal to Elastic Beanstalk to use launch templates instead of launch configurations. If you're still experiencing issues after properly configuring these settings, it might be worth checking your IAM permissions to ensure your account has the necessary permissions for working with launch templates, such as ec2:CreateLaunchTemplate and related permissions.\nStarting October 1, 2024, new AWS accounts will no longer support the creation of launch configurations, making this transition to launch templates mandatory.\nSources\nHelp getting a Flask App to run on Elastic Beanstalk under new Launch Configuration | AWS re:Post\nHow to create EC2 Beanstalk with launch template? | AWS re:Post\nElastic Beanstalk Environment Creation Failing Due to Launch Configuration Restrictions (probably!) | AWS re:Post"
}