{
  "body": "Moin\nItry to sign in to Aws App Studio...\nhttps://k8zjh.eu-west-1.appstudio.aws/auth/sign-in?redirectUri=https%3A%2F%2Fk8zjh.eu-west-1.appstudio.aws%2F\nI got a error message in a box saying:\n\"Sign in failed\nSomething went wrong while trying to access your identity provider; please try again later.\"\nAre they down ?\n\nIt appears you're having trouble signing in to AWS App Studio. The error message suggests there might be an issue with accessing your identity provider, which for App Studio is typically IAM Identity Center.\nThis could be due to several reasons:\nYou may be using incorrect credentials. When setting up App Studio without an existing IAM Identity Center instance, each user should have received an email invitation to join IAM Identity Center. You need to accept this invitation and create a password for your IAM Identity Center user credentials. Then you can use these credentials to log into App Studio.\nIf you've already set up credentials but can't remember your username or password, you'll need to contact your administrator. They can use the IAM Identity Center console to view your username or reset your password.\nYou might be trying to sign in using the wrong method. IAM Identity Center users need to use their specific access portal URL rather than standard IAM user sign-in pages. The access portal URL typically includes \"awsapps.com/start\" or \"signin.aws/platform/login\".\nThere could be a temporary system issue with App Studio or IAM Identity Center.\nI recommend checking if you're using the correct credentials, contacting your administrator if you need help with your username or password, or trying again later if it's a temporary system issue. The error is not necessarily indicating that the service is \"down\" but rather that there's an authentication issue that needs to be resolved.\nSources\nTroubleshooting App Studio setup, permissions, and onboarding - AWS App Studio\nSetting up and signing in to AWS App Studio - AWS App Studio\nUnable to sign-in IAM User | AWS re:Post\nTroubleshooting AWS account sign-in issues - AWS Sign-In\n\nusing App Studio is only possible if you are having the IAM Service configured in Ireland. So removing in from Frankfurt and setting up in Ireland helped"
}