{
  "body": "Hi all\nIn the AWS Backup plan template, I noticed that daily, weekly, and monthly backup rules are configured with different retention periods—5 weeks, 3 months, and 5 years. Given that each rule operates independently, what is the advantage of using multiple rules instead of a single daily backup rule with a 5-year retention period?\nWhat are the key benefits of structuring backup retention this way, and how does it enhance backup management?\nThanks.\n\nThe use of daily, weekly, and monthly backup rules with different retention periods provides several important advantages over using a single daily backup rule with a long retention period:\nStorage cost optimization\n: Different retention periods allow you to keep fewer backups as time passes. For example, you might keep daily backups for 5 weeks, but only monthly backups for 5 years. This tiered approach significantly reduces storage costs compared to keeping every daily backup for 5 years.\nGranular recovery options\n: This approach provides different levels of recovery granularity based on how recent the data is. You have daily recovery points for recent data when you need fine-grained recovery options, while still maintaining longer-term recovery points at wider intervals.\nOrganizational policy alignment\n: Multiple backup rules with different frequencies and retention periods make it easier to implement organization-wide backup policies that align with different compliance and business requirements. For example, some data might need daily backups for operational recovery, while other data requires longer retention for compliance.\nResource tagging efficiency\n: You can use tags to assign resources to specific backup plans. For instance, you could tag resources with \"backup:daily\" or \"backup:monthly\" to include them in the appropriate backup plan, making it easier to manage which resources get backed up at which frequency.\nBackup management simplification\n: Having separate rules makes it easier to manage and audit your backup strategy, as you can clearly see which backups are being retained for which purposes.\nAWS Backup handles overlapping rules efficiently. When rules overlap, AWS Backup retains the backup under the rule with the longer retention period, avoiding unnecessary duplication of backup data while ensuring your retention requirements are met.\nSources\nBackup plan options and configuration - AWS Backup\nBackup and recovery using AWS Backup - AWS Prescriptive Guidance\nAWS Backup - S3 Incremental Backup and Potential Duplication | AWS re:Post\nHow continuity management works - AMS Advanced User Guide\n\nThe main reason is cost and practicality.\nWith daily backups only - you need to pay for 365*5 = ~20k snapshots\nWith daily, weekly, monthly, yearly backup rule - you need to pay for = 100 snapshot.\nYes, backups are incremental but it will still cost something.\nAlso, for practicality, it does not make sense to store daily backups from 4-5 yrs ago. Does it? Many of the times, the backups are kept for compliance reasons, and not necessary to keep daily."
}