{
  "body": "Hi, please could you guide me or show me a use case for this:\nI have a EC2 on AWS VPC that has SAP BW service installed. SAP BW generates csv files (0kb-30GB) that can be sended to NFS. Then I think S3 File Gateway could be a way to receive thousands of csv files from SAp BW that reaches S3 File Gateway to be available to S3 Standard. Then I could use this event to trigger next steps, maybe python app in Amazon EKS.\nI have read this docs\nhttps://aws.amazon.com/pt/blogs/storage/integrate-an-sap-ase-database-to-amazon-s3-using-aws-storage-gateway/\nthat looks like my case but I would like to know a if there is a guidance and drawbacks in my case.\nWhat is the best practices to do the network and connection from EC2 that has SAP BW installed?\nAfter S3 File Gateway creation and receive a csv file it will be available synchronously in S3 Standard? WHat is the latency and throughput?\nHow do I configure S3 File Gateway to communicate to S3 Standard?\nWhat is the best practice to after receiving the csv file from S3 File Gateway in S3 Standard to move this file to another S3 Standard?\nWhat is the costs of this process?\n\nAmazon S3 File Gateway is a suitable solution for your SAP BW use case, as it allows your EC2 instance running SAP BW to write CSV files to an NFS mount point, which then stores the data in Amazon S3.\nNetwork and Connection Best Practices:\nWhen configuring your S3 File Gateway for SAP BW on EC2, you should:\nConfigure security groups on your SAP Content Server EC2 instance to allow only the source SAP application servers to communicate with the SAP Content Server via the required TCP/IP ports\nDeploy the S3 File Gateway as a virtual machine in your AWS environment (you can use an EC2 instance)\nMount the S3 File Gateway as a filesystem mount point (e.g., \"/content_server\") on your SAP BW EC2 instance\nS3 Synchronization and Performance:\nFiles written to the S3 File Gateway are not immediately available in S3. The gateway uses local cache storage to provide low-latency access to recently accessed data and to buffer data pending upload to S3. The gateway manages data transfer to AWS, optimizes and streams data in parallel, and manages bandwidth consumption. The actual latency and throughput depend on factors like file size, network conditions, and cache configuration.\nConfiguring S3 File Gateway with S3 Standard:\nSetting up S3 File Gateway is straightforward using the launch wizard for Storage Gateway:\nDeploy the gateway using an EC2 instance in your AWS environment\nConfigure Storage Gateway shares to be accessible through the NFS protocol\nDuring setup, you'll specify which S3 bucket should store your files\nFiles and folders will be stored as objects in your designated S3 bucket\nMoving Files Between S3 Buckets:\nAfter files arrive in your S3 bucket from the File Gateway, you can:\nUse S3 event notifications to trigger AWS Lambda functions to move the files\nImplement S3 lifecycle policies to automatically transition objects\nUse AWS Step Functions or other AWS services to orchestrate the movement of files based on your specific requirements\nCost Considerations:\nThe costs for this solution include:\nStorage Gateway service fees\nS3 storage costs for your data\nData transfer costs\nEC2 instance costs if you're running the gateway on EC2\nCache storage costs\nS3 File Gateway offers cost advantages compared to maintaining additional database instances or using other storage solutions, particularly for workloads like yours that involve storing and processing large numbers of files.\nSources\nSustainable and durable SAP document and data archiving with Amazon S3 | AWS for SAP\nWhat is Amazon S3 File Gateway - AWS Storage Gateway\nAWS Storage Gateway - AWS Prescriptive Guidance\nStorage Gateway - AWS Prescriptive Guidance\n\nHi Felipe,\nGreat use case — and yes, Amazon S3 File Gateway is a good fit for integrating SAP BW output into your S3-based processing pipeline. I’ll walk through your questions step by step with best practices and considerations:\nUse Case Feasibility & Best Practices\nYes, this architecture is valid:\nSAP BW EC2 ➜ writes CSVs to S3 File Gateway (NFS) ➜ data lands in S3 Standard ➜ triggers EKS/Lambda/EventBridge.\nTo optimize this:\nDeploy the S3 File Gateway as an EC2 instance in the same VPC and subnet as your SAP BW server.\nUse NFS v4 to mount the gateway’s share (e.g., /sap_data).\nEnsure your EC2 SAP instance and S3 File Gateway have appropriate IAM roles and security groups (allow NFS TCP traffic).\nSync to S3 & Latency\nFile upload is not instant — once SAP writes to the mount point, the File Gateway uploads in the background.\nLatency: Typically a few seconds to minutes, depending on:\nFile size\nCache size and utilization\nNetwork throughput to S3\nFor large files (like 30GB CSVs), consider using multipart uploads or parallelization in your SAP logic if possible.\nHow to Configure Gateway to Write to S3 Standard\nIn Storage Gateway setup:\nChoose File Gateway\nSet bucket destination (it defaults to Standard class unless configured otherwise)\nChoose NFS as the protocol\nAssign an IAM role that grants s3:PutObject, GetObject, and ListBucket on the destination bucket\nMoving Files to Another S3 Bucket\nOnce the files land in your primary bucket, you have multiple options to move or copy them:\nS3 Event Notifications → trigger a Lambda function\nUse Amazon EventBridge with object-level events (if supported)\nS3 Batch Operations or Step Functions for periodic processing\nS3 Lifecycle Rules to transition/move objects\nCost Considerations\nHere's what to expect:\nComponent\tCost Notes\nS3 File Gateway\t$0.01/GB/month of data written\nS3 Standard\t$0.023/GB/month (storage)\nEC2 (for Gateway host)\tBased on instance type, EBS usage\nData Transfer\tNo cost for upload to S3 in same Region\nLambda/EventBridge/EKS\tPay-per-use (minimal unless scaled heavily)\nTip: Consider S3 Intelligent-Tiering if files are infrequently accessed after processing.\nSummary\n✔️ Yes, your design is sound\n✔️ Deploy File Gateway in same subnet as SAP EC2\n✔️ Mount NFS, configure correct IAM + security groups\n✔️ Use S3 Events or lifecycle for downstream steps\n✔️ Expect some delay due to File Gateway’s background uploads\n✔️ Costs are predictable and manageable for your scale\nLet me know if you want example mount commands or Lambda starter code!\n— (Sharing this to help others connecting SAP BW to S3 using File Gateway for batch processing and analytics pipelines.)\n\nHi Felipe,\nWhile the solution using S3 FGW sounds like it might work, I'm curious if you have considered using an FSx offering, which would provide additional features from a file system perspective such as snapshots, better performance for small file workloads, high availability, etc.\nIf your data needs to land in S3, for any specific reason, due to further processing downstream, or other apps that need to access via S3 directly, then S3 FGW could be a fit. But note there is no HA for EC2 based Storage Gateways, and it does have some limitations surrounding small file workloads (<5 MB files) especially when there are millions of small files, and it does write asynchronously.\nMy suggestion would be to work with your account team or through support case to take a deeper and more holistic look at the workload and the business requirements with a specialist, prior to moving forward. I want to make sure you are aware of all your options, potential drawbacks, and other limitations of the solution.\nThe blog you referenced, was particularly for a Database Backup use case, where S3 FGW is a target for backup data.\nI would suggest taking a look at FSxZ INT as well, as that has HA, NFS, and a very comparable price point to S3. It also removes the complexity of needing to maintain an EC2 instance to run the S3 FGW.\nMore details on the workload requirements would be great to see, such as amount of data, performance requirements, data protection requirements, availability requirements, etc.\nRegards,\nEd"
}