{
  "body": "I have an Amazon OpenSearch domain configured with internal users only (no IAM users or Cognito). I’m trying to set up snapshot backups to an S3 bucket.\nI followed the AWS documentation and created the following IAM role:\narn:aws:iam::<AWS_ACC>:role/opensearch-snapshot-role\nThe trust policy:\n{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Effect\": \"Allow\",\n      \"Principal\": {\n        \"Service\": \"es.amazonaws.com\"\n      },\n      \"Action\": \"sts:AssumeRole\"\n    }\n  ]\n}\nThe permissions policy attached to the role:\n{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Action\": [\n        \"s3:PutObject\",\n        \"s3:GetObject\",\n        \"s3:ListBucket\",\n        \"s3:DeleteObject\"\n      ],\n      \"Effect\": \"Allow\",\n      \"Resource\": [\n        \"arn:aws:s3:::opensearch.backup\",\n        \"arn:aws:s3:::opensearch.backup/*\"\n      ]\n    }\n  ]\n}\nHowever, when trying to register the snapshot repository via Dev Tools (logged in as the OpenSearch master user), I get this error:\n{\n  \"Message\": \"User: anonymous is not authorized to perform: iam:PassRole on resource: arn:aws:iam::<AWS_ACC>:role/opensearch-snapshot-role because no resource-based policy allows the iam:PassRole action\"\n}\nHow can I allow internal users (especially the master user) to perform the iam:PassRole required to use this role for snapshots?\nDo I need to attach a resource-based policy somewhere else or configure something differently since I’m not using IAM-authenticated users?\n\nThe error you're encountering is related to permissions required for passing an IAM role to the OpenSearch service. When using internal users (fine-grained access control) with OpenSearch, there's still a need to properly configure IAM permissions for certain operations like S3 snapshots.\nTo resolve the \"not authorized to perform: iam:PassRole\" error, you need to:\nCreate or modify an IAM user/role that you'll use to make the API call to register the snapshot repository.\nAttach a policy to this IAM user/role that explicitly allows the\niam:PassRole\npermission for your snapshot role. The policy should look similar to:\n{\n\"Version\": \"2012-10-17\",\n\"Statement\": [\n{\n\"Effect\": \"Allow\",\n\"Action\": \"iam:PassRole\",\n\"Resource\": \"arn:aws:iam::<AWS_ACC>:role/opensearch-snapshot-role\"\n},\n{\n\"Effect\": \"Allow\",\n\"Action\": \"es:ESHttpPut\",\n\"Resource\": \"arn:aws:es:<region>:<AWS_ACC>:domain/<domain-name>/*\"\n}\n]\n}\nInstead of using the OpenSearch dashboard's Dev Tools to register the repository, you'll need to use the AWS SDK or CLI with the IAM credentials of the user/role that has the PassRole permission.\nThe key issue is that when using internal users in OpenSearch, those users don't have AWS IAM permissions. The \"anonymous\" in the error message indicates that the request isn't being made with valid IAM credentials that have the PassRole permission. Even though you're authenticated to the OpenSearch dashboard as the master user, that authentication doesn't provide IAM permissions.\nFor operations that require IAM permissions like registering an S3 snapshot repository, you need to use AWS credentials with the appropriate IAM permissions outside of the OpenSearch dashboard interface.\nSources\nCreating index snapshots in Amazon OpenSearch Service - Amazon OpenSearch Service\nResolve the IAM error \"not authorized to perform iam:PassRole\" | AWS re:Post"
}