{
  "body": "Hi,\nThe IoT device we are working on has no control on the rate to send data. It sends data for every 2 to 3 secs. We are storing it in timestream database by creating a rule.\nNow we want to store data for every 5 min interval. For this we want to store the payload which has timestamp to be taken as reference and after 5 minutes w.r.t timestamp need to trigger the timestream to store the data.\nCan I achieve it by just changing IoT rule or I need to use other AWS service. Kindly suggest me with step-by-step configuration.\nThanks,\nKartheek\n\nTo achieve your goal of storing data in Amazon Timestream at 15-minute intervals from your IoT device that sends data every 2 to 3 seconds, you'll need to modify your existing setup and potentially incorporate additional AWS services. Here's a step-by-step approach to accomplish this:\nModify your existing AWS IoT Core rule:\nKeep your current rule that routes data to Timestream, but add a condition to filter messages based on a timestamp.\nIn the SQL statement of your rule, use a function like\ntimestamp()\nor extract the timestamp from your payload, and use the\nMOD\nfunction to only process messages at 15-minute intervals.\nExample SQL statement:\nSELECT * FROM 'iot/topic' WHERE MOD(FLOOR(timestamp() / 60000), 15) = 0\nThis will only process messages when the minute is divisible by 15 (i.e., every 15 minutes).\nCreate an AWS IoT Analytics pipeline:\nSet up an IoT Analytics channel to ingest your IoT data.\nCreate a pipeline that includes an activity to filter messages based on the 15-minute interval.\nAdd a datastore to temporarily hold the filtered data.\nCreate an IoT Analytics dataset:\nSet up a dataset with a schedule trigger to run every 15 minutes.\nConfigure the dataset to query the datastore and select the most recent data point within the 15-minute window.\nUse AWS Lambda with IoT Analytics:\nCreate a Lambda function that is triggered by the IoT Analytics dataset.\nThis function will receive the dataset content (the selected data point) and write it to Timestream.\nSet up IAM roles and permissions:\nEnsure that your IoT Core rule has permissions to write to IoT Analytics.\nGrant necessary permissions to the Lambda function to read from IoT Analytics and write to Timestream.\nThis approach allows you to continue receiving all data from your IoT device while selectively storing data points at 15-minute intervals in Timestream. The IoT Analytics pipeline and dataset provide the mechanism for time-based data selection, while Lambda gives you the flexibility to process and store the data as needed.\nRemember to adjust the exact implementation details based on your specific payload structure and requirements. You may need to fine-tune the SQL queries and Lambda function logic to ensure you're selecting the most appropriate data point for each 15-minute interval.\nSources\nUsing the CreateDataset API via Java and the AWS CLI - AWS IoT Analytics\nAWS IoT Core - Amazon Timestream\n\nSELECT * FROM 'iot/topic' WHERE MOD(FLOOR(timestamp() / 60000), 15) = 0, using this SQL gives data at 15th minute. But gives other packets from 0th sec to 59th sec. Here we need only first 0th or 1st sec packet. How we can achieve this?"
}