{
  "body": "I have a two simple questions\nfor which I received\n2 different ANSWERS from\nsame CUSTOMER SUPPORT\nI could have got a clear answer if I paid for SUPPORT 🙂\nI run a python code in my LINUX / WINDOWS LIGHTSAIL\nI always\ndownload files to VPS and then\nupload same files to my CLOUD STORAGE\nlet's talk only about\nLIGHTSAIL BANDWIDTH here\nI am not all talking about AWS EC2 !!!\nREGION INDIA\nhas 1.5 TB transfer per month for 12$ LINUX and 22$ WINDOWS bundles\nI am in LIGHTSAIL 90 days\nfree tier\nI know both LINUX and WINDOWS get separate 750 HOURS per month , so I can run both 24/7/30 or 31 days for free\nSO bandwidth is also separately calculated right ?\n1.5 TB for LINUX + 1.5 TB for WINDOWS\nIndia\nAmazon Lightsail APS3-TotalDataXfer-Out-Bytes\nAmazon Lightsail APS3-TotalDataXfer-In-Bytes\nI will use only 750 hours of LINUX + 750 hours of WINDOWS per month\nand my BUNDLE shows\n1.5 TB transfer\nCan I download\n2 TB to LIGHTSAIL VPS\nAmazon Lightsail\nAPS3-TotalDataXfer-In-Bytes\nand\nupload 1.5 TB  to CLOUD STORAGE\nAmazon Lightsail APS3-TotalDataXfer-Out-Bytes\nTOTAL TRANSFER is 3.5 TB\nwhile BUNDLE allows\n1.5TB transfer\nand still not get charged ( 0$ )\nor\nsince I download and upload the same FILES\nis it limited to\n750 GB download to VPS\nAmazon Lightsail\nAPS3-TotalDataXfer-In-Bytes\nand\n750 GB upload to CLOUD STORAGE\nAmazon Lightsail APS3-TotalDataXfer-Out-Bytes\nSIMPLIFIED QUESTION 2 :\nis download to VPS free\n(2 TB)\nand if I keep upload\nAPS3-TotalDataXfer-Out-Bytes\nunder 1.5 TB\nwill I get charged ???\nwhen using BUNDLE with\n1.5TB transfer\n\nHi,\nYou can refer to this FAQ for common data transfer related questions:\nhttps://aws.amazon.com/lightsail/faq/#topic-2\n.\nFor your two questions,\nAs they are different bundle ids, the linux and windows instance would each get 1.5TB of data transfer individually.  If they were the same bundle, they would get 3TB total to be used amongst themselves.\nTransfer-in and Transfer-out both count towards your data transfer allowance.  If you exceed the allowance, you will only be charged for excess data transfer out from the Lightsail instance to the Internet or another AWS resource using the public IP of the instance.   So if you are sending data to the cloud storage solution you are using via the instance private IP address (within the same VIP), you will not be charged overage on it.\n\nAs the comment says ,\nTransfer-in and Transfer-out both count towards your data transfer allowance. If you exceed the allowance, you will only be charged for excess data transfer out from the Lightsail instance to the Internet or another AWS resource using the public IP of the instance.\nHOW can I track DATA Transfer-in for each instance ?\nthe BILLS section shows only GLOBAL Data Transfer in.\nwithout knowing the DATA IN and OUT by each instance , how can I limit my usage to the BUNDLE's Transfer limit of 1.5 TB for Mumbai , Sydney and 3TB for other regions of LIGHTSAIL?\nsuppose a bundle used 1 TB IN and 400 GB OUT\nwith BILLS section I can track the 400 GB OUT only for all the INSTANCES with same BUNDLE ID only , (still , not per seperate instance)\nand also\nwith BILL section I can track only GLOBAL\nnot DATA quota per each instance.\nThis is not fair , what if I run 10 different instances , do I have to track IN and OUT for each of them ?\nif I have to TRACK each of them , there must be a simpler way to list the DATA Transfer IN & OUT per each instance , so that I can stay under the TRANSFER LIMIT.\n\nwhy AWS AI gave a different answer ?\nAWS AI answer:\nThe 1.5 TB transfer limit typically refers to the total combined inbound and outbound data transfer. However, there's an important distinction to make:\nInbound data transfer (downloads to your Lightsail instance) is generally free and does not count towards your transfer limit.\nOutbound data transfer (uploads from your Lightsail instance) is what's primarily measured against the 1.5 TB limit.\nThis means that in your scenario, you could potentially download 2 TB to your Lightsail VPS without incurring charges, as inbound transfer is typically free. However, you would need to keep your outbound transfer (uploads to cloud storage) under the 1.5 TB limit to avoid additional charges.\nTo directly answer your simplified question: Yes, you can download 2 TB to your VPS for free, and as long as you keep your outbound transfer (APS3-TotalDataXfer-Out-Bytes) under 1.5 TB, you should not be charged extra when using a bundle with 1.5 TB transfer allowance.\n\nHello,\nApologies for any confusion caused!\nI was able to locate your case and passed along your concerns to our team.\nShould you need further assistance, don't hesitate to reach out on your case for additional guidance, as we wont be able to share case specifics via this platform.\n-Elle G.\n\nAWS CUSTOMER SUPPORT gave 2 different answers\nwhich would have lead me to TOOOO MUCH\n$$$ charges\nplease provide an accurate answer\n\nBased on the information available, I can clarify the following points regarding Lightsail bandwidth:\nFor the Lightsail free tier, the bandwidth allowance is indeed separate for Linux and Windows instances. This means you can utilize up to 1.5 TB transfer per month for your Linux instance and another 1.5 TB for your Windows instance, effectively giving you a total of 3 TB of transfer during the free tier period.\nRegarding your question about download and upload limits:\nThe 1.5 TB transfer limit typically refers to the total combined inbound and outbound data transfer. However, there's an important distinction to make:\nInbound data transfer (downloads to your Lightsail instance) is generally free and does not count towards your transfer limit.\nOutbound data transfer (uploads from your Lightsail instance) is what's primarily measured against the 1.5 TB limit.\nThis means that in your scenario, you could potentially download 2 TB to your Lightsail VPS without incurring charges, as inbound transfer is typically free. However, you would need to keep your outbound transfer (uploads to cloud storage) under the 1.5 TB limit to avoid additional charges.\nTo directly answer your simplified question: Yes, you can download 2 TB to your VPS for free, and as long as you keep your outbound transfer (APS3-TotalDataXfer-Out-Bytes) under 1.5 TB, you should not be charged extra when using a bundle with 1.5 TB transfer allowance.\nIt's important to note that while this information is based on typical Lightsail policies, it's always best to monitor your usage closely and refer to the most up-to-date AWS documentation or contact AWS support for the most accurate and current information regarding your specific account and region.\nSources\nLightsail 3 Months Trial - Windows and Linux seperate? | AWS re:Post\nLightsail Usage Billing | AWS re:Post"
}