{
  "body": "I got an error about missing permissions:\nResource handler returned message: \\\"User: arn:aws:sts::123:assumed-role/something/aws-go-sdk-123 is not authorized to perform: iam:CreateRole on resource arn:12345\nNow I'm trying to map that to the IAM concepts of user, role, & policy.\nFirst let's see who I'm logged in as. When I run\naws sts get-caller-identity\n, I get something like this:\n{     \"UserId\": \"ABC123:botocore-session-123\",     \"Account\": \"1234\",     \"Arn\": \"arn:aws:sts::123:assumed-role/something/botocore-session-123\" }\nMy user id is very unhelpful here; it doesn't seem to be listed on AWS console IAM page and\niam list attached-user-policies\ntakes a username, not a user id. How can I figure out what permissions my running user / assumed role has? From there I can probably figure out how to give myself the correct permissions.\n\nThanks for the answers folks. From Shajam's & AI's answer, the most important bit from the ARN is the \"something\" role which I'm assuming. This is what actually has permissions & policies attached to it. To see what policies I have access to, I can look in UI or with\naws iam list-attached-role-policies --role-name something\n.  From there I can see that my role indeed lacks the permissions necessary to CreateTag.\nI used an admin account to grant such permissions. Unfortunately CreateRole in particular is very broad / I'm not sure how to allow a role to CreateRoles but not to create a role with admin permissions. This might involve IAM permissions boundaries. But all in all that's a separate question & my initial question of \"what permissions does whoever I'm currently signed in as have?\" has been answered.\n\nTo debug what permissions your assumed role has, you can use the\nget-account-authorization-details\ncommand from the AWS CLI. This command provides comprehensive information about all IAM users, groups, roles, and policies in your AWS account, which can help you identify your permissions.\nBased on your\nget-caller-identity\noutput, you're operating with an assumed role (\narn:aws:sts::123:assumed-role/something/botocore-session-123\n), not as a regular IAM user. This explains why you can't find your identity in the IAM users section of the console or use\nlist-attached-user-policies\n.\nTo check the permissions for your assumed role:\nRun the following command to get details about all roles in your account:\naws iam get-account-authorization-details --filter Role\nLook for the role named \"something\" in the output (the middle part of your assumed role ARN).\nWithin that role's details, examine:\nAssumeRolePolicyDocument\n- Shows who can assume this role\nAttachedManagedPolicies\n- Lists managed policies attached to the role\nRolePolicyList\n- Shows inline policies for the role\nThe error message indicates you're missing the\niam:CreateRole\npermission. To fix this, you'll need to:\nIdentify which policy needs to be modified (either an attached managed policy or an inline policy)\nAdd the\niam:CreateRole\npermission to that policy\nEnsure the policy is attached to your role\nIf you have administrator access through another user or role, you can add this permission by:\nCreating a new policy with the required permission and attaching it to your role\nModifying an existing policy to include the permission\nAdding an inline policy directly to the role\nRemember that for creating IAM roles, you typically need additional permissions like\niam:PassRole\n,\niam:CreatePolicy\n, and\niam:AttachRolePolicy\nto make the role fully functional.\nSources\nUse GetAccountAuthorizationDetails with an AWS SDK or CLI - AWS Identity and Access Management\nCreating a DAX cluster - Amazon DynamoDB\n\nThis is a pretty good answer - the\naws iam get-account-authorization-details --filter Role\ncommand actually works. My answer highlights\naws iam list-attached-role-policies --role-name something\nwhich is more specific / precisely what I asked for as opposed to needing some searching through a larger output.\n\nLet's decode the user arn:\narn:aws:sts::123:assumed-role/something/botocore-session-123\nrole name: something\nsession: botocore-session-123\nYou can find the IAM role in IAM console depending on your access level. You may or may not be able to modify your IAM permissions. It is dependent on your permissions."
}