{
  "body": "I want to secure my Amazon Elastic Compute Cloud (Amazon EC2) instance to meet a compliance program.\n\nResolution\nNote:\nIf you receive errors when you run AWS Command Line Interface (AWS CLI) commands, then see\nTroubleshooting errors for the AWS CLI\n. Also, make sure that\nyou're using the most recent AWS CLI version\n.\nIt's your responsibility to follow compliance laws, regulations, and privacy programs. For more information about existing compliance programs, see\nAWS Compliance Programs\n.\nThe following table includes common compliance programs, their requirements, and AWS services to help you configure compliance:\nCompliance program\nKey requirements\nAWS services to use\nSOC 2\nSecurity, availability, and confidentiality\nAWS Identity and Access Management (IAM), AWS CloudTrail, AWS Config, Amazon GuardDuty\nHealth Insurance Portability and Accountability Act (HIPAA)\nElectronic protected health information (ePHI) encryption, and access logs\nAWS Key Management Service (AWS KMS), CloudTrail, Amazon Macie\nPayment Card Data Security Standards (PCI DSS)\nCardholder data protection and web application firewall (WAF)\nAWS WAF, AWS Shield, Amazon Inspector\nGeneral Data Protection Regulation (GDPR)\nPersonally identifiable information (PII) protection, and right to erasure\nMacie, AWS Lambda\nISO 27001\nRisk management and encryption\nAWS Security Hub, AWS Artifact\nNational Institute of Standards and Technology (NIST) 800-53\nAccess control and logging\nAWS Organizations service control policies (SCPs)\nFederal Risk and Authorization Management Program (FedRAMP)\nUS government cloud security\nAWS GovCloud (US), AWS Control Tower\nTo meet compliance requirements, it's a best practice to implement a layered security approach for your EC2 instances.\nUse access control to adhere to the principle of least privilege\nTo configure compliance for programs such as SOC 2, NIST, and ISO 27001, take the following actions:\nUse\nthe IAM Identity Center console\nor\nthe AWS CLI\nto enforce multi-factor authentication (MFA) for all users.\nNote:\nEnforced MFA is required for PCI DSS and SOC 2.\nUse\nIAM roles instead of root users or long-term credentials\n.\nApply SCPs\nto restrict risky actions.\nSet up encryption at rest and in transit\nTo configure compliance for programs such as HIPPA, PCI DSS, and GDPR, take the following actions:\nActivate Amazon Elastic Block Store (Amazon EBS) encryption\n.\nNote:\nYou can\nset up automatic encryption for new EBS volumes and snapshots\n.\nEnforce TLS 1.2 or later\n.\nNote:\nThis is required for PCI DSS.\nUse\nAWS Certificate Manager (ACM) certificates to manage HTTPS traffic\n.\nConfigure your security groups to block non-SSL/TLS traffic.\nNote:\nTo allow only encrypted traffic, allow SSL/TLS ports such as 443, 465, and 587, and block plaintext ports such as 80, 21, and 3306. For more information about security groups, see\nSecurity group rules for different use cases\n.\nCombine security group rules with application-level enforcement, such as HTTP Strict Transport Security (HSTS).\nSet up network security firewalls\nTo configure compliance for programs such as PCI DSS, FedRAMP, and NIST, take the following actions:\nRestrict security groups to allow only the required ports.\nUse AWS WAF to protect your instance\n.\nActivate\nAmazon Virtual Private Cloud (Amazon VPC) Flow Logs to capture IP address traffic\nso that you comply with\noperational best practices for NIST 800-53\n.\nSet up audit trails\nTo configure compliance for programs such as SOC 2, ISO 27001, and HIPAA, take the following actions:\nTo activate CloudTrail for all AWS Regions,\ncreate a trail\nwith\nIsMultiRegionTrail\nset to\ntrue\n, or\nupdate your existing trails\n.\nSend logs to Amazon Detective or the Security Hub\nfor automated compliance checks.\nConfigure patch management and vulnerability scans\nTo configure compliance with programs such as PCI DSS and FedRAMP, take the following actions:\nSet up Patch Manager, a capability of AWS Systems Manager, to automatically patch your\nWindows\nand\nLinux instances\n.\nUse Amazon Inspector to scan your instances\nfor package vulnerabilities and network reachability issues.\nSet up SSH access\nTo configure compliance with programs such as SOC 2, HIPAA, PCI DSS, and NIST, take the following actions:\nAdhere to\nSSH access best practices\n.\nUse Session Manager, a capability of AWS Systems Manager, to connect to your instance\ninstead of SSH.\nRestrict security groups to specific IP addresses.\nDeactivate password login, and use SSH key pairs instead.\nRotate your SSH keys every 90 days.\nSet up threat detection\nTo configure compliance with programs such as SOC 2 and IS 27001, configure the following GuardDuty settings:\nIntegrate GuardDuty with Security Hub\nto escalate critical findings.\nSet up On-demand malware scans\n.\nTo identify security threats that most affect your environment, set up\nsuppression rules\nto remove false positives, low-value findings, and non-actionable threats.\nRetrieve information about your instances for a report\nTo get data about your instance such as ID, tags, and compliance status, run the following\ndescribe-instances\nAWS CLI command:\naws ec2 describe-instances --query Reservations[*].Instances[*].{InstanceId, InstanceType, LaunchTime, State.Name, Tags[?Key==`Name`].Value} --output text > instances.csv\nImportant:\nIt's a best practice to regularly audit and update your configuration to maintain compliance as standards change."
}