{
  "body": "During the very first run as soon as new AWS account gets created I'm receiving  Non Compliant status. But after sometime when I retrigger the evaluation without changing anything in the resource these rules are giving Complaint status. This is a custom config rule written in python.\ni'm wondering what behavior can cause this in AWS config rules, is it possible that hte order of the code in which it is written can cause this and is there anyway to fix this?\n\nThis behavior in AWS Config rules can occur for several reasons. When you first create a custom rule, AWS Config evaluates your resources against that rule, but there might be a delay in the evaluation process or issues with the Lambda function that powers your custom rule.\nThe \"INSUFFICIENT_DATA\" status might be returned initially if:\nAWS Config has not yet completed its first evaluation for the rule.\nThe Lambda function for your custom rule is failing to send evaluation results to AWS Config.\nThere might be permission issues with your Lambda function not having the proper\nconfig:PutEvaluations\npermission.\nWhen you retrigger the evaluation later, these initial issues might have been resolved automatically:\nThe Lambda function might have successfully completed its evaluation\nAny temporary permission or configuration issues might have been resolved\nAWS Config might have completed gathering all necessary data for evaluation\nTo fix this issue:\nEnsure your Lambda execution role includes the\nconfig:PutEvaluations\npermission\nVerify that the role assigned to your configuration recorder has the necessary permissions\nCheck the Lambda function logs for any errors during the initial evaluation\nConsider the order of operations in your Python code - if it's making assumptions about resource state that might not be valid during the first evaluation\nYou can also use the\nDescribeConfigRuleEvaluationStatus\nAPI to check the\nLastSuccessfulInvocationTime\nand\nLastFailedInvocationTime\nto better understand the evaluation timing.\nSources\nDescribeComplianceByConfigRule - AWS Config\nEvaluating Your Resources with AWS Config Rules - AWS Config\nComponents of an AWS Config Rule - AWS Config\nConfig rule with custom lambda permission issue | AWS re:Post\n\nYou mentioned the issue is happening on new accounts.\nWhen you create a new AWS account, not all AWS resources and service metadata are immediately available.\nSome resources may not yet exist (e.g., IAM roles, baseline buckets, default VPC, CloudTrail trail, etc.). The custom rule runs immediately and results NON_COMPLIANT. Eventually, CloudTrail is created, SCP is configured, etc and eventually the status is changed to COMPLIANT."
}