{
  "body": "My users can't access objects in the external schema in my Amazon Redshift cluster.\n\nShort description\nWhen you use external schemas in Amazon Redshift, you might receive the following error messages:\n\"Permission denied\"\n\"Operation is not supported\"\n\"External tables are not supported in views\"\nIncorrect AWS Lake Formation permissions configurations can also cause errors with Amazon Redshift Spectrum. To resolve this issue, you must grant permissions on the external schemas, not at the table level.\nResolution\nGrant permission to access objects in the external schema\nWhen an Amazon Redshift user doesn't have permission to access objects in an external schema, they might receive the following error:\n\"ERROR: permission denied for schema external_schema_name\"\nTo grant permissions to the user, complete the following steps:\nOpen the\nAmazon Redshift console\n.\nLog in as a superuser.\nRun the following command to verify user permissions for the external schema that they want to access:\nSELECT *\nFROM SVV_SCHEMA_PRIVILEGES \nWHERE identity_name = 'name_of_the_user/role/group' AND namespace_name = 'external_schema_name';\nNote:\nReplace\nname_of_the_user/role/group\nwith the name, role, or group of the user that you want to grant access to. Replace\nexternal_schema_name\nwith the name of the external schema.\nIf the preceding command doesn't return the\nUSAGE\npermission type, then the user, role, or group doesn't have permission to query the external schema.\nRun one of the following\nGRANT\ncommands to grant permission to use the external schema:\nGRANT USAGE ON SCHEMA external_schema_name TO user_name;\nGRANT USAGE ON SCHEMA external_schema_name TO role role_name;\nGRANT USAGE ON SCHEMA external_schema_name TO group group_name;\nNote:\nReplace\nexternal_schema_name\nwith the name of the external schema. Replace\nuser_name\n,\nrole_name\nor\ngroup_name\nwith the user, role, or group that you want to grant access to.\nResolve datashare permission issues\nWhen you try to grant permission on objects in an external schema, you might receive the following error message:\n\"ERROR: Operation is not supported through datashares\".\nThis error occurs in the following situations:\nThe external schema is from a database that you created from a datashare.\nThe original datashare didn't include the\nWITH PERMISSIONS\nclause.\nTo resolve this issue, recreate the database from the datashare with the\nWITH PERMISSION\nclause.\nComplete the following steps:\nRun the following command to drop the existing datashare database:\nDROP database database_created_from_datashare_name;\nNote:\nReplace\ndatabase_created_from_datashare_name\nwith the name of your database.\nRun the following command to recreate the database:\nCREATE DATABASE database_created_from_datashare_name\nWITH PERMISSIONS \nFROM DATASHARE 'datashare_name'\nOF ACCOUNT 'account_number' \nNAMESPACE 'namespace_uuid';\nNote:\nReplace\ndatabase_created_from_datashare_name\nwith the name of your database and\ndatashare_name\nwith the name of your datashare. Replace\naccount number\nwith your AWS account number and\nnamespace_uuid\nwith your namespace's Universally Unique Identifier (UUID).\nRun the following command to create the external schema:\nCREATE EXTERNAL SCHEMA external_schema_name\nFROM REDSHIFT DATABASE database_created_from_datashare_name \nSCHEMA schema_in_database_created_from_datashare;\nNote:\nReplace\nexternal_schema_name\nwith the name of the external schema and\ndatabase_created_from_datashare_name\nwith the name of your database. Replace\nschema_in_database_created_from_datashare\nwith the name of your schema that you created from a datashare.\nRun the following command to grant usage permissions:\nGRANT USAGE on SCHEMA external_schema_name to user_name;\nGRANT USAGE ON SCHEMA database_created_from_datashare_name.schema_in_datashare_name TO user_name;\nNote:\nReplace\nexternal_schema_name\nwith the external schema name. Replace\nuser_name\nwith the name of the user that you want to grant usage to. Replace\ndatabase_created_from_datashare_name\nwith the name of your database that you created from a datashare, and\nschema_in_datashare_name\nwith the name of your schema.\nRun the following\nSELECT\ncommand to grant permission to access specific tables:\nGRANT SELECT ON\nTABLE database_created_from_datashare_name.schema_in_datashare_name.table_name \nTO user_name;\nNote:\nReplace\ndatabase_created_from_datashare_name\nwith the name of the database that you created from a datashare and\nschema_in_datashare_name\nwith the name of your schema. Replace\ntable_name\nwith the name of your table and\nuser_name\nwith your username.\nTo grant access to all tables in the schema, run the following command:\nGRANT SELECT ON\nALL TABLES IN SCHEMA database_created_from_datashare_name.schema_in_datashare_name \nTO user_name;\nNote:\nReplace\ndatabase_created_from_datashare_name\nwith the name of the database that you created from a datashare and\nschema_in_datashare_name\nwith the name of your schema. Replace\nuser_name\nwith your username.\nResolve external schemas with Lake Formation permissions issues\nVerify that you turned on Lake Formation for your AWS Glue Data Catalog, and your Amazon Redshift cluster's AWS Identity and Access Management (IAM) role has the required AWS Glue Data Catalog permissions.\nFor more information, see\nRedshift Spectrum and AWS Lake Formation\nand\nManaging Lake Formation permissions\n.\nGrant granular access control with external schemas\nUse Lake Formation or role chaining to grant granular access control in Amazon Redshift Spectrum. You can grant permissions at the schema, table, or column level.\nFor more information, see\nRestrict Amazon Redshift Spectrum external table access to Amazon Redshift IAM users and groups using role chaining\nand\nGranting permissions on Data Catalog resources\n.\nUse the WITH NO SCHEMA BINDING clause when you create views with external tables\nWhen you create a view that references an external table, you might receive the following error message:\n\"ERROR: External tables are not supported in views\".\nTo resolve this issue, run the following command to create the view with the\nWITH NO SCHEMA BINDING\nclause:\nCREATE OR REPLACE VIEW view_name AS\nSELECT * FROM external_schema_name.external_table_name \nWITH NO SCHEMA BINDING ;\nNote:\nReplace\nexternal_schema_name\nwith the external schema name and\nexternal_table_name\nwith the name of the external table.\nRelated information\nSVV_EXTERNAL_SCHEMAS\nParameters for using CREATE DATABASE with a datashare\nParameters"
}