{
  "body": "Hi community,\nContext (concise)\nStartup: ResumoCast – SaaS that turns life stories into publish-ready books & multimedia packs in days, powered by AWS Bedrock, S3, DynamoDB, Lambda + n8n.\nTraction: 200 k+ YouTube followers regularly request an affordable alternative to US$30 k ghost-writing.\nGoal: Launch MVP entirely on AWS; Activate credits would cover the initial AI-compute burn.\nTimeline & what I’ve done already\nCompleted AWS Technical Essentials + three Bedrock workshops.\nArchitected the full serverless stack (Bedrock → Step Functions → Lambda → DynamoDB).\nSubmitted an AWS Activate Portfolio application via our accelerator partner.\nReceived a rejection email citing “does not meet one or more internal requirements”.\nNo specific item listed; public docs only mention a functional website, valid billing profile, and consistent business data – all appear satisfied.\nWhat I’ve double-checked\nWebsite live:\nhttps://resumocast.com.br\nBilling profile complete; valid payment method on file.\nCompany info aligned across Console, application, and corporate registry.\nAccount has no past-due balances or support tickets.\nReviewed FAQ + T&C; found no additional criteria beyond the public list.\nQuestions for the community / AWS moderators\nWhich non-public checks typically trigger this generic rejection?\nIs there a formal appeal path or a cooldown period before re-applying?\nWould a short technical demo of our Bedrock workflow help an appeal, and if so, how to share it with the Activate team?\nAny founders here who cleared a similar hurdle—what specific documentation or adjustments resolved it?\nWhy it matters\nEvery month we delay, more untold histories disappear. Our entire stack is vendor-locked to AWS; shifting clouds would set us back ~3-6 months.\nThanks in advance for any insights that can help us meet the hidden bar and get back to building\n\nI understand your frustration with the AWS Activate credits rejection. Based on the information available, there are several potential reasons for rejection that aren't explicitly stated in the public documentation.\nFirst, AWS Activate has internal requirements that go beyond what's publicly listed. These may include factors such as the nature of your business, development stage, and projected AWS usage patterns.\nCommon rejection reasons include:\nInconsistencies in business information: Even small discrepancies between your application, company website, and public records can trigger rejection.\nAccount associations: If your account or IP address has been associated with any previous policy violations, this could affect your application.\nService eligibility: Note that AWS Activate Credits cannot be applied to certain services, including some aspects of Amazon Bedrock (specifically third-party foundation models), which might be relevant to your AI-focused startup.\nAs for next steps:\nReview the AWS Activate eligibility criteria thoroughly again\nConsider reaching out directly to the AWS Activate team through their contact form for more specific feedback\nIf you're working with an accelerator partner, ask them to advocate on your behalf or provide guidance\nYou might want to check if there are any specific requirements related to your Portfolio tier application that you may have missed\nUnfortunately, AWS typically doesn't provide detailed rejection reasons due to their internal policies. Persistence is key - many startups face initial rejections but succeed after refining their applications and addressing potential issues.\nSources\nRepeated Rejections for AWS Activate Founders Credits – Need Guidance | AWS re:Post\nabout AWS startup credits | AWS re:Post\n\nHello Gustavo,\nThanks for sharing the detailed context and steps you've already taken—it's clear you've done a thorough job in preparing your application.\nFrom experience, it's quite difficult for community members to provide definitive guidance on AWS Activate rejections, as the reasons can vary and are often based on internal criteria that aren't publicly documented.\nGiven the circumstances, I strongly recommend reaching out directly to AWS Support or working through your accelerator partner to request further clarification. While community input can be helpful for general insights, only AWS can provide case-specific feedback that may help resolve the issue or clarify next steps.\nYou can open a support case here:\n👉\nhttps://support.console.aws.amazon.com/support/home#/case/create?issueType=customer-service\nWishing you the best with\nResumoCast\n!\nKind regards,\nMurali"
}