{
  "body": "I have created AWS console user with my India address, but when i tried to create an instance in Amazon connect, I am getting an error as it can't create be created with AISPL account.\n\"You're signed in with an AWS account that was provided by AISPL. These accounts cannot create Amazon Connect instances. Sign in using an account provided by AWS, and then try to create an instance. Please contact support if you need further assistance\".\nI can understand from that it won't work for accounts created from India (with INR transaction). Do we have any workaround for this ?\n\nUnfortunately, there is no direct workaround for creating Amazon Connect instances with an AWS account provided by Amazon Internet Services Pvt. Ltd (AISPL) in India. Amazon Connect is not available to customers in India using AWS through AISPL accounts.\nThis limitation is a known restriction for AWS accounts created with an Indian address. The error message you're receiving is consistent with this policy. Amazon Connect instances cannot be created or used with AISPL accounts, which are specifically for customers in India.\nThe only potential solution would be to create a new AWS account using an address outside of India. This would result in a standard AWS account rather than an AISPL account, which should then allow you to create Amazon Connect instances. However, this approach may have legal and billing implications that you'd need to consider carefully.\nIf Amazon Connect is crucial for your business needs, you may want to explore the following options:\nContact AWS Support to discuss your specific use case and see if they can provide any alternative solutions or workarounds.\nConsider using a different AWS account created with a non-Indian address, if that's feasible for your business operations.\nLook into alternative contact center solutions that are available in India and compatible with your AISPL account.\nIt's important to note that this limitation is not just a technical restriction but a regional availability issue, and as such, there's no simple workaround within the existing AISPL account structure.\nSources\nUnable to enable Amazon contact instance | AWS re:Post\nCreate an Amazon Connect instance - Amazon Connect"
}