{
  "body": "Hi, we have been hosting images on S3 for our SAAS site builder and I client mentioned that all of the images on his site have suddenly disappeared. We reviewed all access permissions and they are set to public and permissions are all good, so far as we can tell. None of our developers have made any changes or updates to anything in AWS or S3, so im baffled as to what suddenly changed. we created this in September 2023, and its has been working perfectly ever since. Now we cant find one image in the bucket. Here is one of the sites that Im referencing:\nhttps://innocentchocolate.com/\nthe reference bucket is s3.marketingonfire.ai. Pls help. thx.\n\nBased on the information provided, there are several possible reasons why your images might appear to have disappeared from your S3 bucket:\nServer-Side Encryption Issues: Your objects might have been encrypted using Server-Side Encryption with Customer-Provided Keys (SSE-C). When this happens, you need to provide the correct encryption parameters to access the files. This would explain why the files appear to be missing even though they might still exist in the bucket.\nObject Ownership Settings: If there were changes to Object Ownership settings in your bucket, especially in cross-account scenarios, this could affect access to the objects.\nIAM Policy or Bucket Policy Changes: Even if you believe permissions are set correctly, there might have been changes to IAM roles, policies, or bucket policies that are affecting access.\nBucket Region Mismatch: Ensure you're looking in the correct region (Ohio us-east-2) as mentioned in your question.\nAccidental Deletion: Although you mentioned no developers made changes, it's worth checking CloudTrail logs to confirm no accidental deletions occurred.\nTo troubleshoot this issue:\nCheck if you can list the objects in the bucket using the AWS Management Console or AWS CLI\nReview your bucket's encryption settings\nCheck CloudTrail logs for any delete operations or policy changes\nVerify that the bucket's public access settings haven't been changed\nEnsure that the bucket policy still allows public access if that's what you intended\nCheck if the objects were moved to a different prefix/folder within the bucket\nIf you can list the objects but can't access them, the issue is likely related to encryption or permissions. If you can't even list the objects, they might have been deleted or moved.\nSources\nFiles across all S3 buckets unaccessible, even from GUI | AWS re:Post\n\nYou mentioned the S3 image is no longer there. Have you checked the S3 bucket if the image is actually there or not. Are you using the correct URL (is the path and filename correct). Also, note that the url can be case sensitive."
}