I’m encountering an Access Denied error when trying to access my static website via CloudFront, which uses an S3 bucket as the origin. Below is a detailed summary of my setup, including CloudFront, Route 53, ACM, and S3 bucket settings.


S3 Bucket Configuration




Static Website Hosting: Disabled.


Block Public Access: The S3 bucket is configured to "Block all public access."


Bucket Policy: I’ve copied the bucket policy generated by CloudFront’s Origin Access Control (OAC) into the S3 bucket’s policy section.


Object Ownership: Set to Bucket Owner Enforced.


ACL: Set to Default.


CORS: Set to Default.




CloudFront Distribution Configuration


General Settings




Price Class: Set to "Use all edge locations."


Alternate Domain Name (CNAME): Set to mywebsite.com (matching the S3 bucket).


SSL Certificate: Using a custom SSL certificate from ACM for the domain.


Security Policy: Set to the recommended default setting.


HTTP Versions: Set to HTTP/2.


Default Root Object: index.html.


Standard Logging: Disabled.


IPv6: Enabled.




Origin Settings




Origin Domain: mywebsite.com.s3.us-east-1.amazonaws.com (S3 bucket).


Origin Access Control: Set to OAC, with the S3 bucket selected as the origin.


Origin Shield: Disabled.


Custom Headers: None.




CloudFront Behavior Settings




Path Pattern: Set to Default.


Origin: Set to the S3 bucket: mywebsite.com.s3.us-east-1.amazonaws.com.


Compress Objects Automatically: Set to Yes.


Viewer Protocol Policy: Set to HTTPS Only.


Allowed HTTP Methods: Set to GET, HEAD.


Restrict Viewer Access: Set to No.


Cache Key and Origin Request Policy: Set to CachingOptimized.


All other settings are left at their default values.




S3 Bucket Policy

Here is the bucket policy I’ve applied to the S3 bucket (with credentials redacted):






Route 53 Configuration


Hosted Zone Setup


A Record:




Name: Blank subdomain followed by mywebsite.com.


Record Type: A.


Alias: Set to On.


Route Traffic To: Alias to CloudFront distribution, with the correct CloudFront distribution selected.




CNAME Record:




Name: 
www.mywebsite.com
.


Record Type: CNAME.


Value: Set to the CloudFront distribution domain name.


Alias: Set to No.


TTL: Set to 300.


Routing Policy: Set to Simple.




ACM (AWS Certificate Manager) Configuration




Certificate Domain: mywebsite.com.


Certificate Status: Success.


Certificate Type: CNAME.


CNAME Name: _abc1234567890abcdef.mywebsite.com.


CNAME Value: _def9876543210ghijkl.djqtsrsxkq.acm-validations.aws.

These CNAME name and value are different from the ones I created in Route 53 for the domain.


Associated Resources: Set to the CloudFront distribution ARN.




Problem:
Despite all configurations being set correctly, I am still getting an Access Denied error when trying to access the website via the CloudFront distribution.


Questions:




Could there be a conflict between the CloudFront behavior settings, S3 bucket policy, or Route 53 configuration?


Is there any issue with how the Alias record in Route 53 interacts with the CloudFront distribution?


The CNAME entries under ACM and Route 53 appear different. Could that be causing any issues with validation or routing?


Have I overlooked any critical settings in CloudFront, Route 53, ACM, or the S3 bucket that might be causing this error?


Any help, insights, or troubleshooting steps would be greatly appreciated in resolving this Access Denied issue!




Thanks in advance!