{
  "body": "Hi All,\nHow can I use DSQL as a data source for Quicksight?\nThanks\nDan\n\nBased on my experience, there’s currently no native support in QuickSight to directly connect to DSQL (DynamoDB SQL). Unlike services like Redshift, Athena, or RDS, DSQL doesn’t appear as a selectable data source within QuickSight.\nWhat I’ve found effective is exporting the results of DSQL queries to Amazon S3 in CSV or Parquet format. Once the data is in S3, I usually use Amazon Athena to create an external table over it. QuickSight can then connect to Athena to build dashboards, which work quite well and don’t require managing additional infrastructure.\nAnother method I’ve used is to catalog the S3 data with AWS Glue. This makes it easier to manage and query the dataset using Athena or Redshift Spectrum, both of which integrate smoothly with QuickSight for visualization.\nIn cases where the use case calls for more structured or relational querying, I’ve also pushed the DSQL results into Amazon RDS or Redshift. Since QuickSight supports both as data sources, this approach allows for richer analytics capabilities.\n\nThanks for the response Arvind. Cannot help be feel that as step backwards. So any type of ootb data visualisation DSQL would not be suitable - feels like a gap that’s needs plugging. 🤔\n\nAmazon QuickSight supports Amazon Aurora as a data source, but there's no specific mention of DSQL (Distributed SQL) as a directly supported data source type in the provided information.\nTo connect QuickSight to Aurora, you would:\nEnsure your Aurora instance is in a VPC\nConfigure the security group to allow inbound traffic on port 3306 (for MySQL) or 5432 (for PostgreSQL) from QuickSight IP ranges\nConfigure QuickSight VPC access by going to Manage QuickSight > Security & permissions, and add your VPC connection with the correct VPC, Subnet, and Security Group settings\nVerify your database credentials and endpoint\nCreate a data source in QuickSight by going to Datasets > New data set, and select either MySQL or PostgreSQL (depending on your Aurora compatibility) and enter the connection details\nIf you're specifically trying to use Aurora PostgreSQL, you would provide the database host URL (e.g., instance-name.region.rds.amazonaws.com), port (typically 5432), and instance name.\nIf you encounter issues, you may need to:\nEnsure your VPC has internet access or proper NAT gateway setup\nVerify IAM role permissions for QuickSight\nWhitelist QuickSight IP ranges in the Aurora security group\nCheck Aurora logs and CloudWatch metrics for connection attempts and issues\nSources\nHow to connect AWS Q with mysql aurora | AWS re:Post\nSupported data sources - Amazon QuickSight\nDiscover insights from your Amazon Aurora PostgreSQL database using the Amazon Q Business connector | AWS Machine Learning Blog\nCreating a data source - Amazon QuickSight"
}